{"count": 513, "next": "https://api.open5e.com/v1/monsters/?armor_class=&armor_class__gt=&armor_class__gte=&armor_class__lt=&armor_class__lte=&armor_class__range=&cr=&cr__gt=10&cr__gte=&cr__lt=&cr__lte=&cr__range=&desc=&desc__icontains=&desc__iexact=&desc__in=&document__slug=&document__slug__iexact=&document__slug__in=&document__slug__not_in=&hit_points=&hit_points__gt=&hit_points__gte=&hit_points__lt=&hit_points__lte=&hit_points__range=&name=&name__icontains=&name__iexact=&page=2&page_no=&page_no__gt=&page_no__gte=&page_no__lt=&page_no__lte=&page_no__range=&size=&size__icontains=&size__iexact=&size__in=&slug=&slug__iexact=&slug__in=&type=&type__icontains=&type__iexact=&type__in=", "previous": null, "results": [{"slug": "aboleth-a5e", "desc": "", "name": "Aboleth", "size": "Large", "type": "Aberration", "subtype": "", "group": null, "alignment": "", "armor_class": 17, "armor_desc": "", "hit_points": 171, "hit_dice": "18d10+72", "speed": {"walk": 10, "swim": 40}, "strength": 20, "dexterity": 12, "constitution": 18, "intelligence": 20, "wisdom": 20, "charisma": 18, "strength_save": null, "dexterity_save": 5, "constitution_save": 8, "intelligence_save": 9, "wisdom_save": 9, "charisma_save": null, "perception": null, "skills": {"deception": 8, "history": 9, "stealth": 5}, "damage_vulnerabilities": "", "damage_resistances": "", "damage_immunities": "", "condition_immunities": "", "senses": "blindsight 30 ft., darkvision 120 ft., passive Perception 15", "languages": "Deep Speech, telepathy 120 ft.", "challenge_rating": "11", "cr": 11.0, "actions": [{"name": "Multiattack", "desc": "The aboleth attacks three times with its tentacle."}, {"name": "Tentacle", "desc": "Melee Weapon Attack: +9 to hit, reach 15 ft., one target. Hit: 19 (4d6 + 5) bludgeoning damage. The aboleth can choose instead to deal 0 damage. If the target is a creature  it makes a DC 16 Constitution saving throw. On a failure  it contracts a disease called the Sea Change. On a success  it is immune to this disease for 24 hours. While affected by this disease  the target has disadvantage on Wisdom saving throws. After 1 hour  the target grows gills  it can breathe water  its skin becomes slimy  and it begins to suffocate if it goes 12 hours without being immersed in water for at least 1 hour. This disease can be removed with a disease-removing spell cast with at least a 4th-level spell slot  and it ends 24 hours after the aboleth dies."}, {"name": "Slimy Cloud (1/Day, While Bloodied)", "desc": "While underwater  the aboleth exudes a cloud of inky slime in a 30-foot-radius sphere. Each non-aboleth creature in the area when the cloud appears makes a DC 16 Constitution saving throw. On a failure  it takes 44 (8d10) poison damage and is poisoned for 1 minute. The slime extends around corners  and the area is heavily obscured for 1 minute or until a strong current dissipates the cloud."}], "bonus_actions": null, "reactions": null, "legendary_desc": "", "legendary_actions": [{"name": "The aboleth can take 2 legendary actions", "desc": "Only one legendary action can be used at a time and only at the end of another creatures turn. It regains spent legendary actions at the start of its turn."}, {"name": "Move", "desc": "The aboleth moves up to its swim speed without provoking opportunity attacks."}, {"name": "Telepathic Summon", "desc": "One creature within 90 feet makes a DC 16 Wisdom saving throw. On a failure, it must use its reaction, if available, to move up to its speed toward the aboleth by the most direct route that avoids hazards, not avoiding opportunity attacks. This is a magical charm effect."}, {"name": "Baleful Charm (Costs 2 Actions)", "desc": "The aboleth targets one creature within 60 feet that has contracted Sea Change. The target makes a DC 16 Wisdom saving throw. On a failure, it is magically charmed by the aboleth until the aboleth dies. The target can repeat this saving throw every 24 hours and when it takes damage from the aboleth or the aboleths allies. While charmed in this way, the target can communicate telepathically with the aboleth over any distance and it follows the aboleths orders."}, {"name": "Soul Drain (Costs 2 Actions)", "desc": "One creature charmed by the aboleth takes 22 (4d10) psychic damage, and the aboleth regains hit points equal to the damage dealt."}], "special_abilities": [{"name": "Amphibious", "desc": "The aboleth can breathe air and water."}, {"name": "Innate Spellcasting", "desc": "The aboleths spellcasting ability is Charisma (spell save DC 16). It can innately cast the following spells, requiring no components: 3/day each: detect thoughts (range 120 ft, desc: ), project image (range 1 mile), phantasmal force"}], "spell_list": [], "page_no": 16, "environments": [], "img_main": null, "document__slug": "menagerie", "document__title": "Level Up Advanced 5e Monstrous Menagerie", "document__license_url": "http://open5e.com/legal", "document__url": "https://www.levelup5e.com"}, {"slug": "aboleth-nihilith", "desc": "", "name": "Aboleth, Nihilith", "size": "Large", "type": "Undead", "subtype": "", "group": null, "alignment": "chaotic evil", "armor_class": 17, "armor_desc": "natural armor", "hit_points": 135, "hit_dice": "18d10+36", "speed": {"hover": true, "walk": 10, "swim": 40, "fly": 50}, "strength": 21, "dexterity": 9, "constitution": 15, "intelligence": 18, "wisdom": 15, "charisma": 18, "strength_save": null, "dexterity_save": null, "constitution_save": 6, "intelligence_save": 8, "wisdom_save": 6, "charisma_save": null, "perception": 10, "skills": {"history": 12, "perception": 10}, "damage_vulnerabilities": "", "damage_resistances": "acid, fire, lightning, thunder (only when in ethereal form); bludgeoning, piercing and slashing from nonmagical attacks", "damage_immunities": "cold, necrotic, poison; bludgeoning, piercing and slashing from nonmagical attacks (only when in ethereal form)", "condition_immunities": "charmed, exhaustion, frightened, grappled, paralyzed, petrified, poisoned, prone, restrained", "senses": "darkvision 120 ft., passive Perception 20", "languages": "Void Speech, telepathy 120 ft.", "challenge_rating": "12", "cr": 12.0, "actions": [{"name": "Multiattack", "desc": "The nihileth makes three tentacle attacks or three withering touches, depending on what form it is in."}, {"name": "Tentacle (Material Form Only)", "desc": "Melee Weapon Attack: +9 to hit, reach 10 ft., one target. Hit: 12 (2d6 + 5) bludgeoning damage. If the target creature is hit, it must make a successful DC 14 Constitution saving throw or become diseased. The disease has no effect for 1 minute; during that time, it can be removed by lesser restoration or comparable magic. After 1 minute, the diseased creature's skin becomes translucent and slimy. The creature cannot regain hit points unless it is entirely underwater, and the disease can only be removed by heal or comparable magic. Unless the creature is fully submerged or frequently doused with water, it takes 6 (1d12) acid damage every 10 minutes. If a creature dies while diseased, it rises in 1d6 rounds as a nihilethic zombie. This zombie is permanently dominated by the nihileth.", "attack_bonus": 9, "damage_dice": "2d6+5"}, {"name": "Withering Touch (Ethereal Form Only)", "desc": "Melee Weapon Attack: +8 to hit, reach 10 ft., one creature. Hit: 14 (3d6 + 4) necrotic damage.", "attack_bonus": 8, "damage_dice": "3d6+4"}, {"name": "Form Swap", "desc": "As a bonus action, the nihileth can alter between its material and ethereal forms at will."}, {"name": "Tail (Material Form Only)", "desc": "Melee Weapon Attack: +9 to hit, reach 10 ft., one target. Hit: 15 (3d6 + 5) bludgeoning damage.", "attack_bonus": 9, "damage_dice": "3d6+5"}, {"name": "Enslave (3/day)", "desc": "The nihileth targets one creature it can see within 30 ft. of it. The target must succeed on a DC 14 Wisdom saving throw or be magically charmed by the nihileth until the nihileth dies or until it is on a different plane of existence from the target. The charmed target is under the nihileth's control and can't take reactions, and the nihileth and the target can communicate telepathically with each other over any distance. Whenever the charmed target takes damage, the target can repeat the saving throw. On a success, the effect ends. No more than once every 24 hours, the target can also repeat the saving throw when it is at least 1 mile away from the nihileth."}], "bonus_actions": null, "reactions": [{"name": "Void Body", "desc": "The nihileth can reduce the damage it takes from a single source to 0. Radiant damage can only be reduced by half."}], "legendary_desc": "A nihileth can take 3 legendary actions, choosing from the options below. Only one legendary action option can be used at a time and only at the end of another creature's turn. The nihileth regains spent legendary actions at the start of its turn.", "legendary_actions": [{"name": "Detect", "desc": "The aboleth makes a Wisdom (Perception) check."}, {"name": "Tail Swipe", "desc": "The aboleth makes one tail attack."}, {"name": "Psychic Drain (Costs 2 Actions)", "desc": "One creature charmed by the aboleth takes 10 (3d6) psychic damage, and the aboleth regains hit points equal to the damage the creature takes."}], "special_abilities": [{"name": "Undead Fortitude", "desc": "If damage reduces the nihileth to 0 hit points, it must make a Constitution saving throw with a DC of 5 + the damage taken, unless the damage is radiant or from a critical hit. On a success, the nihileth drops to 1 hit point instead."}, {"name": "Dual State", "desc": "A nihileth exists upon the Material Plane in one of two forms and can switch between them at will. In its material form, it has resistance to damage from nonmagical attacks. In its ethereal form, it is immune to damage from nonmagical attacks. The creature's ethereal form appears as a dark purple outline of its material form, with a blackish-purple haze within. A nihileth in ethereal form can move through air as though it were water, with a fly speed of 40 feet."}, {"name": "Void Aura", "desc": "The undead nihileth is surrounded by a chilling cloud. A living creature that starts its turn within 5 feet of a nihileth must make a successful DC 14 Constitution saving throw or be slowed until the start of its next turn. In addition, any creature that has been diseased by a nihileth or a nihilethic zombie takes 7 (2d6) cold damage every time it starts its turn within the aura."}, {"name": "Infecting Telepathy", "desc": "If a creature communicates telepathically with the nihileth, or uses a psychic attack against it, the nihileth can spread its disease to the creature. The creature must succeed on a DC 14 Wisdom save or become infected with the same disease caused by the nihileth's tentacle attack."}, {"name": "Nihileth's Lair", "desc": "on initiative count 20 (losing initiative ties), the nihileth can take a lair action to create one of the magical effects as per an aboleth, or the void absorbance action listed below. The nihileth cannot use the same effect two rounds in a row.\n\n- Void Absorbance: A nihileth can pull the life force from those it has converted to nihilethic zombies to replenish its own life. This takes 18 (6d6) hit points from zombies within 30 feet of the nihileth, spread evenly between the zombies, and healing the nihileth. If a zombie reaches 0 hit points from this action, it perishes with no Undead Fortitude saving throw."}, {"name": "Regional Effects", "desc": "the regional effects of a nihileth's lair are the same as that of an aboleth, except as following.\n\n- Water sources within 1 mile of a nihileth's lair are not only supernaturally fouled but can spread the disease of the nihileth. A creature who drinks from such water must make a successful DC 14 Constitution check or become infected."}], "spell_list": [], "page_no": 8, "environments": [], "img_main": null, "document__slug": "tob", "document__title": "Tome of Beasts", "document__license_url": "http://open5e.com/legal", "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-for-5th-edition-print/"}, {"slug": "abominable-beauty", "desc": "_An otherworldly humanoid of such indescribable beauty, it pains anyone’s eyes to gaze upon her._  \n**Beauty that Destroys.** An abominable beauty is so perfect that her gaze blinds, her voice is so melodious that no ears can withstand it, and her touch is so tantalizing that it burns like fire. In adolescence, this fey creature adopts features that meet the superficial ideals of the nearest humanoid population: long‐legged elegance near elves, a stout figure with lustrous hair near dwarves, unscarred or emerald skin near goblins.  \n**Jealous and Cruel.** Abominable beauties are so consumed with being the most beautiful creature in the region that they almost invariably grow jealous and paranoid about potential rivals. Because such an abominable beauty cannot abide competition, she seeks to kill anyone whose beauty is compared to her own.  \n**Male of the Species.** Male abominable beauties are rare but even more jealous in their rages.", "name": "Abominable Beauty", "size": "Medium", "type": "Fey", "subtype": "", "group": null, "alignment": "neutral evil", "armor_class": 18, "armor_desc": "natural armor", "hit_points": 187, "hit_dice": "22d8+88", "speed": {"walk": 30}, "strength": 17, "dexterity": 18, "constitution": 18, "intelligence": 17, "wisdom": 16, "charisma": 26, "strength_save": null, "dexterity_save": 8, "constitution_save": 8, "intelligence_save": null, "wisdom_save": null, "charisma_save": 12, "perception": 7, "skills": {"deception": 12, "perception": 7, "performance": 12, "persuasion": 12}, "damage_vulnerabilities": "", "damage_resistances": "", "damage_immunities": "fire", "condition_immunities": "", "senses": "passive Perception 17", "languages": "Common, Draconic, Elvish, Sylvan", "challenge_rating": "11", "cr": 11.0, "actions": [{"name": "Multiattack", "desc": "The abominable beauty makes two slam attacks."}, {"name": "Slam", "desc": "+8 to hit, reach 5 ft., one target. Hit: 7 (1d8 + 3) damage plus 28 (8d6) fire damage."}, {"name": "Blinding Gaze (Recharge 5-6)", "desc": "A creature within 30 feet of the abominable beauty who is targeted by this attack and who meets the abominable beauty's gaze must succeed on a DC 17 Charisma saving throw or be blinded. If the saving throw succeeds, the target creature is permanently immune to this abominable beauty's Blinding Gaze."}, {"name": "Deafening Voice (Recharge 5-6)", "desc": "An abominable beauty's voice is lovely, but any creature within 90 feet and able to hear her when she makes her Deafening Voice attack must succeed on a DC 16 Constitution saving throw or be permanently deafened."}], "bonus_actions": null, "reactions": null, "legendary_desc": "", "legendary_actions": null, "special_abilities": [{"name": "Burning Touch", "desc": "The abominable beauty's slam attacks do 28 (8d6) fire damage. A creature who touches her also takes 28 (8d6) fire damage."}], "spell_list": [], "page_no": 11, "environments": [], "img_main": null, "document__slug": "tob", "document__title": "Tome of Beasts", "document__license_url": "http://open5e.com/legal", "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-for-5th-edition-print/"}, {"slug": "abominablebeauty-tob1-2023", "desc": "False", "name": "Abominable Beauty", "size": "Medium", "type": "Fey", "subtype": "", "group": "null", "alignment": "Neutral Evil", "armor_class": 18, "armor_desc": "natural armor", "hit_points": 187, "hit_dice": "22d8 + 88", "speed": {"walk": 30}, "strength": 17, "dexterity": 18, "constitution": 18, "intelligence": 17, "wisdom": 16, "charisma": 26, "strength_save": null, "dexterity_save": 8, "constitution_save": 8, "intelligence_save": null, "wisdom_save": null, "charisma_save": 12, "perception": 17, "skills": {"Deception": 12, "Perception": 7, "Performance": 12, "Persuasion": 12}, "damage_vulnerabilities": "False", "damage_resistances": "False", "damage_immunities": "fire", "condition_immunities": "False", "senses": "passive Perception 17", "languages": "Common, Draconic, Elvish, Sylvan", "challenge_rating": "11", "cr": 11.0, "actions": [{"name": "Multiattack", "desc": "The abominable beauty uses Blinding Gaze. She then makes two Slam attacks."}, {"name": "Slam", "desc": "Melee Weapon Attack: +8 to hit, reach 5 ft., one target. Hit: 8 (1d8 + 4) bludgeoning damage plus 21 (6d6) fire damage."}, {"name": "Blinding Gaze", "desc": "The abominable beauty fixes her gaze on a creature within 30 feet of her. If the target can see the beauty’s eyes, the target must succeed on a DC 16 Charisma saving throw or be blinded for 1 minute. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. If a creature’s saving throw is successful, the creature is immune to the abominable beauty’s Blinding Gaze for the next 24 hours."}, {"name": "Deafening Voice (Recharge 5–6)", "desc": "The abominable beauty speaks a lilting incantation. Each creature within 30 feet of her and that can hear her voice must make a DC 16 Constitution saving throw. On a failure, a creature takes 31 (9d6) thunder damage and is deafened for 1 hour. On a success, a creature takes half the damage, isn’t deafened, and is immune to the abominable beauty’s Deafening Voice for the next 24 hours."}], "bonus_actions": [], "reactions": [], "legendary_desc": null, "legendary_actions": [], "special_abilities": [{"name": "Burning Touch", "desc": "When the abominable beauty hits with a Slam attack, the Slam deals an extra 21 (6d6) fire damage (included in the attack). In addition, a creature that touches the abominable beauty or hits her with a melee weapon attack while within 5 feet of her takes 10 (3d6) fire damage."}], "spell_list": [], "page_no": 11, "environments": [], "img_main": "http://api.open5e.com/", "document__slug": "tob-2023", "document__title": "Tome of Beasts 2023", "document__license_url": "http://open5e.com/legal", "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-1-2023-edition/"}, {"slug": "accursed-guardian-naga-a5e", "desc": "", "name": "Accursed Guardian Naga", "size": "Large", "type": "Monstrosity", "subtype": "", "group": null, "alignment": "", "armor_class": 18, "armor_desc": "", "hit_points": 136, "hit_dice": "16d10+48", "speed": {"walk": 40, "swim": 40}, "strength": 16, "dexterity": 18, "constitution": 16, "intelligence": 16, "wisdom": 18, "charisma": 18, "strength_save": null, "dexterity_save": 8, "constitution_save": 7, "intelligence_save": 7, "wisdom_save": 8, "charisma_save": 8, "perception": null, "skills": {}, "damage_vulnerabilities": "", "damage_resistances": "", "damage_immunities": "poison", "condition_immunities": "charmed, poisoned", "senses": "darkvision 60 ft., passive Perception 14", "languages": "Abyssal, Celestial, Common", "challenge_rating": "12", "cr": 12.0, "actions": [{"name": "Bite", "desc": "Melee Weapon Attack: +8 to hit, reach 5 ft., one target. Hit: 11 (2d6 + 4) piercing damage. The target makes a DC 15 Constitution saving throw  taking 35 (10d6) poison damage on a failure or half damage on a success."}, {"name": "Spit Poison", "desc": "Melee Weapon Attack: +8 to hit, range 20/60 ft., one creature. Hit: The target makes a DC 15 Constitution saving throw  taking 35 (10d6) poison damage on a failure or half damage on a success."}, {"name": "Command (1st-Level; V)", "desc": "One living creature within 60 feet that the naga can see and that can hear and understand it makes a DC 16 Wisdom saving throw. On a failure  the target uses its next turn to move as far from the naga as possible  avoiding hazardous terrain."}, {"name": "Hold Person (2nd-Level; V, Concentration)", "desc": "One humanoid the naga can see within 60 feet makes a DC 16 Wisdom saving throw. On a failure  the target is paralyzed for 1 minute. It repeats the saving throw at the end of each of its turns  ending the effect on a success."}, {"name": "Flame Strike (5th-Level; V)", "desc": "A column of divine flame fills a 10-foot-radius  40-foot-high cylinder within 60 feet. Creatures in the area make a DC 16 Dexterity saving throw  taking 14 (4d6) fire damage and 14 (4d6) radiant damage on a failure or half damage on a success."}, {"name": "Multiattack", "desc": "The naga casts a spell and uses its vampiric bite."}, {"name": "Vampiric Bite", "desc": "The naga attacks with its bite. If it hits and the target fails its saving throw against poison  the naga magically gains temporary hit points equal to the poison damage dealt."}], "bonus_actions": [{"name": "Shapeshift", "desc": "The naga changes its form to that of a specific Medium humanoid, a Medium snake-human hybrid with the lower body of a snake, or its true form, which is a Large snake. While shapeshifted, its statistics are unchanged except for its size. It reverts to its true form if it dies."}], "reactions": null, "legendary_desc": "", "legendary_actions": null, "special_abilities": [{"name": "Amphibious", "desc": "The naga can breathe air and water."}, {"name": "Forbiddance", "desc": "The nagas lair is under the forbiddance spell. Until it is dispelled, creatures in the lair can't teleport or use planar travel. Fiends and undead that are not the nagas allies take 27 (5d10) radiant damage when they enter or start their turn in the lair."}, {"name": "Magic Resistance", "desc": "The naga has advantage on saving throws against spells and magical effects."}, {"name": "Spellcasting", "desc": "The naga is an 11th level spellcaster. Its spellcasting ability is Wisdom (spell save DC 16). The naga has the following cleric spells prepared\n which it can cast with only vocalized components:\n Cantrips (at will): mending\n thaumaturgy\n 1st-level (4 slots): command\n cure wounds\n false life\n 2nd-level (3 slots): calm emotions\n hold person\n locate object\n 3rd-level (3 slots) clairvoyance\n create food and water\n 4th-level (3 slots): divination\n freedom of movement\n 5th-level (2 slots): flame strike\n geas\n scrying\n 6th-level (1 slot): forbiddance"}], "spell_list": [], "page_no": 343, "environments": [], "img_main": null, "document__slug": "menagerie", "document__title": "Level Up Advanced 5e Monstrous Menagerie", "document__license_url": "http://open5e.com/legal", "document__url": "https://www.levelup5e.com"}, {"slug": "adult-amethyst-dragon-a5e", "desc": "", "name": "Adult Amethyst Dragon", "size": "Huge", "type": "Dragon", "subtype": "", "group": null, "alignment": "", "armor_class": 18, "armor_desc": "", "hit_points": 220, "hit_dice": "21d12+84", "speed": {"walk": 40, "burrow": 30, "fly": 60}, "strength": 18, "dexterity": 20, "constitution": 18, "intelligence": 22, "wisdom": 14, "charisma": 20, "strength_save": null, "dexterity_save": null, "constitution_save": 10, "intelligence_save": 12, "wisdom_save": 8, "charisma_save": 11, "perception": null, "skills": {"deception": 11, "insight": 8, "perception": 8, "persuasion": 11}, "damage_vulnerabilities": "", "damage_resistances": "force, psychic", "damage_immunities": "", "condition_immunities": "fatigue", "senses": "darkvision 120 ft., passive Perception 18", "languages": "Common, Deep Speech, Draconic, Undercommon, telepathy 120 ft.", "challenge_rating": "17", "cr": 17.0, "actions": [{"name": "Multiattack", "desc": "The dragon attacks once with its bite and twice with its claws. In place of its bite  it can use Psionic Wave."}, {"name": "Bite", "desc": "Melee Weapon Attack: +10 to hit, reach 10 ft., one target. Hit: 20 (3d10 + 4) piercing damage plus 4 (1d8) force damage."}, {"name": "Claws", "desc": "Melee Weapon Attack: +10 to hit, reach 5 ft., one target. Hit: 17 (3d8 + 4) slashing damage."}, {"name": "Psionic Wave", "desc": "The dragon psionically emits a wave of crushing mental pressure. Each creature within 20 feet makes a DC 19 Wisdom saving throw  taking 16 (3d10) psychic damage on a failed save or half damage on a success. Creatures charmed by the dragon make this saving throw with disadvantage."}, {"name": "Concussive Breath (Recharge 5-6)", "desc": "The dragon psionically unleashes telekinetic energy in a 60-foot cone. Each creature in that area makes a DC 18 Constitution saving throw  taking 60 (11d10) force damage on a failed save or half damage on a success."}], "bonus_actions": null, "reactions": [{"name": "Assume Control (While Bloodied)", "desc": "When a creature charmed by the dragon begins its turn, the dragon telepathically commands the charmed creature until the end of the creatures turn. If the dragon commands the creature to take an action that would harm itself or an ally, the creature makes a DC 19 Wisdom saving throw. On a success, the creatures turn immediately ends."}], "legendary_desc": "", "legendary_actions": [{"name": "The dragon can take 3 legendary actions", "desc": "Only one legendary action can be used at a time and only at the end of another creatures turn. It regains spent legendary actions at the start of its turn."}, {"name": "Charm", "desc": "The dragon targets a creature within 60 feet, forcing it to make a DC 16 Wisdom saving throw. On a failure, the creature is charmed by the dragon for 24 hours, regarding it as a trusted friend to be heeded and protected. Although it isnt under the dragons control, it takes the dragons requests or actions in the most favorable way it can. At the end of each of the targets turns and at the end of any turn during which the dragon or its companions harmed the target, it repeats the saving throw, ending the effect on a success."}, {"name": "Stupefy", "desc": "The dragon targets a creature within 60 feet. If the target is concentrating on a spell, it must make a DC 19 Constitution saving throw or lose concentration."}, {"name": "Psionic Wave (Costs 2 Actions)", "desc": "The dragon uses Psionic Wave."}, {"name": "Captivating Harmonics (1/Day)", "desc": "Each creature of the dragons choice within 90 feet makes a DC 16 Wisdom saving throw. On a failure, it becomes psionically charmed by the dragon for 1 minute. A creature repeats the saving throw at the end of each of its turns, ending the effect on itself on a success."}], "special_abilities": [{"name": "Legendary Resistance (3/Day)", "desc": "When the dragon fails a saving throw, it can choose to succeed instead. When it does, its scales dull briefly, and it can't use telepathy or psionic abilities until the end of its next turn."}, {"name": "Psionic Powers", "desc": "The dragons psionic abilities are considered both magical and psionic."}, {"name": "Far Thoughts", "desc": "The dragon is aware of any creature that uses a psionic ability or communicates telepathically within 100 miles of it. As an action, the dragon can psionically observe a creature, object, or location it is familiar with within 100 miles. While observing a subject in this way, the dragon can see, hear, and communicate telepathically, but it is blind and deaf in regard to its physical senses and does not require food or water. The dragon can psionically observe a subject indefinitely and can end this effect and return to its own senses as an action."}, {"name": "Innate Spellcasting", "desc": "The dragons spellcasting ability is Charisma (save DC 19). It can innately cast the following spells, requiring no material components. 3/day each:calm emotions, charm person, mass suggestion, modify memory"}], "spell_list": [], "page_no": 141, "environments": [], "img_main": null, "document__slug": "menagerie", "document__title": "Level Up Advanced 5e Monstrous Menagerie", "document__license_url": "http://open5e.com/legal", "document__url": "https://www.levelup5e.com"}, {"slug": "adult-black-dragon", "desc": "", "name": "Adult Black Dragon", "size": "Huge", "type": "Dragon", "subtype": "", "group": "Black Dragon", "alignment": "chaotic evil", "armor_class": 19, "armor_desc": "natural armor", "hit_points": 195, "hit_dice": "17d12+85", "speed": {"walk": 40, "fly": 80, "swim": 40}, "strength": 23, "dexterity": 14, "constitution": 21, "intelligence": 14, "wisdom": 13, "charisma": 17, "strength_save": null, "dexterity_save": 7, "constitution_save": 10, "intelligence_save": null, "wisdom_save": 6, "charisma_save": 8, "perception": 11, "skills": {"perception": 11, "stealth": 7}, "damage_vulnerabilities": "", "damage_resistances": "", "damage_immunities": "acid", "condition_immunities": "", "senses": "blindsight 60 ft., darkvision 120 ft., passive Perception 21", "languages": "Common, Draconic", "challenge_rating": "14", "cr": 14.0, "actions": [{"name": "Multiattack", "desc": "The dragon can use its Frightful Presence. It then makes three attacks: one with its bite and two with its claws."}, {"name": "Bite", "desc": "Melee Weapon Attack: +11 to hit, reach 10 ft., one target. Hit: 17 (2d10 + 6) piercing damage plus 4 (1d8) acid damage.", "attack_bonus": 11, "damage_dice": "2d10+1d8", "damage_bonus": 6}, {"name": "Claw", "desc": "Melee Weapon Attack: +11 to hit, reach 5 ft., one target. Hit: 13 (2d6 + 6) slashing damage.", "attack_bonus": 11, "damage_dice": "2d6", "damage_bonus": 6}, {"name": "Tail", "desc": "Melee Weapon Attack: +11 to hit, reach 15 ft., one target. Hit: 15 (2d8 + 6) bludgeoning damage.", "attack_bonus": 11, "damage_dice": "2d8", "damage_bonus": 6}, {"name": "Frightful Presence", "desc": "Each creature of the dragon's choice that is within 120 feet of the dragon and aware of it must succeed on a DC 16 Wisdom saving throw or become frightened for 1 minute. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. If a creature's saving throw is successful or the effect ends for it, the creature is immune to the dragon's Frightful Presence for the next 24 hours."}, {"name": "Acid Breath (Recharge 5-6)", "desc": "The dragon exhales acid in a 60-foot line that is 5 feet wide. Each creature in that line must make a DC 18 Dexterity saving throw, taking 54 (12d8) acid damage on a failed save, or half as much damage on a successful one.", "attack_bonus": 0, "damage_dice": "12d8"}], "bonus_actions": null, "reactions": null, "legendary_desc": "The dragon can take 3 legendary actions, choosing from the options below. Only one legendary action option can be used at a time and only at the end of another creature's turn. The dragon regains spent legendary actions at the start of its turn.", "legendary_actions": [{"name": "Detect", "desc": "The dragon makes a Wisdom (Perception) check."}, {"name": "Tail Attack", "desc": "The dragon makes a tail attack."}, {"name": "Wing Attack (Costs 2 Actions)", "desc": "The dragon beats its wings. Each creature within 10 ft. of the dragon must succeed on a DC 19 Dexterity saving throw or take 13 (2d6 + 6) bludgeoning damage and be knocked prone. The dragon can then fly up to half its flying speed."}], "special_abilities": [{"name": "Amphibious", "desc": "The dragon can breathe air and water."}, {"name": "Legendary Resistance (3/Day)", "desc": "If the dragon fails a saving throw, it can choose to succeed instead."}], "spell_list": [], "page_no": 281, "environments": ["Swamp"], "img_main": null, "document__slug": "wotc-srd", "document__title": "5e Core Rules", "document__license_url": "http://open5e.com/legal", "document__url": "http://dnd.wizards.com/articles/features/systems-reference-document-srd"}, {"slug": "adult-black-dragon-a5e", "desc": "", "name": "Adult Black Dragon", "size": "Huge", "type": "Dragon", "subtype": "", "group": null, "alignment": "", "armor_class": 19, "armor_desc": "", "hit_points": 253, "hit_dice": "22d12+110", "speed": {"walk": 40, "fly": 80, "swim": 40}, "strength": 22, "dexterity": 14, "constitution": 20, "intelligence": 14, "wisdom": 12, "charisma": 16, "strength_save": null, "dexterity_save": 8, "constitution_save": 11, "intelligence_save": null, "wisdom_save": 7, "charisma_save": 9, "perception": null, "skills": {"history": 8, "perception": 7, "stealth": 8}, "damage_vulnerabilities": "", "damage_resistances": "", "damage_immunities": "acid", "condition_immunities": "", "senses": "blindsight 60 ft., darkvision 120 ft., passive Perception 20", "languages": "Common, Draconic", "challenge_rating": "17", "cr": 17.0, "actions": [{"name": "Multiattack", "desc": "The dragon attacks once with its bite and twice with its claws. In place of its bite attack  it can use Acid Spit."}, {"name": "Bite", "desc": "Melee Weapon Attack: +12 to hit, reach 10 ft., one target. Hit: 22 (3d10 + 6) piercing damage plus 4 (1d8) acid damage. Instead of dealing piercing damage  the dragon can grapple the target (escape DC 20)  and a Large or smaller creature grappled in this way is restrained. While grappling a creature  the dragon can't bite or use Acid Spit against another target."}, {"name": "Claw", "desc": "Melee Weapon Attack: +12 to hit, reach 5 ft., one target. Hit: 19 (3d8 + 6) slashing damage."}, {"name": "Tail", "desc": "Melee Weapon Attack: +12 to hit, reach 15 ft., one target. Hit: 15 (2d8 + 6) bludgeoning damage  and the dragon pushes the target 10 feet away."}, {"name": "Acid Spit", "desc": "The dragon targets a creature within 60 feet  forcing it to make a DC 19 Dexterity saving throw. The creature takes 22 (4d10) acid damage on a failure or half damage on a success. A creature that fails the save also takes 5 (1d10) ongoing acid damage. A creature can use an action to end the ongoing damage."}, {"name": "Acid Breath (Recharge 5-6)", "desc": "The dragon exhales sizzling acid in a 60-foot-long  5-foot-wide line. Each creature in that area makes a DC 19 Dexterity saving throw  taking 63 (14d8) acid damage on a failed save or half damage on a success. A creature that fails the save is blinded until the end of its next turn."}], "bonus_actions": null, "reactions": [{"name": "Tail Attack", "desc": "When a creature the dragon can see within 10 feet hits the dragon with a melee attack, the dragon makes a tail attack against it."}], "legendary_desc": "", "legendary_actions": [{"name": "The dragon can take 3 legendary actions", "desc": "Only one legendary action can be used at a time and only at the end of another creatures turn. It regains spent legendary actions at the start of its turn."}, {"name": "Darkness", "desc": "The dragon creates a 20-foot-radius sphere of magical darkness originating from a point it can see within 120 feet. Darkvision can't penetrate this darkness. The darkness lasts for 1 minute or until the dragon uses this action again."}, {"name": "Roar", "desc": "Each creature of the dragons choice within 120 feet that can hear it makes a DC 17 Charisma saving throw. On a failure, it is frightened for 1 minute. A creature repeats the saving throw at the end of its turns, ending the effect on itself on a success. When it succeeds on a saving throw or the effect ends for it, it is immune to Roar for 24 hours."}, {"name": "Wing Attack", "desc": "The dragon beats its wings. Each creature within 15 feet makes a DC 20 Dexterity saving throw. On a failure, it is pushed 10 feet away and knocked prone. The dragon can then fly up to half its fly speed."}], "special_abilities": [{"name": "Ambusher", "desc": "When submerged in water, the dragon has advantage on Stealth checks. If the dragon hits a creature that can't see it with its bite, it can deal piercing damage and grapple the target simultaneously."}, {"name": "Amphibious", "desc": "The dragon can breathe air and water."}, {"name": "Legendary Resistance (3/Day)", "desc": "When the dragon fails a saving throw, it can choose to succeed instead. When it does, it sheds some of its scales, which turn to mud. If it has no more uses of this ability, its Armor Class is reduced to 17 until it finishes a long rest."}, {"name": "Ruthless (1/Round)", "desc": "After scoring a critical hit on its turn, the dragon can immediately make one claw attack."}, {"name": "Innate Spellcasting", "desc": "The dragons spellcasting ability is Charisma (save DC 17). It can innately cast the following spells, requiring no material components. 3/day each:fog cloud, pass without trace, legend lore, speak with dead"}], "spell_list": [], "page_no": 102, "environments": [], "img_main": null, "document__slug": "menagerie", "document__title": "Level Up Advanced 5e Monstrous Menagerie", "document__license_url": "http://open5e.com/legal", "document__url": "https://www.levelup5e.com"}, {"slug": "adult-black-dragon-lich-a5e", "desc": "", "name": "Adult Black Dragon Lich", "size": "Huge", "type": "Undead", "subtype": "", "group": null, "alignment": "", "armor_class": 19, "armor_desc": "", "hit_points": 253, "hit_dice": "22d12+110", "speed": {"walk": 40, "fly": 80, "swim": 40}, "strength": 22, "dexterity": 14, "constitution": 20, "intelligence": 14, "wisdom": 12, "charisma": 16, "strength_save": null, "dexterity_save": 8, "constitution_save": 11, "intelligence_save": null, "wisdom_save": 7, "charisma_save": 9, "perception": null, "skills": {"history": 8, "perception": 7, "stealth": 8}, "damage_vulnerabilities": "", "damage_resistances": "", "damage_immunities": "acid, necrotic, poison", "condition_immunities": "charmed, fatigued, frightened, paralyzed, poisoned", "senses": "blindsight 60 ft., darkvision 120 ft., passive Perception 20", "languages": "Common, Draconic", "challenge_rating": "17", "cr": 17.0, "actions": [{"name": "Multiattack", "desc": "The dragon attacks once with its bite and twice with its claws. In place of its bite attack  it can use Acid Spit."}, {"name": "Bite", "desc": "Melee Weapon Attack: +12 to hit, reach 10 ft., one target. Hit: 22 (3d10 + 6) piercing damage plus 4 (1d8) acid damage. Instead of dealing piercing damage  the dragon can grapple the target (escape DC 20)  and a Large or smaller creature grappled in this way is restrained. While grappling a creature  the dragon can't bite or use Acid Spit against another target."}, {"name": "Claw", "desc": "Melee Weapon Attack: +12 to hit, reach 5 ft., one target. Hit: 19 (3d8 + 6) slashing damage."}, {"name": "Tail", "desc": "Melee Weapon Attack: +12 to hit, reach 15 ft., one target. Hit: 15 (2d8 + 6) bludgeoning damage  and the dragon pushes the target 10 feet away."}, {"name": "Acid Spit", "desc": "The dragon targets a creature within 60 feet  forcing it to make a DC 19 Dexterity saving throw. The creature takes 22 (4d10) acid damage on a failure or half damage on a success. A creature that fails the save also takes 5 (1d10) ongoing acid damage. A creature can use an action to end the ongoing damage."}, {"name": "Acid Breath (Recharge 5-6)", "desc": "The dragon exhales sizzling acid or necrotic energy in a 60-foot-long  5-foot-wide line. Each creature in that area makes a DC 19 Dexterity saving throw  taking 31 (7d8) acid damage and 31 (7d8) necrotic damage on a failed save or half damage on a success. A creature that fails the save is blinded until the end of its next turn."}], "bonus_actions": null, "reactions": [{"name": "Tail Attack", "desc": "When a creature the dragon can see within 10 feet hits the dragon with a melee attack, the dragon makes a tail attack against it."}], "legendary_desc": "", "legendary_actions": [{"name": "The dragon can take 3 legendary actions", "desc": "Only one legendary action can be used at a time and only at the end of another creatures turn. It regains spent legendary actions at the start of its turn."}, {"name": "Darkness", "desc": "The dragon creates a 20-foot-radius sphere of magical darkness originating from a point it can see within 120 feet. Darkvision can't penetrate this darkness. The darkness lasts for 1 minute or until the dragon uses this action again."}, {"name": "Roar", "desc": "Each creature of the dragons choice within 120 feet that can hear it makes a DC 17 Charisma saving throw. On a failure, it is frightened for 1 minute. A creature repeats the saving throw at the end of its turns, ending the effect on itself on a success. When it succeeds on a saving throw or the effect ends for it, it is immune to Roar for 24 hours."}, {"name": "Wing Attack", "desc": "The dragon beats its wings. Each creature within 15 feet makes a DC 20 Dexterity saving throw. On a failure, it is pushed 10 feet away and knocked prone. The dragon can then fly up to half its fly speed."}], "special_abilities": [{"name": "Ambusher", "desc": "When submerged in water, the dragon has advantage on Stealth checks. If the dragon hits a creature that can't see it with its bite, it can deal piercing damage and grapple the target simultaneously."}, {"name": "Innate Spellcasting", "desc": "The dragons spellcasting ability is Charisma (save DC 17). It can innately cast the following spells, requiring no material components. 3/day each: animate dead, fog cloud, legend lore, pass without trace, speak with dead"}], "spell_list": [], "page_no": 96, "environments": [], "img_main": null, "document__slug": "menagerie", "document__title": "Level Up Advanced 5e Monstrous Menagerie", "document__license_url": "http://open5e.com/legal", "document__url": "https://www.levelup5e.com"}, {"slug": "adult-blue-dragon", "desc": "", "name": "Adult Blue Dragon", "size": "Huge", "type": "Dragon", "subtype": "", "group": "Blue Dragon", "alignment": "lawful evil", "armor_class": 19, "armor_desc": "natural armor", "hit_points": 225, "hit_dice": "18d12+108", "speed": {"walk": 40, "burrow": 30, "fly": 80}, "strength": 25, "dexterity": 10, "constitution": 23, "intelligence": 16, "wisdom": 15, "charisma": 19, "strength_save": null, "dexterity_save": 5, "constitution_save": 11, "intelligence_save": null, "wisdom_save": 7, "charisma_save": 9, "perception": 12, "skills": {"perception": 12, "stealth": 5}, "damage_vulnerabilities": "", "damage_resistances": "", "damage_immunities": "lightning", "condition_immunities": "", "senses": "blindsight 60 ft., darkvision 120 ft., passive Perception 22", "languages": "Common, Draconic", "challenge_rating": "16", "cr": 16.0, "actions": [{"name": "Multiattack", "desc": "The dragon can use its Frightful Presence. It then makes three attacks: one with its bite and two with its claws."}, {"name": "Bite", "desc": "Melee Weapon Attack: +12 to hit, reach 10 ft., one target. Hit: 18 (2d10 + 7) piercing damage plus 5 (1d10) lightning damage.", "attack_bonus": 12, "damage_dice": "2d10+1d10", "damage_bonus": 7}, {"name": "Claw", "desc": "Melee Weapon Attack: +12 to hit, reach 5 ft., one target. Hit: 14 (2d6 + 7) slashing damage.", "attack_bonus": 12, "damage_dice": "2d6", "damage_bonus": 7}, {"name": "Tail", "desc": "Melee Weapon Attack: +12 to hit, reach 15 ft., one target. Hit: 16 (2d8 + 7) bludgeoning damage.", "attack_bonus": 12, "damage_dice": "2d8", "damage_bonus": 7}, {"name": "Frightful Presence", "desc": "Each creature of the dragon's choice that is within 120 ft. of the dragon and aware of it must succeed on a DC 17 Wisdom saving throw or become frightened for 1 minute. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. If a creature's saving throw is successful or the effect ends for it, the creature is immune to the dragon's Frightful Presence for the next 24 hours."}, {"name": "Lightning Breath (Recharge 5-6)", "desc": "The dragon exhales lightning in a 90-foot line that is 5 ft. wide. Each creature in that line must make a DC 19 Dexterity saving throw, taking 66 (12d10) lightning damage on a failed save, or half as much damage on a successful one.", "attack_bonus": 0, "damage_dice": "12d10"}], "bonus_actions": null, "reactions": null, "legendary_desc": "The dragon can take 3 legendary actions, choosing from the options below. Only one legendary action option can be used at a time and only at the end of another creature's turn. The dragon regains spent legendary actions at the start of its turn.", "legendary_actions": [{"name": "Detect", "desc": "The dragon makes a Wisdom (Perception) check."}, {"name": "Tail Attack", "desc": "The dragon makes a tail attack."}, {"name": "Wing Attack (Costs 2 Actions)", "desc": "The dragon beats its wings. Each creature within 10 ft. of the dragon must succeed on a DC 20 Dexterity saving throw or take 14 (2d6 + 7) bludgeoning damage and be knocked prone. The dragon can then fly up to half its flying speed."}], "special_abilities": [{"name": "Legendary Resistance (3/Day)", "desc": "If the dragon fails a saving throw, it can choose to succeed instead."}], "spell_list": [], "page_no": 283, "environments": ["Desert", "Coastal"], "img_main": null, "document__slug": "wotc-srd", "document__title": "5e Core Rules", "document__license_url": "http://open5e.com/legal", "document__url": "http://dnd.wizards.com/articles/features/systems-reference-document-srd"}, {"slug": "adult-blue-dragon-a5e", "desc": "", "name": "Adult Blue Dragon", "size": "Huge", "type": "Dragon", "subtype": "", "group": null, "alignment": "", "armor_class": 19, "armor_desc": "", "hit_points": 275, "hit_dice": "22d12+132", "speed": {"walk": 40, "burrow": 30, "fly": 80, "swim": 30}, "strength": 24, "dexterity": 10, "constitution": 22, "intelligence": 16, "wisdom": 14, "charisma": 18, "strength_save": null, "dexterity_save": 6, "constitution_save": 12, "intelligence_save": null, "wisdom_save": 8, "charisma_save": 10, "perception": null, "skills": {"perception": 8, "stealth": 6, "survival": 8}, "damage_vulnerabilities": "", "damage_resistances": "", "damage_immunities": "lightning", "condition_immunities": "", "senses": "blindsight 60 ft., tremorsense 60 ft., darkvision 120 ft., passive Perception 21", "languages": "Common, Draconic, one more", "challenge_rating": "19", "cr": 19.0, "actions": [{"name": "Multiattack", "desc": "The dragon attacks once with its bite and twice with its claws. In place of its bite attack  it can use Arc Lightning."}, {"name": "Bite", "desc": "Melee Weapon Attack: +13 to hit, reach 10 ft., one target. Hit: 23 (3d10 + 7) piercing damage plus 4 (1d8) lightning damage."}, {"name": "Claw", "desc": "Melee Weapon Attack: +13 to hit, reach 5 ft., one target. Hit: 20 (3d8 + 7) slashing damage."}, {"name": "Tail", "desc": "Melee Weapon Attack: +13 to hit, reach 15 ft., one target. Hit: 16 (2d8 + 7) bludgeoning damage  and the dragon pushes the target 10 feet away."}, {"name": "Arc Lightning", "desc": "The dragon targets a creature within 60 feet  forcing it to make a DC 20 Dexterity saving throw. The creature takes 16 (3d10) lightning damage on a failure or half damage on a success. Also on a failure  the lightning jumps. Choose a creature within 30 feet of the target that hasnt been hit by this ability on this turn  and repeat the effect against it  possibly causing the lightning to jump again."}, {"name": "Lightning Breath (Recharge 5-6)", "desc": "The dragon exhales a 90-foot-long  5-foot wide-line of lightning. Each creature in that area makes a DC 20 Dexterity saving throw  taking 77 (14d10) lightning damage on a failed save or half damage on a success. A creature that fails the save can't take reactions until the end of its next turn."}, {"name": "Quake", "desc": "While touching natural ground  the dragon sends pulses of thunder rippling through it. Creatures within 30 feet make a DC 20 Strength saving throw  taking 11 (2d10) bludgeoning damage and falling prone on a failure. If a Large or smaller creature that fails the save is standing on sand  it also sinks partially  becoming restrained as well. A creature restrained in this way can spend half its movement to escape."}], "bonus_actions": null, "reactions": [{"name": "Tail Attack", "desc": "When a creature the dragon can see within 10 feet hits the dragon with a melee attack, the dragon makes a tail attack against it."}], "legendary_desc": "", "legendary_actions": [{"name": "The dragon can take 3 legendary actions", "desc": "Only one legendary action can be used at a time and only at the end of another creatures turn. It regains spent legendary actions at the start of its turn."}, {"name": "Roar", "desc": "Each creature of the dragons choice within 120 feet that can hear it makes a DC 18 Charisma saving throw. On a failure, it is frightened for 1 minute. A creature repeats the saving throw at the end of its turns, ending the effect on itself on a success. When it succeeds on a saving throw or the effect ends for it, it is immune to Roar for 24 hours."}, {"name": "Wing Attack", "desc": "The dragon beats its wings. Each creature within 15 feet makes a DC 20 Dexterity saving throw. On a failure, it is pushed 10 feet away and knocked prone. The dragon can then fly up to half its fly speed."}, {"name": "Quake (Costs 2 Actions)", "desc": "The dragon uses its Quake action."}], "special_abilities": [{"name": "Desert Farer", "desc": "The dragon ignores difficult terrain or obscurement caused by sand or gravel, even while flying. Additionally, it ignores the effects of extreme heat."}, {"name": "Dune Splitter", "desc": "The dragon can remain submerged in sand and gravel for up to 4 hours. It has advantage on Stealth checks made to hide in this way."}, {"name": "Legendary Resistance (3/Day)", "desc": "When the dragon fails a saving throw, it can choose to succeed instead. When it does, it sheds some of its scales, which turn to sand. If it has no more uses of this ability, its Armor Class is reduced to 17 until it finishes a long rest."}, {"name": "Innate Spellcasting", "desc": "The dragons spellcasting ability is Charisma (save DC 18). It can innately cast the following spells, requiring no material components. 3/day each:blur, silent image, blight, hypnotic pattern"}], "spell_list": [], "page_no": 107, "environments": [], "img_main": null, "document__slug": "menagerie", "document__title": "Level Up Advanced 5e Monstrous Menagerie", "document__license_url": "http://open5e.com/legal", "document__url": "https://www.levelup5e.com"}, {"slug": "adult-boreal-dragon", "desc": "Covered in a mix of hard, blue-white scales and patches of silvery-blue fur, this dragon radiates a savage belligerence. Its amber eyes gleam with primal fury as it stretches its wings, sending a shower of burning sparks sizzling onto the ground._  \n**Paradoxical Predators.** Boreal dragons inhabit the arctic and alpine places of the world, from snow-capped conifer forests and frigid mountain peaks to flat, icy plains and polar seas. Unlike white or silver dragons, however, boreal dragons are not creatures of cold but rather of heat and flames. Their breath is filled with burning embers, and their preferred lairs contain some sort of natural heat source. While this contradiction has puzzled many scholars of draconic lore, boreal dragons are unconcerned about such trivial matters and are likely to devour any sage or wizard impertinent enough to question their choice of habitat.  \n**Dragons of Rage.** Boreal dragons are among the most straightforward of all true dragons, driven by simple necessities like hunting and mating. They hate most other dragons with a passion and war constantly with those that share their arctic homeland, driving off or killing any dragons they encounter. Boreal dragons are truculent creatures and love nothing better than getting into a fight; however, they do not target defenseless creatures or those far weaker than themselves unless they are hunting for food. Because they respect strength above all else, a creature can gain a boreal dragon’s admiration through acts of intense bravery or slaughter. In particular, the dragons are fond of large arctic predators, such as Open Game License", "name": "Adult Boreal Dragon", "size": "Huge", "type": "Dragon", "subtype": "", "group": null, "alignment": "chaotic neutral", "armor_class": 19, "armor_desc": "natural armor", "hit_points": 212, "hit_dice": "17d12+102", "speed": {"fly": 80, "walk": 40, "swim": 30}, "strength": 25, "dexterity": 10, "constitution": 23, "intelligence": 15, "wisdom": 17, "charisma": 16, "strength_save": null, "dexterity_save": 6, "constitution_save": 12, "intelligence_save": null, "wisdom_save": 9, "charisma_save": 9, "perception": 15, "skills": {"athletics": 13, "perception": 15, "stealth": 6}, "damage_vulnerabilities": "", "damage_resistances": "cold", "damage_immunities": "fire", "condition_immunities": "", "senses": "blindsight 60 ft., darkvision 120 ft., passive Perception 23", "languages": "Draconic, Giant", "challenge_rating": "17", "cr": 17.0, "actions": [{"name": "Multiattack", "desc": "The dragon can use its Frightful Presence. It then makes three attacks: one with its bite and two with its claws."}, {"name": "Bite", "desc": "Melee Weapon Attack: +13 to hit, reach 10 ft., one target. Hit: 19 (2d10 + 8) piercing damage.", "attack_bonus": 13, "damage_dice": "2d10+8"}, {"name": "Claw", "desc": "Melee Weapon Attack: +13 to hit, reach 5 ft., one target. Hit: 15 (2d6 + 8) slashing damage.", "attack_bonus": 13, "damage_dice": "2d6+8"}, {"name": "Tail", "desc": "Melee Weapon Attack: +13 to hit, reach 15 ft., one target. Hit: 17 (2d8 + 8) bludgeoning damage.", "attack_bonus": 13, "damage_dice": "2d8+8"}, {"name": "Frightful Presence", "desc": "Each creature of the dragon’s choice that is within 120 feet of the dragon and aware of it must succeed on a DC 17 Wisdom saving throw or become frightened for 1 minute. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. If a creature’s saving throw is successful or the effect ends for it, the creature is immune to the dragon’s Frightful Presence for the next 24 hours."}, {"name": "Cinder Breath (Recharge 5-6)", "desc": "The dragon exhales a 60-foot cone of superheated air filled with white-hot embers. Each creature in that area must make a DC 20 Dexterity saving throw, taking 44 (8d10) fire damage on a failed save, or half as much damage on a successful one."}], "bonus_actions": null, "reactions": null, "legendary_desc": "The dragon can take 3 legendary actions, choosing from the options below. Only one legendary action can be used at a time and only at the end of another creature’s turn. The dragon regains spent legendary actions at the start of its turn.", "legendary_actions": [{"name": "Detect", "desc": "The dragon makes a Wisdom (Perception) check."}, {"name": "Tail Attack", "desc": "The dragon makes a tail attack."}, {"name": "Wing Attack (Costs 2 Actions)", "desc": "The dragon beats its wings. Each creature within 10 feet of the dragon must succeed on a DC 20 Dexterity saving throw or take 14 (2d6 + 7) bludgeoning damage and be knocked prone. The dragon can then fly up to half its flying speed."}], "special_abilities": [{"name": "Legendary Resistance (3/Day)", "desc": "If the dragon fails a saving throw, it can choose to succeed instead."}], "spell_list": [], "page_no": 143, "environments": [], "img_main": null, "document__slug": "tob2", "document__title": "Tome of Beasts 2", "document__license_url": "http://open5e.com/legal", "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/"}, {"slug": "adult-brass-dragon", "desc": "", "name": "Adult Brass Dragon", "size": "Huge", "type": "Dragon", "subtype": "", "group": "Brass Dragon", "alignment": "chaotic good", "armor_class": 18, "armor_desc": "natural armor", "hit_points": 172, "hit_dice": "15d12+75", "speed": {"walk": 40, "burrow": 40, "fly": 80}, "strength": 23, "dexterity": 10, "constitution": 21, "intelligence": 14, "wisdom": 13, "charisma": 17, "strength_save": null, "dexterity_save": 5, "constitution_save": 10, "intelligence_save": null, "wisdom_save": 6, "charisma_save": 8, "perception": 11, "skills": {"history": 7, "perception": 11, "persuasion": 8, "stealth": 5}, "damage_vulnerabilities": "", "damage_resistances": "", "damage_immunities": "fire", "condition_immunities": "", "senses": "blindsight 60 ft., darkvision 120 ft., passive Perception 21", "languages": "Common, Draconic", "challenge_rating": "13", "cr": 13.0, "actions": [{"name": "Multiattack", "desc": "The dragon can use its Frightful Presence. It then makes three attacks: one with its bite and two with its claws."}, {"name": "Bite", "desc": "Melee Weapon Attack: +11 to hit, reach 10 ft., one target. Hit: 17 (2d10 + 6) piercing damage.", "attack_bonus": 11, "damage_dice": "2d10", "damage_bonus": 6}, {"name": "Claw", "desc": "Melee Weapon Attack: +11 to hit, reach 5 ft., one target. Hit: 13 (2d6 + 6) slashing damage.", "attack_bonus": 11, "damage_dice": "2d6", "damage_bonus": 6}, {"name": "Tail", "desc": "Melee Weapon Attack: +11 to hit, reach 15 ft., one target. Hit: 15 (2d8 + 6) bludgeoning damage.", "attack_bonus": 11, "damage_dice": "2d8", "damage_bonus": 6}, {"name": "Frightful Presence", "desc": "Each creature of the dragon's choice that is within 120 feet of the dragon and aware of it must succeed on a DC 16 Wisdom saving throw or become frightened for 1 minute. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. If a creature's saving throw is successful or the effect ends for it, the creature is immune to the dragon's Frightful Presence for the next 24 hours."}, {"name": "Breath Weapons (Recharge 5-6)", "desc": "The dragon uses one of the following breath weapons.\n**Fire Breath.** The dragon exhales fire in an 60-foot line that is 5 feet wide. Each creature in that line must make a DC 18 Dexterity saving throw, taking 45 (13d6) fire damage on a failed save, or half as much damage on a successful one.\n**Sleep Breath.** The dragon exhales sleep gas in a 60-foot cone. Each creature in that area must succeed on a DC 18 Constitution saving throw or fall unconscious for 10 minutes. This effect ends for a creature if the creature takes damage or someone uses an action to wake it.", "attack_bonus": 0, "damage_dice": "13d6"}], "bonus_actions": null, "reactions": null, "legendary_desc": "The dragon can take 3 legendary actions, choosing from the options below. Only one legendary action option can be used at a time and only at the end of another creature's turn. The dragon regains spent legendary actions at the start of its turn.", "legendary_actions": [{"name": "Detect", "desc": "The dragon makes a Wisdom (Perception) check."}, {"name": "Tail Attack", "desc": "The dragon makes a tail attack."}, {"name": "Wing Attack (Costs 2 Actions)", "desc": "The dragon beats its wings. Each creature within 10 ft. of the dragon must succeed on a DC 19 Dexterity saving throw or take 13 (2d6 + 6) bludgeoning damage and be knocked prone. The dragon can then fly up to half its flying speed."}], "special_abilities": [{"name": "Legendary Resistance (3/Day)", "desc": "If the dragon fails a saving throw, it can choose to succeed instead."}], "spell_list": [], "page_no": 291, "environments": ["Desert"], "img_main": null, "document__slug": "wotc-srd", "document__title": "5e Core Rules", "document__license_url": "http://open5e.com/legal", "document__url": "http://dnd.wizards.com/articles/features/systems-reference-document-srd"}, {"slug": "adult-brass-dragon-a5e", "desc": "", "name": "Adult Brass Dragon", "size": "Huge", "type": "Dragon", "subtype": "", "group": null, "alignment": "", "armor_class": 18, "armor_desc": "", "hit_points": 161, "hit_dice": "14d12+70", "speed": {"walk": 40, "burrow": 30, "fly": 80}, "strength": 22, "dexterity": 10, "constitution": 20, "intelligence": 18, "wisdom": 14, "charisma": 16, "strength_save": null, "dexterity_save": 5, "constitution_save": 10, "intelligence_save": null, "wisdom_save": 7, "charisma_save": 8, "perception": null, "skills": {"arcana": 9, "history": 9, "nature": 9, "perception": 7, "persuasion": 8, "religion": 9, "stealth": 5}, "damage_vulnerabilities": "", "damage_resistances": "", "damage_immunities": "fire", "condition_immunities": "", "senses": "blindsight 60 ft., darkvision 120 ft., passive Perception 20", "languages": "Common, Draconic, two more", "challenge_rating": "16", "cr": 16.0, "actions": [{"name": "Multiattack", "desc": "The dragon attacks with its bite and twice with its claws. In place of its bite  it can use Molten Spit."}, {"name": "Bite", "desc": "Melee Weapon Attack: +11 to hit, reach 10 ft., one target. Hit: 22 (3d10 + 6) piercing damage plus 4 (1d8) fire damage."}, {"name": "Claws", "desc": "Melee Weapon Attack: +11 to hit, reach 5 ft., one target. Hit: 19 (3d8 + 6) slashing damage."}, {"name": "Tail", "desc": "Melee Weapon Attack: +11 to hit, reach 15 ft., one target. Hit: 15 (2d8 + 6) bludgeoning damage  and the dragon pushes the target 10 feet away."}, {"name": "Staff (Humanoid Form Only)", "desc": "Melee Weapon Attack: +11 to hit, reach 5 ft., one target. Hit: 10 (1d8 + 6) bludgeoning damage."}, {"name": "Molten Spit", "desc": "The dragon targets a creature within 60 feet  forcing it to make a DC 18 Dexterity saving throw. The creature takes 11 (2d10) fire damage on a failure or half damage on a success. A creature that fails the saving throw also takes 5 (1d10) ongoing fire damage. A creature can use an action to end the ongoing damage."}, {"name": "Breath Weapons (Recharge 5-6)", "desc": "The dragon uses one of the following breath weapons:"}, {"name": "Molten Breath", "desc": "The dragon exhales molten glass in a 60-foot-long  5-foot-wide line. Each creature in the area makes a DC 18 Dexterity saving throw  taking 56 (16d6) fire damage on a failed save or half damage on a success. A creature that fails the save is also blinded until the end of its next turn."}, {"name": "Sleep Breath", "desc": "The dragon exhales sleep gas in a 60-foot cone. Each creature in the area makes a DC 18 Constitution saving throw. On a failure  a creature falls unconscious for 10 minutes or until it takes damage or someone uses an action to wake it."}, {"name": "Change Shape", "desc": "The dragon magically takes the shape of a humanoid or beast or changes back into its true form. It reverts to its true form if it dies. Any equipment it is wearing or carrying is absorbed or borne by the new form (dragons choice). In the new form  the dragons stats are unchanged except for its size. It can't use Molten Spit  Breath Weapons  Tail Attack  or Wing Attack except in dragon form. In beast form  it can attack only with its bite and claws  if appropriate to its form. If the beast form is Large or smaller  the reach of these attacks is reduced to 5 feet. In humanoid form  it can attack only with its staff."}], "bonus_actions": null, "reactions": [{"name": "Tail Attack", "desc": "When a creature the dragon can see within 10 feet hits the dragon with a melee attack, the dragon makes a tail attack against it."}], "legendary_desc": "", "legendary_actions": [{"name": "The dragon can take 3 legendary actions", "desc": "Only one legendary action can be used at a time and only at the end of another creatures turn. It regains spent legendary actions at the start of its turn."}, {"name": "Analyze", "desc": "The dragon evaluates one creature it can see within 60 feet. It learns the creatures resistances, immunities, vulnerabilities, and current and maximum hit points. That creatures next attack roll against the dragon before the start of the dragons next turn is made with disadvantage."}, {"name": "Roar", "desc": "Each creature of the dragons choice within 120 feet that can hear it makes a DC 16 Charisma saving throw. On a failure, it is frightened for 1 minute. A creature repeats the saving throw at the end of its turns, ending the effect on itself on a success. When it succeeds on a saving throw or the effect ends for it, it is immune to Roar for 24 hours."}, {"name": "Wing Attack", "desc": "The dragon beats its wings. Each creature within 15 feet makes a DC 19 Dexterity saving throw. On a failure, it is pushed 10 feet away and knocked prone. The dragon can then fly up to half its fly speed."}], "special_abilities": [{"name": "Legendary Resistance (3/Day)", "desc": "When the dragon fails a saving throw, it can choose to succeed instead. When it does, some of its scales fall away and turn to sand. If it has no more uses of this ability, its Armor Class is reduced to 16 until it finishes a long rest."}, {"name": "Self-Sufficient", "desc": "The brass dragon can subsist on only a quart of water and a pound of food per day."}, {"name": "Scholar of the Ages", "desc": "The brass dragon gains a d4 expertise die on Intelligence checks made to recall lore. If it fails such a roll, it can use a Legendary Resistance to treat the roll as a 20."}, {"name": "Innate Spellcasting", "desc": "The dragons spellcasting ability is Charisma (save DC 16). It can innately cast the following spells, requiring no material components. 3/day each:comprehend languages, identify, commune, legend lore"}], "spell_list": [], "page_no": 156, "environments": [], "img_main": null, "document__slug": "menagerie", "document__title": "Level Up Advanced 5e Monstrous Menagerie", "document__license_url": "http://open5e.com/legal", "document__url": "https://www.levelup5e.com"}, {"slug": "adult-bronze-dragon", "desc": "", "name": "Adult Bronze Dragon", "size": "Huge", "type": "Dragon", "subtype": "", "group": "Bronze Dragon", "alignment": "lawful good", "armor_class": 19, "armor_desc": "natural armor", "hit_points": 212, "hit_dice": "17d12+102", "speed": {"walk": 40, "fly": 80, "swim": 40}, "strength": 25, "dexterity": 10, "constitution": 23, "intelligence": 16, "wisdom": 15, "charisma": 19, "strength_save": null, "dexterity_save": 5, "constitution_save": 11, "intelligence_save": null, "wisdom_save": 7, "charisma_save": 9, "perception": 12, "skills": {"insight": 7, "perception": 12, "stealth": 5}, "damage_vulnerabilities": "", "damage_resistances": "", "damage_immunities": "lightning", "condition_immunities": "", "senses": "blindsight 60 ft., darkvision 120 ft., passive Perception 22", "languages": "Common, Draconic", "challenge_rating": "15", "cr": 15.0, "actions": [{"name": "Multiattack", "desc": "The dragon can use its Frightful Presence. It then makes three attacks: one with its bite and two with its claws."}, {"name": "Bite", "desc": "Melee Weapon Attack: +12 to hit, reach 10 ft., one target. Hit: 18 (2d10 + 7) piercing damage.", "attack_bonus": 12, "damage_dice": "2d10", "damage_bonus": 7}, {"name": "Claw", "desc": "Melee Weapon Attack: +12 to hit, reach 5 ft., one target. Hit: 14 (2d6 + 7) slashing damage.", "attack_bonus": 12, "damage_dice": "2d6", "damage_bonus": 7}, {"name": "Tail", "desc": "Melee Weapon Attack: +12 to hit, reach 15 ft., one target. Hit: 16 (2d8 + 7) bludgeoning damage.", "attack_bonus": 12, "damage_dice": "2d8", "damage_bonus": 7}, {"name": "Frightful Presence", "desc": "Each creature of the dragon's choice that is within 120 feet of the dragon and aware of it must succeed on a DC 17 Wisdom saving throw or become frightened for 1 minute. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. If a creature's saving throw is successful or the effect ends for it, the creature is immune to the dragon's Frightful Presence for the next 24 hours."}, {"name": "Breath Weapons (Recharge 5-6)", "desc": "The dragon uses one of the following breath weapons.\n**Lightning Breath.** The dragon exhales lightning in a 90-foot line that is 5 feet wide. Each creature in that line must make a DC 19 Dexterity saving throw, taking 66 (12d10) lightning damage on a failed save, or half as much damage on a successful one.\n**Repulsion Breath.** The dragon exhales repulsion energy in a 30-foot cone. Each creature in that area must succeed on a DC 19 Strength saving throw. On a failed save, the creature is pushed 60 feet away from the dragon.", "attack_bonus": 0, "damage_dice": "12d10"}, {"name": "Change Shape", "desc": "The dragon magically polymorphs into a humanoid or beast that has a challenge rating no higher than its own, or back into its true form. It reverts to its true form if it dies. Any equipment it is wearing or carrying is absorbed or borne by the new form (the dragon's choice).\nIn a new form, the dragon retains its alignment, hit points, Hit Dice, ability to speak, proficiencies, Legendary Resistance, lair actions, and Intelligence, Wisdom, and Charisma scores, as well as this action. Its statistics and capabilities are otherwise replaced by those of the new form, except any class features or legendary actions of that form."}], "bonus_actions": null, "reactions": null, "legendary_desc": "The dragon can take 3 legendary actions, choosing from the options below. Only one legendary action option can be used at a time and only at the end of another creature's turn. The dragon regains spent legendary actions at the start of its turn.", "legendary_actions": [{"name": "Detect", "desc": "The dragon makes a Wisdom (Perception) check."}, {"name": "Tail Attack", "desc": "The dragon makes a tail attack."}, {"name": "Wing Attack (Costs 2 Actions)", "desc": "The dragon beats its wings. Each creature within 10 ft. of the dragon must succeed on a DC 20 Dexterity saving throw or take 14 (2d6 + 7) bludgeoning damage and be knocked prone. The dragon can then fly up to half its flying speed."}], "special_abilities": [{"name": "Amphibious", "desc": "The dragon can breathe air and water."}, {"name": "Legendary Resistance (3/Day)", "desc": "If the dragon fails a saving throw, it can choose to succeed instead."}], "spell_list": [], "page_no": 294, "environments": ["Desert", "Coastal", "Water"], "img_main": null, "document__slug": "wotc-srd", "document__title": "5e Core Rules", "document__license_url": "http://open5e.com/legal", "document__url": "http://dnd.wizards.com/articles/features/systems-reference-document-srd"}, {"slug": "adult-bronze-dragon-a5e", "desc": "", "name": "Adult Bronze Dragon", "size": "Huge", "type": "Dragon", "subtype": "", "group": null, "alignment": "", "armor_class": 18, "armor_desc": "", "hit_points": 287, "hit_dice": "23d12+138", "speed": {"walk": 40, "fly": 80, "swim": 60}, "strength": 24, "dexterity": 10, "constitution": 22, "intelligence": 16, "wisdom": 14, "charisma": 18, "strength_save": null, "dexterity_save": 6, "constitution_save": 12, "intelligence_save": null, "wisdom_save": 8, "charisma_save": 10, "perception": null, "skills": {"insight": 8, "perception": 8, "stealth": 6}, "damage_vulnerabilities": "", "damage_resistances": "", "damage_immunities": "lightning", "condition_immunities": "", "senses": "blindsight 60 ft., darkvision 120 ft., passive Perception 21", "languages": "Common, Draconic, one more", "challenge_rating": "18", "cr": 18.0, "actions": [{"name": "Multiattack", "desc": "The dragon attacks with its bite and twice with its claws. In place of its bite  it can use Lightning Pulse."}, {"name": "Bite", "desc": "Melee Weapon Attack: +13 to hit, reach 10 ft., one target. Hit: 23 (3d10 + 7) piercing damage plus 4 (1d8) lightning damage."}, {"name": "Claw", "desc": "Melee Weapon Attack: +13 to hit, reach 5 ft., one target. Hit: 20 (3d8 + 7) slashing damage."}, {"name": "Tail", "desc": "Melee Weapon Attack: +13 to hit, reach 15 ft., one target. Hit: 20 (3d8 + 7) bludgeoning damage  and the dragon pushes the target 10 feet away."}, {"name": "Trident (Humanoid Form Only)", "desc": "Melee or Ranged Weapon Attack: +13 to hit, reach 5 ft. or range 20/60 ft., one target. Hit: 10 (1d6 + 7) piercing damage."}, {"name": "Lightning Pulse", "desc": "The dragon targets one creature within 60 feet  forcing it to make a DC 20 Dexterity saving throw. The creature takes 22 (4d10) lightning damage on a failure or half damage on a success. If the initial target is touching a body of water  all other creatures within 20 feet of it and touching the same body of water must also make the saving throw against this damage."}, {"name": "Breath Weapons (Recharge 5-6)", "desc": "The dragon uses one of the following breath weapons:"}, {"name": "Lightning Breath", "desc": "The dragon exhales lightning in a 90-foot-long  5-foot-wide line. Each creature in the area makes a DC 20 Dexterity saving throw  taking 69 (13d10) lightning damage on a failed save or half damage on a success. A creature that fails the saving throw can't take reactions until the end of its next turn."}, {"name": "Ocean Surge", "desc": "The dragon exhales a torrent of seawater in a 30-foot cone. Each creature in the area makes a DC 20 Strength saving throw. A creature that fails is pushed 30 feet away from the dragon and knocked prone  while one that succeeds is pushed only 15 feet away."}, {"name": "Change Shape", "desc": "The dragon magically takes the shape of a humanoid or beast  or changes back into its true form. It reverts to its true form if it dies. Any equipment it is wearing or carrying is absorbed or borne by the new form (dragons choice). In the new form  the dragons stats are unchanged except for its size. It can't use Lightning Pulse  Breath Weapons  Tail Attack  or Wing Attack except in dragon form. In beast form  it can attack only with its bite and claws  if appropriate to its form. If the beast form is Large or smaller  the reach of these attacks is reduced to 5 feet. In humanoid form  it can attack only with its trident."}], "bonus_actions": null, "reactions": [{"name": "Tail Attack", "desc": "When a creature the dragon can see within 10 feet hits the dragon with a melee attack, the dragon makes a tail attack against it."}], "legendary_desc": "", "legendary_actions": [{"name": "The dragon can take 3 legendary actions", "desc": "Only one legendary action can be used at a time and only at the end of another creatures turn. It regains spent legendary actions at the start of its turn."}, {"name": "Roar", "desc": "Each creature of the dragons choice within 120 feet that can hear it makes a DC 18 Charisma saving throw. On a failure, it is frightened for 1 minute. A creature repeats the saving throw at the end of its turns, ending the effect on itself on a success. When it succeeds on a saving throw or the effect ends for it, it is immune to Roar for 24 hours."}, {"name": "Wing Attack", "desc": "The dragon beats its wings. Each creature within 15 feet makes a DC 21 Dexterity saving throw. On a failure, it is pushed 10 feet away and knocked prone. The dragon can then fly up to half its fly speed."}, {"name": "Foresight (Costs 2 Actions)", "desc": "The dragon focuses on the many sprawling futures before it and predicts what will come next. Attacks against it are made with disadvantage until the start of its next turn."}], "special_abilities": [{"name": "Amphibious", "desc": "The dragon can breathe air and water."}, {"name": "Legendary Resistance (3/Day)", "desc": "When the dragon fails a saving throw, it can choose to succeed instead. When it does, some of its scales fall away and turn to sea foam. If it has no more uses of this ability, its Armor Class is reduced to 16 until it finishes a long rest."}, {"name": "Oracle of the Coast", "desc": "The dragon can accurately predict the weather up to 7 days in advance and is never considered surprised while conscious. Additionally, by submerging itself in a body of water and spending 1 minute in concentration, it can cast scrying, requiring no components. The scrying orb appears in a space in the same body of water."}, {"name": "Innate Spellcasting", "desc": "The dragons spellcasting ability is Charisma (save DC 18). It can innately cast the following spells, requiring no material components. 3/day each:fog cloud, speak with animals,commune with nature, speak with plants"}], "spell_list": [], "page_no": 161, "environments": [], "img_main": null, "document__slug": "menagerie", "document__title": "Level Up Advanced 5e Monstrous Menagerie", "document__license_url": "http://open5e.com/legal", "document__url": "https://www.levelup5e.com"}, {"slug": "adult-cave-dragon", "desc": "Covered in black spikes, the dragon’s eyeless head swings from side to side. Darkness creeps from its strange, eel-like hide, spreading like ink in water.  \nApex predators of the underworld, cave dragons are the stuff of nightmare for creatures with little else to fear. They can speak, but they value silence, speaking rarely except when bargaining for food.  \n_**Born to Darkness.**_ Eyeless, these dragons have long, thin spikes that help them navigate tunnels, or seal passages around them, preventing foes from outflanking them. Their stunted wings are little more than feelers, useful in rushing down tunnels. Their narrow snouts poke into tight passages which their tongues scour free of bats and vermin. Young cave dragons and wyrmlings can fly, poorly, but older specimens lose the gift of flight entirely.  \nCave dragon coloration darkens with age, but it always provides good camouflage against stone: white like limestone, yellow, muddy brown, then black at adult and older categories. Mature adult and old cave dragons sometimes fade to gray again.  \n_**Ravenous Marauders.**_ Cave dragons are always hungry and ready to eat absolutely everything. They devour undead, plant creatures, or anything organic. When feeding, they treat all nearby creatures as both a threat and the next course. What alliances they do make only last so long as their allies make themselves scarce when the dragon feeds. They can be bribed with food as easily as with gold, but other attempts at diplomacy typically end in failure. Cave dragons do form alliances with derro or drow, joining them in battle against the darakhul, but there is always a price to be paid in flesh, bone, and marrow. Wise allies keep a cave dragon well fed.  \n_**A Hard Life.**_ Limited food underground makes truly ancient cave dragons almost unheard of. The eldest die of starvation after stripping their territory bare of prey. A few climb to the surface to feed, but their sensitivity to sunlight, earthbound movement, and lack of sight leave them at a terrible disadvantage.  \n\n## A Cave Dragon’s Lair\n\n  \nLabyrinthine systems of tunnels, caverns, and chasms make up the world of cave dragons. They claim miles of cave networks as their own. Depending on the depth of their domain, some consider the surface world their territory as well, though they visit only to eliminate potential rivals.  \nLarge vertical chimneys, just big enough to contain the beasts, make preferred ambush sites for young cave dragons. Their ruff spikes hold them in position until prey passes beneath.  \nDue to the scarcity of food in their subterranean world, a cave dragon’s hoard may consist largely of food sources: colonies of bats, enormous beetles, carcasses in various states of decay, a cavern infested with shriekers, and whatever else the dragon doesn’t immediately devour.  \nCave dragons are especially fond of bones and items with strong taste or smell. Vast collections of bones, teeth, ivory, and the shells of huge insects litter their lairs, sorted or arranged like artful ossuaries.  \nCave dragons have no permanent society. They gather occasionally to mate and to protect their eggs at certain spawning grounds. Large vertical chimneys are popular nesting sites. There, the oldest cave dragons also retreat to die in peace. Stories claim that enormous treasures are heaped up in these ledges, abysses, and other inaccessible locations.  \n\n### Lair Actions\n\n  \nOn initiative count 20 (losing initiative ties), the dragon takes a lair action for one of the following effects; the dragon can’t use the same effect two rounds in a row:\n* The ceiling collapses above one creature that the dragon can see within 120 feet of it. The creature takes 10 (3d6) bludgeoning damage and is knocked prone and restrained (by fallen debris); damage is halved and the creature is not restrained if it makes a successful DC 15 Dexterity saving throw. The creature is freed when it or an adjacent ally uses an action to make a successful DC 15 Strength (Athletics) check.\n* A ten foot-wide, ten foot-long crack opens in the cavern floor where the dragon wishes. Any creature occupying that space must make a successful DC 15 Dexterity saving throw or fall 20 feet, taking 7 (2d6) bludgeoning damage plus 7 (3d4) piercing damage from the jagged stones at the bottom.\n* The dragon summons a swarm of insects as if it had cast insect plague, filling a 20-foot radius sphere within 90 feet of the dragon. Creatures that are in the affected space or that enter it take 22 (4d10) piercing damage, or half damage with a successful DC 18 Constitution saving throw. The swarm lasts until initiative count 20 on the next round.\n  \n### Regional Effects\n\n  \nThe region containing a legendary cave dragon’s lair is warped by the dragon’s magic, which creates one or more of the following effects:\n* Poisonous and odorless gases suddenly fill passages and caverns, and just as quickly disperse, within six miles of the dragon’s lair.\n* Flash flooding turns tunnels into death traps as tremors create fissures in the stone within six miles of the lair. On the surface, ponds drain away, and long-dry creek beds break their banks in flood.\n* Swarms of vermin within one mile of the lair increase in both size and number as they try to escape the dragon’s endless and undiscriminating hunger.\n  \nIf the dragon dies, these effects fade over the course of 1d10 days.", "name": "Adult Cave Dragon", "size": "Huge", "type": "Dragon", "subtype": "", "group": null, "alignment": "neutral evil", "armor_class": 18, "armor_desc": "natural armor", "hit_points": 243, "hit_dice": "18d12+126", "speed": {"walk": 40, "climb": 40, "burrow": 40}, "strength": 26, "dexterity": 12, "constitution": 24, "intelligence": 12, "wisdom": 12, "charisma": 20, "strength_save": null, "dexterity_save": 6, "constitution_save": 12, "intelligence_save": null, "wisdom_save": 6, "charisma_save": 10, "perception": 10, "skills": {"perception": 10}, "damage_vulnerabilities": "", "damage_resistances": "", "damage_immunities": "acid, poison, thunder", "condition_immunities": "poisoned", "senses": "blindsight 120 ft., passive Perception 20", "languages": "Common, Darakhul, Draconic, Dwarvish, Goblin", "challenge_rating": "16", "cr": 16.0, "actions": [{"name": "Multiattack", "desc": "The dragon can use its Frightful Presence. It then makes three attacks: one with its bite and two with its claws."}, {"name": "Bite", "desc": "Melee Weapon Attack: +13 to hit, reach 15 ft., one target. Hit: 18 (3d6 + 8) plus 3 (1d6) poison damage.", "attack_bonus": 13, "damage_dice": "3d6"}, {"name": "Claw", "desc": "Melee Weapon Attack: +13 to hit, reach 10 ft., one target. Hit: 15 (2d6 + 8) slashing damage.", "attack_bonus": 13, "damage_dice": "2d6"}, {"name": "Tail", "desc": "Melee Weapon Attack: +13 to hit, reach 15 ft., one target. Hit: 17 (2d8 + 8) bludgeoning damage.", "attack_bonus": 13, "damage_dice": "2d8"}, {"name": "Frightful Presence", "desc": "Each creature of the dragon's choice that is within 120 feet of the dragon and aware of it must succeed on a DC 18 Wisdom saving throw or become frightened for 1 minute. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. If a creature's saving throw is successful or the effect ends for it, the creature is immune to the dragon's Frightful Presence for the next 24 hours."}, {"name": "Poison Breath (Recharge 5-6)", "desc": "The dragon exhales a cone of black poison gas in a 60-foot cone. Each target in that area takes 56 (16d6) poison damage and is poisoned if it is a creature; a successful DC 18 Constitution saving throw reduces damage by half and negates the poisoned condition. The poisoned condition lasts until the target takes a long or short rest or it's removed with lesser restoration or comparable magic."}], "bonus_actions": null, "reactions": [{"name": "Ruff Spikes", "desc": "When a creature tries to enter a space adjacent to a cave dragon, the dragon flares its many feelers and spikes. The creature cannot enter a space adjacent to the dragon unless it makes a successful DC 18 Dexterity saving throw. If the saving throw fails, the creature can keep moving but only into spaces that aren't within 5 feet of the dragon and takes 10 (3d6) piercing damage from spikes."}], "legendary_desc": "The dragon can take 3 legendary actions, choosing from the options below. Only one legendary action option can be used at a time and only at the end of another creature's turn. The dragon regains spent legendary actions at the start of its turn.", "legendary_actions": [{"name": "Detect", "desc": "The dragon makes a Wisdom (Perception) check."}, {"name": "Reset Ruff Spikes", "desc": "The dragon can use its ruff spikes as a reaction again before its next turn."}, {"name": "Tail", "desc": "The dragon makes a tail attack."}, {"name": "Swift Bite (Costs 2 Actions)", "desc": "The dragon makes two bite attacks."}], "special_abilities": [{"name": "Darkness Aura", "desc": "An adult or older cave dragon can generate an aura of darkness that fills its space and the surrounding 20 feet. This darkness prevents normal vision and darkvision from functioning. Blindsight and truesight function normally. Activating or deactivating the aura is a bonus action."}, {"name": "Earth Glide", "desc": "An adult cave dragon glides through stone, dirt, or any sort of earth except metal as easily as a fish glides through water. Its burrowing produces no ripple or other sign of its presence and leaves no tunnel or hole unless the dragon chooses to do so; in that case, it creates a passageway 15 feet wide by 10 feet high. The spell move earth cast on an area containing an earth-gliding cave dragon flings the dragon back 30 feet and stuns the creature for one round unless it succeeds on a Constitution saving throw."}, {"name": "Legendary Resistance (3/Day)", "desc": "If the dragon fails a saving throw, it can choose to succeed instead."}, {"name": "Innate Spellcasting", "desc": "the dragon's innate spellcasting ability is Charisma (spell save DC 18). It can innately cast the following spells, requiring no material components:\n\nat will: detect magic, speak with dead\n\n3/day each: blur, counterspell, darkness, web\n\n1/day each: dispel magic, hold person"}, {"name": "Cave Dragon's Lair", "desc": "on initiative count 20 (losing initiative ties), the dragon takes a lair action for one of the following effects; the dragon can't use the same effect two rounds in a row:\n\n- The ceiling collapses above one creature that the dragon can see within 120 feet of it. The creature takes 10 (3d6) bludgeoning damage and is knocked prone and restrained (by fallen debris); damage is halved and the creature is not restrained if it makes a successful DC 15 Dexterity saving throw. The creature is freed when it or an adjacent ally uses an action to make a successful DC 15 Strength (Athletics) check.\n\n- A ten foot-wide, ten foot-long crack opens in the cavern floor where the dragon wishes. Any creature occupying that space must make a successful DC 15 Dexterity saving throw or fall 20 feet, taking 7 (2d6) bludgeoning damage plus 7 (3d4) piercing damage from the jagged stones at the bottom.\n\n- The dragon summons a swarm of insects as if it had cast insect plague, filling a 20-foot radius sphere within 90 feet of the dragon. Creatures that are in the affected space or that enter it take 22 (4d10) piercing damage, or half damage with a successful DC 18 Constitution saving throw. The swarm lasts until initiative count 20 on the next round."}, {"name": "Regional Effects", "desc": "the region containing a legendary cave dragon's lair is warped by the dragon's magic, which creates one or more of the following effects:\n\n- Poisonous and odorless gases suddenly fill passages and caverns, and just as quickly disperse, within six miles of the dragon's lair.\n\n- Flash flooding turns tunnels into death traps as tremors create fissures in the stone within six miles of the lair. On the surface, ponds drain away, and long-dry creek beds break their banks in flood.\n\n- Swarms of vermin within one mile of the lair increase in both size and number as they try to escape the dragon's endless and undiscriminating hunger.\n\nif the dragon dies, these effects fade over the course of 1d10 days."}], "spell_list": [], "page_no": 125, "environments": [], "img_main": null, "document__slug": "tob", "document__title": "Tome of Beasts", "document__license_url": "http://open5e.com/legal", "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-for-5th-edition-print/"}, {"slug": "adult-copper-dragon", "desc": "", "name": "Adult Copper Dragon", "size": "Huge", "type": "Dragon", "subtype": "", "group": "Copper Dragon", "alignment": "chaotic good", "armor_class": 18, "armor_desc": "natural armor", "hit_points": 184, "hit_dice": "16d12+80", "speed": {"walk": 40, "climb": 40, "fly": 80}, "strength": 23, "dexterity": 12, "constitution": 21, "intelligence": 18, "wisdom": 15, "charisma": 17, "strength_save": null, "dexterity_save": 6, "constitution_save": 10, "intelligence_save": null, "wisdom_save": 7, "charisma_save": 8, "perception": 12, "skills": {"deception": 8, "perception": 12, "stealth": 6}, "damage_vulnerabilities": "", "damage_resistances": "", "damage_immunities": "acid", "condition_immunities": "", "senses": "blindsight 60 ft., darkvision 120 ft., passive Perception 22", "languages": "Common, Draconic", "challenge_rating": "14", "cr": 14.0, "actions": [{"name": "Multiattack", "desc": "The dragon can use its Frightful Presence. It then makes three attacks: one with its bite and two with its claws."}, {"name": "Bite", "desc": "Melee Weapon Attack: +11 to hit, reach 10 ft., one target. Hit: 17 (2d10 + 6) piercing damage.", "attack_bonus": 11, "damage_dice": "2d10", "damage_bonus": 6}, {"name": "Claw", "desc": "Melee Weapon Attack: +11 to hit, reach 5 ft., one target. Hit: 13 (2d6 + 6) slashing damage.", "attack_bonus": 11, "damage_dice": "2d6", "damage_bonus": 6}, {"name": "Tail", "desc": "Melee Weapon Attack: +11 to hit, reach 15 ft., one target. Hit: 15 (2d8 + 6) bludgeoning damage.", "attack_bonus": 11, "damage_dice": "2d8", "damage_bonus": 6}, {"name": "Frightful Presence", "desc": "Each creature of the dragon's choice that is within 120 feet of the dragon and aware of it must succeed on a DC 16 Wisdom saving throw or become frightened for 1 minute. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. If a creature's saving throw is successful or the effect ends for it, the creature is immune to the dragon's Frightful Presence for the next 24 hours."}, {"name": "Breath Weapons (Recharge 5-6)", "desc": "The dragon uses one of the following breath weapons.\n**Acid Breath.** The dragon exhales acid in an 60-foot line that is 5 feet wide. Each creature in that line must make a DC 18 Dexterity saving throw, taking 54 (12d8) acid damage on a failed save, or half as much damage on a successful one.\n**Slowing Breath.** The dragon exhales gas in a 60-foot cone. Each creature in that area must succeed on a DC 18 Constitution saving throw. On a failed save, the creature can't use reactions, its speed is halved, and it can't make more than one attack on its turn. In addition, the creature can use either an action or a bonus action on its turn, but not both. These effects last for 1 minute. The creature can repeat the saving throw at the end of each of its turns, ending the effect on itself with a successful save.", "attack_bonus": 0, "damage_dice": "12d8"}], "bonus_actions": null, "reactions": null, "legendary_desc": "The dragon can take 3 legendary actions, choosing from the options below. Only one legendary action option can be used at a time and only at the end of another creature's turn. The dragon regains spent legendary actions at the start of its turn.", "legendary_actions": [{"name": "Detect", "desc": "The dragon makes a Wisdom (Perception) check."}, {"name": "Tail Attack", "desc": "The dragon makes a tail attack."}, {"name": "Wing Attack (Costs 2 Actions)", "desc": "The dragon beats its wings. Each creature within 10 ft. of the dragon must succeed on a DC 19 Dexterity saving throw or take 13 (2d6 + 6) bludgeoning damage and be knocked prone. The dragon can then fly up to half its flying speed."}], "special_abilities": [{"name": "Legendary Resistance (3/Day)", "desc": "If the dragon fails a saving throw, it can choose to succeed instead."}], "spell_list": [], "page_no": 296, "environments": ["Hill", "Hills", "Mountains"], "img_main": null, "document__slug": "wotc-srd", "document__title": "5e Core Rules", "document__license_url": "http://open5e.com/legal", "document__url": "http://dnd.wizards.com/articles/features/systems-reference-document-srd"}, {"slug": "adult-copper-dragon-a5e", "desc": "", "name": "Adult Copper Dragon", "size": "Huge", "type": "Dragon", "subtype": "", "group": null, "alignment": "", "armor_class": 18, "armor_desc": "", "hit_points": 253, "hit_dice": "22d12+110", "speed": {"walk": 40, "climb": 40, "fly": 80}, "strength": 22, "dexterity": 12, "constitution": 20, "intelligence": 18, "wisdom": 14, "charisma": 16, "strength_save": null, "dexterity_save": 7, "constitution_save": 11, "intelligence_save": null, "wisdom_save": 8, "charisma_save": 9, "perception": null, "skills": {"deception": 10, "perception": 9, "stealth": 7}, "damage_vulnerabilities": "", "damage_resistances": "", "damage_immunities": "acid", "condition_immunities": "", "senses": "blindsight 60 ft., darkvision 120 ft., passive Perception 20", "languages": "Common, Draconic, two more", "challenge_rating": "17", "cr": 17.0, "actions": [{"name": "Multiattack", "desc": "The dragon attacks with its bite and twice with its claws. In place of its bite  it can use Acid Spit."}, {"name": "Bite", "desc": "Melee Weapon Attack: +12 to hit, reach 10 ft., one target. Hit: 22 (3d10 + 6) piercing damage plus 4 (1d8) acid damage."}, {"name": "Claws", "desc": "Melee Weapon Attack: +12 to hit, reach 5 ft., one target. Hit: 19 (3d8 + 6) slashing damage."}, {"name": "Tail", "desc": "Melee Weapon Attack: +12 to hit, reach 15 ft., one target. Hit: 19 (3d8 + 6) bludgeoning damage  and the dragon pushes the target 10 feet away."}, {"name": "War Pick (Humanoid Form Only)", "desc": "Melee Weapon Attack: +12 to hit, reach 5 ft., one target. Hit: 10 (1d8 + 6) piercing damage."}, {"name": "Acid Spit", "desc": "The dragon targets a creature within 60 feet  forcing it to make a DC 19 Dexterity saving throw. The creature takes 16 (3d10) acid damage on a failure or half damage on a success. A creature that fails the save also takes 5 (1d10) ongoing acid damage. A creature can use an action to end the ongoing damage."}, {"name": "Breath Weapons (Recharge 5-6)", "desc": "The dragon uses one of the following breath weapons:"}, {"name": "Acid Breath", "desc": "The dragon exhales acid in a 60-foot-long  5-foot-wide line. Each creature in the area makes a DC 19 Dexterity saving throw  taking 63 (14d8) acid damage on a failed save or half damage on a success. A creature that fails the save is blinded until the end of its next turn."}, {"name": "Slowing Breath", "desc": "The dragon exhales toxic gas in a 60-foot cone. Each creature in the area makes a DC 19 Constitution saving throw  becoming slowed for 1 minute on a failure. A creature repeats the saving throw at the end of each of its turns  ending the effect on itself on a success."}, {"name": "Change Shape", "desc": "The dragon magically takes the shape of a humanoid or beast  or changes back into its true form. It reverts to its true form if it dies. Any equipment it is wearing or carrying is absorbed or borne by the new form (dragons choice). In the new form  the dragons stats are unchanged except for its size. It can't use Acid Spit  Breath Weapons  Tail Attack  or Wing Attack except in dragon form. In beast form  it can attack only with its bite and claws  if appropriate to its form. If the beast form is Large or smaller  the reach of these attacks is reduced to 5 feet. In humanoid form  it can attack only with its war pick."}], "bonus_actions": null, "reactions": [{"name": "Tail Attack", "desc": "When a creature the dragon can see within 10 feet hits the dragon with a melee attack, the dragon makes a tail attack against it."}], "legendary_desc": "", "legendary_actions": [{"name": "The dragon can take 3 legendary actions", "desc": "Only one legendary action can be used at a time and only at the end of another creatures turn. It regains spent legendary actions at the start of its turn."}, {"name": "Roar", "desc": "Each creature of the dragons choice within 120 feet that can hear it makes a DC 17 Charisma saving throw. On a failure, it is frightened for 1 minute. A creature repeats the saving throw at the end of its turns, ending the effect on itself on a success. When it succeeds on a saving throw or the effect ends for it, it is immune to Roar for 24 hours."}, {"name": "Wing Attack", "desc": "The dragon beats its wings. Each creature within 15 feet makes a DC 19 Dexterity saving throw. On a failure, it is pushed 10 feet away and knocked prone. The dragon can then fly up to half its fly speed."}, {"name": "Tricksters Gambit (Costs 2 Actions)", "desc": "The dragon magically teleports to an unoccupied space it can see within 30 feet and creates two illusory duplicates in different unoccupied spaces within 30 feet. These duplicates have an AC of 11, and a creature that hits one with an attack can make a DC 16 Intelligence (Investigation) check, identifying it as a fake on a success. The duplicates disappear at the end of the dragons next turn but otherwise mimic the dragons actions perfectly, even moving according to the dragons will."}], "special_abilities": [{"name": "Flow Within the Mountain", "desc": "The dragon has advantage on Stealth checks made to hide in mountainous regions. By spending 1 minute in concentration while touching a natural stone surface, the dragon can merge into it and emerge from any connected stone surface within a mile."}, {"name": "Legendary Resistance (3/Day)", "desc": "When the dragon fails a saving throw, it can choose to succeed instead. When it does, some of its scales fall away and turn to stone. If it has no more uses of this ability, its Armor Class is reduced to 16 until it finishes a long rest."}, {"name": "Innate Spellcasting", "desc": "The dragons spellcasting ability is Charisma (save DC 17). It can innately cast the following spells, requiring no material components. 3/day each:hideous laughter, suggestion, mislead, polymorph"}], "spell_list": [], "page_no": 166, "environments": [], "img_main": null, "document__slug": "menagerie", "document__title": "Level Up Advanced 5e Monstrous Menagerie", "document__license_url": "http://open5e.com/legal", "document__url": "https://www.levelup5e.com"}, {"slug": "adult-earth-dragon-a5e", "desc": "", "name": "Adult Earth Dragon", "size": "Huge", "type": "Dragon", "subtype": "", "group": null, "alignment": "", "armor_class": 19, "armor_desc": "", "hit_points": 287, "hit_dice": "23d12+138", "speed": {"walk": 40, "fly": 40, "burrow": 60}, "strength": 22, "dexterity": 14, "constitution": 22, "intelligence": 22, "wisdom": 14, "charisma": 20, "strength_save": 12, "dexterity_save": null, "constitution_save": 12, "intelligence_save": 8, "wisdom_save": 8, "charisma_save": 7, "perception": null, "skills": {"athletics": 12, "insight": 8, "nature": 12, "perception": 8}, "damage_vulnerabilities": "", "damage_resistances": "damage from nonmagical weapons", "damage_immunities": "", "condition_immunities": "petrified", "senses": "darkvision 120 ft., tremorsense 90 ft., passive Perception 21", "languages": "Common, Draconic, Terran", "challenge_rating": "18", "cr": 18.0, "actions": [{"name": "Multiattack", "desc": "The dragon attacks once with its bite and twice with its slam. In place of its bite attack  it can use Rock Spire."}, {"name": "Bite", "desc": "Melee Weapon Attack: +12 to hit, reach 10 ft., one target. Hit: 28 (4d10 + 6) piercing damage. Instead of dealing piercing damage  the dragon can grapple the target (escape DC 20)  and a Large or smaller creature grappled in this way is restrained. While grappling a creature  the dragon can't bite another target."}, {"name": "Slam", "desc": "Melee Weapon Attack: +12 to hit, reach 5 ft., one target. Hit: 19 (3d8 + 6) bludgeoning damage."}, {"name": "Scouring Breath (Recharge 5-6)", "desc": "The dragon exhales scouring sand and stones in a 60-foot cone. Each creature in that area makes a DC 20 Dexterity saving throw  taking 56 (16d6) slashing damage on a failed save or half damage on a success. A creature that fails the save is also blinded until the end of its next turn."}, {"name": "Rock Spire", "desc": "A permanent  25-foot-tall  5-foot-radius spire of rock magically rises from a point on the ground within 60 feet. A creature in the spires area when it appears makes a DC 19 Dexterity saving throw  taking 13 (3d8) piercing damage on a failure or half damage on a success. A creature that fails this saving throw by 10 or more is impaled at the top of the spire. A creature can use an action to make a DC 12 Strength check  freeing the implaced creature on a success. The impaled creature is also freed if the spire is destroyed. The spire is an object with AC 16  30 hit points and immunity to poison and psychic damage."}], "bonus_actions": null, "reactions": null, "legendary_desc": "", "legendary_actions": [{"name": "The dragon can take 3 legendary actions", "desc": "Only one legendary action can be used at a time and only at the end of another creatures turn. It regains spent legendary actions at the start of its turn."}, {"name": "Shake the Foundation", "desc": "The dragon causes the ground to roil, creating a permanent, 40-foot-radius area of difficult terrain centered on a point the dragon can see. If the dragon is bloodied, creatures in the area make a DC 20 Dexterity saving throw, falling prone on a failure."}, {"name": "Slam Attack (Costs 2 Actions)", "desc": "The dragon makes a slam attack."}, {"name": "Entomb (While Bloodied", "desc": "The dragon targets a creature on the ground within 60 feet, forcing it to make a DC 15 Dexterity saving throw. On a failure, the creature is magically entombed 5 feet under the earth. While entombed, the target is blinded, restrained, and can't breathe. A creature can use an action to make a DC 15 Strength check, freeing an entombed creature on a success."}], "special_abilities": [{"name": "Earth Glide", "desc": "The dragon can burrow through nonmagical, unworked earth and stone without disturbing it."}, {"name": "False Appearance", "desc": "While the dragon remains motionless within its linked area, it is indistinguishable from a natural rocky outcropping."}, {"name": "Legendary Resistance (3/Day)", "desc": "When the dragon fails a saving throw, it can choose to succeed instead. When it does, it becomes more like rock. Its movement is halved until the end of its next turn."}, {"name": "Essence Link", "desc": "The essence dragon is spiritually linked to a specific area or landmark. The dragon gains no benefit from a long rest when more than 1 mile away from its linked area. If the dragon dies, the area it is linked to loses its vital essence until it forms a new essence dragon, which can take centuries. When a creature first enters an area that has lost its vital essence in this way, they gain a level of fatigue and a level of strife. This fatigue and strife can be removed only by completing a long rest outside the area."}, {"name": "Innate Spellcasting", "desc": "The dragons spellcasting ability is Charisma (save DC 15). It can innately cast the following spells, requiring no material components. 3/day each:locate animals or plants, spike growth, stone shape, wall of stone"}], "spell_list": [], "page_no": 127, "environments": [], "img_main": null, "document__slug": "menagerie", "document__title": "Level Up Advanced 5e Monstrous Menagerie", "document__license_url": "http://open5e.com/legal", "document__url": "https://www.levelup5e.com"}, {"slug": "adult-emerald-dragon-a5e", "desc": "", "name": "Adult Emerald Dragon", "size": "Huge", "type": "Dragon", "subtype": "", "group": null, "alignment": "", "armor_class": 18, "armor_desc": "", "hit_points": 241, "hit_dice": "23d12+92", "speed": {"walk": 40, "burrow": 30, "fly": 60}, "strength": 22, "dexterity": 22, "constitution": 18, "intelligence": 22, "wisdom": 12, "charisma": 18, "strength_save": null, "dexterity_save": null, "constitution_save": 10, "intelligence_save": 12, "wisdom_save": 7, "charisma_save": 10, "perception": null, "skills": {"deception": 10, "history": 12, "perception": 7, "stealth": 12}, "damage_vulnerabilities": "", "damage_resistances": "psychic, thunder", "damage_immunities": "", "condition_immunities": "fatigue", "senses": "darkvision 120 ft., passive Perception 17", "languages": "Common, Deep Speech, Draconic, Undercommon, telepathy 120 ft.", "challenge_rating": "17", "cr": 17.0, "actions": [{"name": "Multiattack", "desc": "The dragon attacks once with its bite and twice with its claws. In place of its bite  it can use Psionic Wave."}, {"name": "Bite", "desc": "Melee Weapon Attack: +12 to hit, reach 10 ft., one target. Hit: 22 (3d10 + 6) piercing damage plus 4 (1d8) thunder damage."}, {"name": "Claws", "desc": "Melee Weapon Attack: +12 to hit, reach 5 ft., one target. Hit: 19 (3d8 + 6) slashing damage."}, {"name": "Psionic Wave", "desc": "The dragon psionically emits a wave of crushing mental pressure. Each creature within 20 feet makes a DC 18 Wisdom saving throw  taking 16 (3d10) psychic damage on a failed save or half damage on a success. Confused creatures make this saving throw with disadvantage."}, {"name": "Maddening Breath (Recharge 5-6)", "desc": "The dragon screams  stripping flesh from bones and reason from minds in a 60-foot cone. Each creature in that area makes a DC 18 Constitution saving throw  taking 71 (13d10) thunder damage on a failed save or half damage on a success. Creatures that fail this saving throw by 10 or more are also psionically confused until the end of their next turn."}], "bonus_actions": null, "reactions": [{"name": "Spiteful Retort (While Bloodied)", "desc": "When a creature the dragon can see damages the dragon, the dragon lashes out with a psionic screech. The attacker makes a DC 15 Wisdom saving throw, taking 18 (4d8) thunder damage on a failed save or half damage on a success. Confused creatures make this saving throw with disadvantage."}], "legendary_desc": "", "legendary_actions": [{"name": "The dragon can take 3 legendary actions", "desc": "Only one legendary action can be used at a time and only at the end of another creatures turn. It regains spent legendary actions at the start of its turn."}, {"name": "Paranoid Ranting", "desc": "The dragon psionically rants nonsense at a creature that can hear it within 60 feet. The target makes a DC 15 Wisdom saving throw. On a failed save, the creature gains a randomly determined short-term mental stress effect or madness."}, {"name": "Pandorum (Costs 2 Actions)", "desc": "The dragon psionically targets one creature within 60 feet. The target makes a DC 15 Wisdom saving throw, becoming confused on a failure. While confused in this way, the target regards their allies as traitorous enemies. When rolling to determine its actions, treat a roll of 1 to 4 as a result of 8. The target repeats the saving throw at the end of each of its turns, ending the effect on a success."}, {"name": "Psionic Wave (Costs 2 Actions)", "desc": "The dragon makes a psionic wave attack."}, {"name": "Maddening Harmonics (1/Day)", "desc": "Each creature of the dragons choice that can hear within 90 feet makes a DC 15 Wisdom saving throw. On a failure, a creature becomes psionically confused for 1 minute. A creature repeats the saving throw at the end of each of its turns, ending the effect on itself on a success."}], "special_abilities": [{"name": "Legendary Resistance (3/Day)", "desc": "When the dragon fails a saving throw, it can choose to succeed instead. When it does, its eyes flash red as it goes into a fit of rage. Until the end of its next turn, it makes melee attacks against the creature that triggered the saving throw with advantage and with disadvantage against all other creatures."}, {"name": "Psionic Powers", "desc": "The dragons psionic abilities are considered both magical and psionic."}, {"name": "Far Thoughts", "desc": "The dragon is aware of any creature that uses a psionic ability or communicates telepathically within 100 miles of it. As an action, the dragon can psionically observe a creature, object, or location it is familiar with within 100 miles. While observing a subject in this way, the dragon can see, hear, and communicate telepathically, but it is blind and deaf in regard to its physical senses and does not require food or water. The dragon can psionically observe a subject indefinitely and can end this effect and return to its own senses as an action."}, {"name": "Innate Spellcasting", "desc": "The dragons spellcasting ability is Charisma (save DC 18). It can innately cast the following spells, requiring no material components. 3/day each:confusion, dominate person, hideous laughter, suggestion"}], "spell_list": [], "page_no": 146, "environments": [], "img_main": null, "document__slug": "menagerie", "document__title": "Level Up Advanced 5e Monstrous Menagerie", "document__license_url": "http://open5e.com/legal", "document__url": "https://www.levelup5e.com"}, {"slug": "adult-flame-dragon", "desc": "_The dragon bears black scales, more charred than naturally colored. Cracks between the scales glow a dull red, until the dragon rears its head and roars. Red embers become bright orange flames as the creature lights up from tail to maw._  \nThe flame dragons are capricious creatures, fascinated by dark emotions and destructive passions. The dragons of eternal fire are proud and jealous, quick to anger, and utterly unforgiving. They bring complete and total ruin to entire civilizations for trivial reasons, but their true motivation is the fun to be had. These burning serpents treat rage, deceit, and despair as toys for their amusement. “May you be the fire’s plaything” is a curse often used by the foolish.  \n_**Taunting Others.**_ The hot-blooded creatures tease their victims like cats, seeing the world and all within it as their rightful prey. Young flame dragons are less subtle than their elders. Wyrmlings may force a woman to watch her family die or ruin a beautiful face for pleasure—direct and evil. As the dragon matures, this natural sadism develops into a desire for more complicated sport. Aging dragons of fire use politics, murder, and magic in elaborate schemes only their ilk can appreciate. Many create plots so intricate and layered that they lack a true resolution, creating only endless manipulation. A hero might foil an assassination only to see the king thus saved become a despot. She might defeat the vizier whispering lies in the ruler’s ear only to discover he was a pawn in a vast conspiracy. Dark ambitions, poisoned daggers, and old vendettas build such momentum that one scheme begins each time another ends. Often, even killing the draconic mastermind cannot extinguish the fires it started.  \n_**Malevolent Purpose.**_ The results of these schemes are secondary to the enjoyment they derive from pursuing a nebulous and everchanging goal. Some spend centuries torturing a family line for nothing more than trespassing on the dragon’s land. Others plot eternal curses after twisting poorly chosen words into the most dire of insults. The vengeance itself is not as important as having an excuse to hate, plot, and ruin. Flame dragons relish such opportunities for revenge, seeing each as a delightful hobby. The disruption of a game kindles a true and terrible rage, and in these rare moments of defeat, their anger can be catastrophic. Entire cities burn.  \n_**Fond of Souvenirs.**_ Flame dragons are as materialistic and territorial as other true dragons. Each pursues an individual obsession it fixates upon with mad devotion to fill its hoard. Some corrupt innocence, others push nations to war, but they always collect a memento for each victory, whether petty or grand. One might collect scorched skulls, while another saves the melted treasures of toppled empires. When not out sowing discord, the ancient flame dragons enjoy contemplating their hoards. Every piece reminds them of their own majesty and genius.  \nNothing is safe from a flame dragon’s endless scheming and narcissism. They crave absolute attention and constant reassurance. Anyone who humiliates a flame dragon would be wiser to kill it. Its survival ensures the dragon’s undivided attention for generations. It would be wiser still to make certain there is not a trace of involvement in a flame dragon’s death. All burning serpents see the murder of one of their kin as the gravest insult.  \n\n## Flame Dragon’s Lair\n\n  \nFlame dragons dwell in lairs where a burning fire is always near: volcanoes, sulfur mines, caves full of geysers, and places where the Elemental Plane of Fire touches the Material Plane. Whatever the place, its purpose is always to serve as a showcase of all the trophies the dragon has collected. Carefully arranged and organized prizes decorate the walls, sometimes even protected behind crystal walls. This display both feeds the dragon's vanity and pride, and also serves as a lure to attract adventurers, since flame dragons love to encourage the lowest instincts in their prey.  \nMany of these lairs feature a huge, reflective surface. A flame dragon likes nothing more than itself.  \n\n### Lair Actions\n\n  \nOn initiative count 20 (losing initiative ties), the dragon takes a lair action to cause one of the following effects; the dragon can’t use the same effect two rounds in a row.\n* A cloud of smoke swirls in a 20-foot-radius sphere centered on a point the dragon can see within 120 feet of it. The cloud spreads around corners and the area is lightly obscured. Each creature in the cloud must succeed on a DC 15 Constitution saving throw or be blinded for 1 minute. A blinded creature repeats the saving throw at the end of each of its turns, ending the effect on itself on a success.\n* The ground erupts with volcanic force at a point the dragon can see within 120 feet of it. Any creature within 20 feet of the point must make a successful DC 15 Dexterity saving throw or be knocked prone and trapped in the ground. A creature trapped in this way is restrained and can’t stand up. A creature can end the restraint if it or another creature takes an action to make a successful DC 15 Strength check.\n* A wall of fire rises up from the ground within 120 feet of the dragon. The wall is up to 60 feet long, 10 feet high, and 5 feet thick, can take any shape the dragon wants, and blocks line of sight. When the wall appears, each creature in its area must make a DC 15 Dexterity saving throw. A creature that fails the saving throw takes 21 (6d6) fire damage. Each creature that enters the wall for the first time each turn or ends its turn there takes 21 (6d6) fire damage. The wall is extinguished when the dragon uses this lair action again or when the dragon dies.\n  \n### Regional Effects\n\n  \nThe region containing a legendary flame dragon’s lair is warped by the dragon’s magic, which creates one or more of the following effects:\n* Arguments and misunderstandings erupt easily within 6 miles of the lair. Friendships are easily broken and criminal acts are common.\n* Temperatures rise within 6 miles of the lair. Crops wither, producing famines.\n* Sulfur geysers form in and around the dragon’s lair. Some of them erupt only once an hour, so they’re spotted only with a successful DC 20 Wisdom (Perception) check. A creature on top of an erupting geyser takes 21 (6d6) fire damage, or half damage with a successful DC 15 Dexterity saving throw.\n  \nIf the dragon dies, the arguments and misunderstandings disappear immediately and the temperatures go back to normal within 1d10 days. Any geysers remain where they are.", "name": "Adult Flame Dragon", "size": "Huge", "type": "Dragon", "subtype": "", "group": null, "alignment": "chaotic evil", "armor_class": 19, "armor_desc": "natural armor", "hit_points": 212, "hit_dice": "17d12+102", "speed": {"walk": 40, "climb": 40, "fly": 80}, "strength": 19, "dexterity": 14, "constitution": 23, "intelligence": 17, "wisdom": 14, "charisma": 20, "strength_save": null, "dexterity_save": 7, "constitution_save": 11, "intelligence_save": null, "wisdom_save": 7, "charisma_save": 10, "perception": 12, "skills": {"deception": 10, "insight": 7, "perception": 12, "persuasion": 10, "stealth": 7}, "damage_vulnerabilities": "", "damage_resistances": "", "damage_immunities": "fire", "condition_immunities": "", "senses": "blindsight 60ft, darkvision 120ft, passive Perception 22", "languages": "Common, Draconic, Giant, Ignan, Infernal, Orc", "challenge_rating": "16", "cr": 16.0, "actions": [{"name": "Multiattack", "desc": "The dragon can use its Frightful Presence. It then makes one bite attack and two claw attacks."}, {"name": "Bite", "desc": "Melee Weapon Attack: +9 to hit, reach 10 ft., one target. Hit: 15 (2d10 + 4) piercing damage plus 7 (2d6) fire damage.", "attack_bonus": 9, "damage_dice": "2d10"}, {"name": "Claw", "desc": "Melee Weapon Attack: +9 to hit, reach 5 ft., one target. Hit: 11 (2d6 + 4) slashing damage.", "attack_bonus": 9, "damage_dice": "2d6"}, {"name": "Tail", "desc": "Melee Weapon Attack: +9 to hit, reach 15 ft., one target. Hit: 13 (2d8 + 4) bludgeoning damage.", "attack_bonus": 9, "damage_dice": "2d8"}, {"name": "Frightful Presence", "desc": "Each creature of the dragon's choice that is within 120 feet of the dragon and aware of it must succeed on a DC 18 Wisdom saving throw or become frightened for 1 minute. A frightened creature repeats the saving throw at the end of each of its turns, ending the effect on itself on a success. If a creature's saving throw is successful or the effect ends for it, the creature is immune to the dragon's Frightful Presence for the next 24 hours."}, {"name": "Fire Breath (Recharge 5-6)", "desc": "The dragon exhales fire in a 60-foot cone. Each creature in that area takes 63 (18d6) fire damage, or half damage with a successful DC 19 Dexterity saving throw. Each creature in that area must also succeed on a DC 18 Wisdom saving throw or go on a rampage for 1 minute. A rampaging creature must attack the nearest living creature or smash some object smaller than itself if no creature can be reached with a single move. A rampaging creature repeats the saving throw at the end of each of its turns, ending the effect on itself on a success."}, {"name": "Shifting Flames", "desc": "The dragon magically polymorphs into a creature that has immunity to fire damage and a size and challenge rating no higher than its own, or back into its true form. It reverts to its true form if it dies. Any equipment it is wearing or carrying is absorbed or borne by the new form (the dragon's choice). In a new form, the dragon retains its alignment, hit points, Hit Dice, ability to speak, proficiencies, Legendary Resistance, lair actions, and Intelligence, Wisdom, and Charisma scores, as well as this action. Its statistics and capabilities are otherwise replaced by those of the new form, except any class features or legendary actions of that form."}], "bonus_actions": null, "reactions": null, "legendary_desc": "The dragon can take 3 legendary actions, choosing from the options below. Only one legendary action option can be used at a time and only at the end of another creature's turn. The dragon regains spent legendary actions at the start of its turn.", "legendary_actions": [{"name": "Detect", "desc": "The dragon makes a Wisdom (Perception) check."}, {"name": "Tail Attack", "desc": "The dragon makes a tail attack."}, {"name": "Wing Attack (Costs 2 Actions)", "desc": "The dragon beats its wings. Each creature within 15 feet of the dragon must succeed on a DC 17 Dexterity saving throw or take 11 (2d6 + 4) bludgeoning damage and be knocked prone. The dragon can then fly up to half its flying speed."}], "special_abilities": [{"name": "Legendary Resistance (3/Day)", "desc": "If the dragon fails a saving throw, it can choose to succeed instead."}, {"name": "Fire Incarnate", "desc": "All fire damage dealt by the dragon ignores fire resistance but not fire immunity."}], "spell_list": [], "page_no": 129, "environments": [], "img_main": null, "document__slug": "tob", "document__title": "Tome of Beasts", "document__license_url": "http://open5e.com/legal", "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-for-5th-edition-print/"}, {"slug": "adult-gold-dragon", "desc": "", "name": "Adult Gold Dragon", "size": "Huge", "type": "Dragon", "subtype": "", "group": "Gold Dragon", "alignment": "lawful good", "armor_class": 19, "armor_desc": "natural armor", "hit_points": 256, "hit_dice": "19d12+133", "speed": {"walk": 40, "fly": 80, "swim": 40}, "strength": 27, "dexterity": 14, "constitution": 25, "intelligence": 16, "wisdom": 15, "charisma": 24, "strength_save": null, "dexterity_save": 8, "constitution_save": 13, "intelligence_save": null, "wisdom_save": 8, "charisma_save": 13, "perception": 14, "skills": {"insight": 8, "perception": 14, "persuasion": 13, "stealth": 8}, "damage_vulnerabilities": "", "damage_resistances": "", "damage_immunities": "fire", "condition_immunities": "", "senses": "blindsight 60 ft., darkvision 120 ft., passive Perception 24", "languages": "Common, Draconic", "challenge_rating": "17", "cr": 17.0, "actions": [{"name": "Multiattack", "desc": "The dragon can use its Frightful Presence. It then makes three attacks: one with its bite and two with its claws."}, {"name": "Bite", "desc": "Melee Weapon Attack: +14 to hit, reach 10 ft., one target. Hit: 19 (2d10 + 8) piercing damage.", "attack_bonus": 14, "damage_dice": "2d10", "damage_bonus": 8}, {"name": "Claw", "desc": "Melee Weapon Attack: +14 to hit, reach 5 ft., one target. Hit: 15 (2d6 + 8) slashing damage.", "attack_bonus": 14, "damage_dice": "2d6", "damage_bonus": 8}, {"name": "Tail", "desc": "Melee Weapon Attack: +14 to hit, reach 15 ft., one target. Hit: 17 (2d8 + 8) bludgeoning damage.", "attack_bonus": 14, "damage_dice": "2d8", "damage_bonus": 8}, {"name": "Frightful Presence", "desc": "Each creature of the dragon's choice that is within 120 feet of the dragon and aware of it must succeed on a DC 21 Wisdom saving throw or become frightened for 1 minute. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. If a creature's saving throw is successful or the effect ends for it, the creature is immune to the dragon's Frightful Presence for the next 24 hours."}, {"name": "Breath Weapons (Recharge 5-6)", "desc": "The dragon uses one of the following breath weapons.\n**Fire Breath.** The dragon exhales fire in a 60-foot cone. Each creature in that area must make a DC 21 Dexterity saving throw, taking 66 (12d10) fire damage on a failed save, or half as much damage on a successful one.\n**Weakening Breath.** The dragon exhales gas in a 60-foot cone. Each creature in that area must succeed on a DC 21 Strength saving throw or have disadvantage on Strength-based attack rolls, Strength checks, and Strength saving throws for 1 minute. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success.", "attack_bonus": 0, "damage_dice": "12d10"}, {"name": "Change Shape", "desc": "The dragon magically polymorphs into a humanoid or beast that has a challenge rating no higher than its own, or back into its true form. It reverts to its true form if it dies. Any equipment it is wearing or carrying is absorbed or borne by the new form (the dragon's choice).\nIn a new form, the dragon retains its alignment, hit points, Hit Dice, ability to speak, proficiencies, Legendary Resistance, lair actions, and Intelligence, Wisdom, and Charisma scores, as well as this action. Its statistics and capabilities are otherwise replaced by those of the new form, except any class features or legendary actions of that form."}], "bonus_actions": null, "reactions": null, "legendary_desc": "The dragon can take 3 legendary actions, choosing from the options below. Only one legendary action option can be used at a time and only at the end of another creature's turn. The dragon regains spent legendary actions at the start of its turn.", "legendary_actions": [{"name": "Detect", "desc": "The dragon makes a Wisdom (Perception) check."}, {"name": "Tail Attack", "desc": "The dragon makes a tail attack."}, {"name": "Wing Attack (Costs 2 Actions)", "desc": "The dragon beats its wings. Each creature within 10 ft. of the dragon must succeed on a DC 22 Dexterity saving throw or take 15 (2d6 + 8) bludgeoning damage and be knocked prone. The dragon can then fly up to half its flying speed."}], "special_abilities": [{"name": "Amphibious", "desc": "The dragon can breathe air and water."}, {"name": "Legendary Resistance (3/Day)", "desc": "If the dragon fails a saving throw, it can choose to succeed instead."}], "spell_list": [], "page_no": 299, "environments": ["Astral Plane", "Grassland", "Water", "Ruin", "Forest"], "img_main": null, "document__slug": "wotc-srd", "document__title": "5e Core Rules", "document__license_url": "http://open5e.com/legal", "document__url": "http://dnd.wizards.com/articles/features/systems-reference-document-srd"}, {"slug": "adult-gold-dragon-a5e", "desc": "", "name": "Adult Gold Dragon", "size": "Huge", "type": "Dragon", "subtype": "", "group": null, "alignment": "", "armor_class": 19, "armor_desc": "", "hit_points": 324, "hit_dice": "24d12+168", "speed": {"walk": 40, "fly": 80, "swim": 40}, "strength": 26, "dexterity": 14, "constitution": 24, "intelligence": 16, "wisdom": 14, "charisma": 24, "strength_save": null, "dexterity_save": 8, "constitution_save": 13, "intelligence_save": null, "wisdom_save": 8, "charisma_save": 13, "perception": null, "skills": {"insight": 8, "perception": 8, "persuasion": 13, "stealth": 8}, "damage_vulnerabilities": "", "damage_resistances": "", "damage_immunities": "fire", "condition_immunities": "", "senses": "blindsight 60 ft., darkvision 120 ft., passive Perception 21", "languages": "Common, Draconic, one more", "challenge_rating": "20", "cr": 20.0, "actions": [{"name": "Multiattack", "desc": "The dragon attacks with its bite and twice with its claws."}, {"name": "Bite", "desc": "Melee Weapon Attack: +18 to hit, reach 15 ft., one target. Hit: 32 (4d10 + 10) piercing damage plus 9 (2d8) fire damage."}, {"name": "Claws", "desc": "Melee Weapon Attack: +18 to hit, reach 10 ft., one target. Hit: 28 (4d8 + 10) slashing damage."}, {"name": "Tail", "desc": "Melee Weapon Attack: +18 to hit, reach 20 ft., one target. Hit: 23 (3d8 + 10) bludgeoning damage  and the dragon pushes the target 10 feet away."}, {"name": "Greatsword (Humanoid Form Only)", "desc": "Melee Weapon Attack: +18 to hit, reach 5 ft., one target. Hit: 17 (2d6 + 10) slashing damage."}, {"name": "Molten Spit", "desc": "The dragon targets one creature within 60 feet  forcing it to make a DC 25 Dexterity saving throw. The creature takes 27 (5d10) fire damage on a failure or half on a success. Liquid gold pools in a 5-foot-square occupied by the creature and remains hot for 1 minute. A creature that ends its turn in the gold or enters it for the first time on a turn takes 22 (4d10) fire damage."}, {"name": "Breath Weapons (Recharge 5-6)", "desc": "The dragon uses one of the following breath weapons:"}, {"name": "Molten Breath", "desc": "The dragon exhales molten gold in a 90-foot cone. Each creature in the area makes a DC 25 Dexterity saving throw  taking 88 (16d10) fire damage on a failed save or half damage on a success. A creature that fails the saving throw is covered in a shell of rapidly cooling gold  reducing its Speed to 0. A creature can use an action to break the shell  ending the effect."}, {"name": "Weakening Breath", "desc": "The dragon exhales weakening gas in a 90-foot cone. Each creature in the area must succeed on a DC 25 Constitution saving throw or suffer disadvantage on weapon attack rolls for 1 minute. A weakened creature repeats the saving throw at the end of each of its turns  ending the effect on a success."}, {"name": "Change Shape", "desc": "The dragon magically takes the shape of a humanoid or beast  or changes back into its true form. It reverts to its true form if it dies. Any equipment it is wearing or carrying is absorbed or borne by the new form (dragons choice). In the new form  the dragons stats are unchanged except for its size. It can't use Molten Spit  Breath Weapons  Tail Attack  or Wing Attack except in dragon form. In beast form  it can attack only with its bite and claws  if appropriate to its form. If the beast form is Large or smaller  the reach of these attacks is reduced to 5 feet. In humanoid form  it can attack only with its greatsword."}], "bonus_actions": null, "reactions": [{"name": "Tail Attack", "desc": "When a creature the dragon can see within 10 feet hits the dragon with a melee attack, the dragon makes a tail attack against it."}, {"name": "Vanguard", "desc": "When another creature the dragon can see within 20 feet is hit by an attack, the dragon deflects the attack, turning the hit into a miss."}], "legendary_desc": "", "legendary_actions": [{"name": "The dragon can take 3 legendary actions", "desc": "Only one legendary action can be used at a time and only at the end of another creatures turn. It regains spent legendary actions at the start of its turn."}, {"name": "Roar", "desc": "Each creature of the dragons choice within 120 feet that can hear it makes a DC 25 Charisma saving throw. On a failure, it is frightened for 1 minute. A creature repeats the saving throw at the end of its turns, ending the effect on itself on a success. When it succeeds on a saving throw or the effect ends for it, it is immune to Roar for 24 hours."}, {"name": "Wing Attack", "desc": "The dragon beats its wings. Each creature within 15 feet makes a DC 26 Dexterity saving throw. On a failure, it is pushed 10 feet away and knocked prone. The dragon can then fly up to half its fly speed."}, {"name": "Fiery Reprisal (Costs 2 Actions)", "desc": "The dragon uses Molten Spit against the last creature to deal damage to it."}], "special_abilities": [{"name": "Legendary Resistance (3/Day)", "desc": "When the dragon fails a saving throw, it can choose to succeed instead. When it does, some of its scales melt away, forming pools of molten gold. If it has no more uses of this ability, its Armor Class is reduced to 17 until it finishes a long rest."}, {"name": "Valor", "desc": "Creatures of the dragons choice within 30 feet gain a +2 bonus to saving throws and are immune to the charmed and frightened conditions."}, {"name": "Innate Spellcasting", "desc": "The dragons spellcasting ability is Charisma (save DC 21). It can innately cast the following spells, requiring no material components. 3/day each:bless, healing word,banishment, greater restoration"}], "spell_list": [], "page_no": 172, "environments": [], "img_main": null, "document__slug": "menagerie", "document__title": "Level Up Advanced 5e Monstrous Menagerie", "document__license_url": "http://open5e.com/legal", "document__url": "https://www.levelup5e.com"}, {"slug": "adult-green-dragon", "desc": "", "name": "Adult Green Dragon", "size": "Huge", "type": "Dragon", "subtype": "", "group": "Green Dragon", "alignment": "lawful evil", "armor_class": 19, "armor_desc": "natural armor", "hit_points": 207, "hit_dice": "18d12+90", "speed": {"walk": 40, "fly": 80, "swim": 40}, "strength": 23, "dexterity": 12, "constitution": 21, "intelligence": 18, "wisdom": 15, "charisma": 17, "strength_save": null, "dexterity_save": 6, "constitution_save": 10, "intelligence_save": null, "wisdom_save": 7, "charisma_save": 8, "perception": 12, "skills": {"deception": 8, "insight": 7, "perception": 12, "persuasion": 8, "stealth": 6}, "damage_vulnerabilities": "", "damage_resistances": "", "damage_immunities": "poison", "condition_immunities": "poisoned", "senses": "blindsight 60 ft., darkvision 120 ft., passive Perception 22", "languages": "Common, Draconic", "challenge_rating": "15", "cr": 15.0, "actions": [{"name": "Multiattack", "desc": "The dragon can use its Frightful Presence. It then makes three attacks: one with its bite and two with its claws."}, {"name": "Bite", "desc": "Melee Weapon Attack: +11 to hit, reach 10 ft., one target. Hit: 17 (2d10 + 6) piercing damage plus 7 (2d6) poison damage.", "attack_bonus": 11, "damage_dice": "2d10+2d6", "damage_bonus": 6}, {"name": "Claw", "desc": "Melee Weapon Attack: +11 to hit, reach 5 ft., one target. Hit: 13 (2d6 + 6) slashing damage.", "attack_bonus": 11, "damage_dice": "2d6", "damage_bonus": 6}, {"name": "Tail", "desc": "Melee Weapon Attack: +11 to hit, reach 15 ft., one target. Hit: 15 (2d8 + 6) bludgeoning damage.", "attack_bonus": 11, "damage_dice": "2d8", "damage_bonus": 6}, {"name": "Frightful Presence", "desc": "Each creature of the dragon's choice that is within 120 feet of the dragon and aware of it must succeed on a DC 16 Wisdom saving throw or become frightened for 1 minute. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. If a creature's saving throw is successful or the effect ends for it, the creature is immune to the dragon's Frightful Presence for the next 24 hours."}, {"name": "Poison Breath (Recharge 5-6)", "desc": "The dragon exhales poisonous gas in a 60-foot cone. Each creature in that area must make a DC 18 Constitution saving throw, taking 56 (16d6) poison damage on a failed save, or half as much damage on a successful one.", "attack_bonus": 0, "damage_dice": "16d6"}], "bonus_actions": null, "reactions": null, "legendary_desc": "The dragon can take 3 legendary actions, choosing from the options below. Only one legendary action option can be used at a time and only at the end of another creature's turn. The dragon regains spent legendary actions at the start of its turn.", "legendary_actions": [{"name": "Detect", "desc": "The dragon makes a Wisdom (Perception) check."}, {"name": "Tail Attack", "desc": "The dragon makes a tail attack."}, {"name": "Wing Attack (Costs 2 Actions)", "desc": "The dragon beats its wings. Each creature within 10 ft. of the dragon must succeed on a DC 19 Dexterity saving throw or take 13 (2d6 + 6) bludgeoning damage and be knocked prone. The dragon can then fly up to half its flying speed."}], "special_abilities": [{"name": "Amphibious", "desc": "The dragon can breathe air and water."}, {"name": "Legendary Resistance (3/Day)", "desc": "If the dragon fails a saving throw, it can choose to succeed instead."}], "spell_list": [], "page_no": 285, "environments": ["Jungle", "Forest"], "img_main": null, "document__slug": "wotc-srd", "document__title": "5e Core Rules", "document__license_url": "http://open5e.com/legal", "document__url": "http://dnd.wizards.com/articles/features/systems-reference-document-srd"}, {"slug": "adult-green-dragon-a5e", "desc": "", "name": "Adult Green Dragon", "size": "Huge", "type": "Dragon", "subtype": "", "group": null, "alignment": "", "armor_class": 18, "armor_desc": "", "hit_points": 287, "hit_dice": "25d12+125", "speed": {"walk": 40, "fly": 80, "swim": 40}, "strength": 20, "dexterity": 12, "constitution": 20, "intelligence": 18, "wisdom": 14, "charisma": 16, "strength_save": null, "dexterity_save": 7, "constitution_save": 11, "intelligence_save": null, "wisdom_save": 8, "charisma_save": 9, "perception": null, "skills": {"deception": 9, "insight": 8, "perception": 8, "persuasion": 9, "stealth": 7}, "damage_vulnerabilities": "", "damage_resistances": "", "damage_immunities": "poison", "condition_immunities": "poisoned", "senses": "blindsight 60 ft., darkvision 120 ft., passive Perception 21", "languages": "Common, Draconic, two more", "challenge_rating": "18", "cr": 18.0, "actions": [{"name": "Multiattack", "desc": "The dragon attacks once with its bite and twice with its claws. In place of its bite attack  it can Spit Poison."}, {"name": "Bite", "desc": "Melee Weapon Attack: +12 to hit, reach 10 ft., one target. Hit: 22 (3d10 + 6) piercing damage plus 4 (1d8) poison damage."}, {"name": "Claw", "desc": "Melee Weapon Attack: +12 to hit, reach 5 ft., one target. Hit: 19 (3d8 + 6) slashing damage."}, {"name": "Tail", "desc": "Melee Weapon Attack: +12 to hit, reach 15 ft., one target. Hit: 15 (2d8 + 6) bludgeoning damage  and the dragon pushes the target 10 feet away."}, {"name": "Spit Poison", "desc": "The dragon targets a creature within 60 feet  forcing it to make a DC 19 Dexterity saving throw. The creature takes 22 (4d10) poison damage on a failure or half damage on a success. A creature that fails the save is also poisoned for 1 minute. The creature repeats the saving throw at the end of each of its turns  taking 11 (2d10) poison damage on a failure and ending the effect on a success."}, {"name": "Poison Breath (Recharge 5-6)", "desc": "The dragon exhales poisonous gas in a 60-foot cone. Each creature in that area makes a DC 19 Constitution saving throw  taking 63 (18d6) poison damage on a failed save or half damage on a success. A creature with immunity to poison damage that fails the save takes no damage  but its poison immunity is reduced to resistance for the next hour."}, {"name": "Honeyed Words", "desc": "The dragons words sow doubt in the minds of those who hear them. One creature within 60 feet who can hear and understand the dragon makes a DC 17 Wisdom saving throw. On a failure  the creature must use its reaction  if available  to make one attack against a creature of the dragons choice with whatever weapon it has to do so  moving up to its speed as part of the reaction if necessary. It need not use any special class features (such as Sneak Attack or Divine Smite) when making this attack. If it can't get in a position to attack the creature  it moves as far as it can toward the target before regaining its senses. A creature immune to being charmed is immune to this ability."}], "bonus_actions": null, "reactions": [{"name": "Tail Attack", "desc": "When a creature the dragon can see within 10 feet hits the dragon with a melee attack, the dragon makes a tail attack against it."}], "legendary_desc": "", "legendary_actions": [{"name": "The dragon can take 3 legendary actions", "desc": "Only one legendary action can be used at a time and only at the end of another creatures turn. It regains spent legendary actions at the start of its turn."}, {"name": "Honeyed Words", "desc": "The dragon uses Honeyed Words."}, {"name": "Roar", "desc": "Each creature of the dragons choice within 120 feet that can hear it makes a DC 17 Charisma saving throw. On a failure, it is frightened for 1 minute. A creature repeats the saving throw at the end of its turns, ending the effect on itself on a success. When it succeeds on a saving throw or the effect ends for it, it is immune to Roar for 24 hours."}, {"name": "Wing Attack", "desc": "The dragon beats its wings. Each creature within 15 feet makes a DC 19 Dexterity saving throw. On a failure, it is pushed 10 feet away and knocked prone. The dragon can then fly up to half its fly speed."}], "special_abilities": [{"name": "Amphibious", "desc": "The dragon can breathe air and water."}, {"name": "Legendary Resistance (3/Day)", "desc": "When the dragon fails a saving throw, it can choose to succeed instead. When it does, it sheds some of its scales, which turn into dry leaves and blow away. If it has no more uses of this ability, its Armor Class is reduced to 17 until it finishes a long rest."}, {"name": "Woodland Stalker", "desc": "When in a forested area, the dragon has advantage on Stealth checks. Additionally, when it speaks in such a place, it can project its voice such that it seems to come from all around, allowing it to remain hidden while speaking."}, {"name": "Innate Spellcasting", "desc": "The dragons spellcasting ability is Charisma (save DC 17). It can innately cast the following spells, requiring no material components. 3/day each:animal messenger, tongues, modify memory, scrying"}], "spell_list": [], "page_no": 113, "environments": [], "img_main": null, "document__slug": "menagerie", "document__title": "Level Up Advanced 5e Monstrous Menagerie", "document__license_url": "http://open5e.com/legal", "document__url": "https://www.levelup5e.com"}, {"slug": "adult-imperial-dragon", "desc": "The long, serpentine dragon is wingless and possesses shimmering, opalescent scales. Its appearance is at once both serene and majestic._  \n**Dragons of the Spirit World.** Imperial dragons are tied to the world of celestials, fiends, and spirits. They freely parley with such creatures for knowledge about the outer planes or the fundamental mysteries of the universe. Some of the most powerful imperial dragons even become the servants of the gods in exchange for wisdom, acting as intermediaries between the divine and mortal realms.  \n**Colorful and Magical.** Imperial dragons are capable of changing their colors and forms. They are typically a rich, golden-yellow, but azure-, jade-, and vermillion-colored dragons are not unheard of, and even white and black imperial dragons have been reported. A magical organ in their skulls gives them the ability to fly without the aid of wings, and they are often hunted for this organ, which is rumored to grant eternal life if consumed.  \n**Masters of Wind and Rain.** Imperial dragons are creatures of wind and water, and the eldest of their kind exhibit mastery of these elements. They love the seas where they make their homes and sometimes act as guardians for sacred sites or temples near or beneath the waves. This often puts them in conflict with militant aquatic races like the Open Game License", "name": "Adult Imperial Dragon", "size": "Huge", "type": "Dragon", "subtype": "", "group": null, "alignment": "neutral", "armor_class": 19, "armor_desc": "natural armor", "hit_points": 297, "hit_dice": "22d12+154", "speed": {"fly": 80, "walk": 40, "swim": 40}, "strength": 27, "dexterity": 12, "constitution": 25, "intelligence": 18, "wisdom": 16, "charisma": 18, "strength_save": null, "dexterity_save": 7, "constitution_save": 13, "intelligence_save": null, "wisdom_save": 9, "charisma_save": 10, "perception": 15, "skills": {"arcana": 10, "history": 10, "insight": 9, "perception": 15, "stealth": 7}, "damage_vulnerabilities": "", "damage_resistances": "", "damage_immunities": "lightning, thunder", "condition_immunities": "", "senses": "blindsight 60 ft., darkvision 120 ft., passive Perception 25", "languages": "all", "challenge_rating": "20", "cr": 20.0, "actions": [{"name": "Multiattack", "desc": "The dragon can use its Mesmerizing Presence. It then makes three attacks: one with its bite and two with its claws."}, {"name": "Bite", "desc": "Melee Weapon Attack: +14 to hit, reach 10 ft., Hit: 19 (2d10 + 8) piercing damage.", "attack_bonus": 14, "damage_dice": "2d10+8"}, {"name": "Claw", "desc": "Melee Weapon Attack: +14 to hit, reach 5 ft., one target. Hit: 15 (2d6 + 8) slashing damage.", "attack_bonus": 14, "damage_dice": "2d6+8"}, {"name": "Tail", "desc": "Melee Weapon Attack: +14 to hit, reach 15 ft., one target. Hit: 17 (2d8 + 8) bludgeoning damage.", "attack_bonus": 14, "damage_dice": "2d8+8"}, {"name": "Mesmerizing Presence", "desc": "Each creature of the dragon’s choice that is within 120 feet of the dragon and aware of it must succeed on a DC 20 Wisdom saving throw or become charmed by the dragon for 1 minute. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. If a creature’s saving throw is successful or the effect ends for it, the creature is immune to the dragon’s Mesmerizing Presence for the next 24 hours."}, {"name": "Lightning Breath (Recharge 5-6)", "desc": "The dragon exhales lightning in a 90-foot line that is 5 feet wide. Each creature in that line must make a DC 21 Dexterity saving throw, taking 55 (10d10) lightning damage on a failed save, or half as much damage on a successful one."}, {"name": "Change Shape", "desc": "The dragon magically polymorphs into a humanoid or beast that has a challenge rating no higher than its own, or back into its true form. It reverts to its true form if it dies. Any equipment it is wearing or carrying is absorbed or borne by the new form (the dragon’s choice). In a new form, the dragon retains its alignment, hp, Hit Dice, ability to speak, proficiencies, Legendary Resistance, lair actions, and Intelligence, Wisdom, and Charisma scores, as well as this action. Its statistics and capabilities are otherwise replaced by those of the new form, except any class features or legendary actions of that form.\n\nThe dragon can choose to transform only part of its body with this action, allowing it to sprout rabbit-like ears or a humanoid head. These changes are purely cosmetic and don’t alter statistics."}], "bonus_actions": null, "reactions": null, "legendary_desc": "The dragon can take 3 legendary actions, choosing from the options below. Only one legendary action can be used at a time and only at the end of another creature’s turn. The dragon regains spent legendary actions at the start of its turn.", "legendary_actions": [{"name": "Detect", "desc": "The dragon makes a Wisdom (Perception) check."}, {"name": "Tail Attack", "desc": "The dragon makes a tail attack."}, {"name": "Cast a Spell (Costs 3 Actions)", "desc": "The dragon casts a spell from its list of innate spells, consuming a use of the spell as normal."}], "special_abilities": [{"name": "Amphibious", "desc": "The dragon can breathe air and water."}, {"name": "Legendary Resistance (3/Day)", "desc": "If the dragon fails a saving throw, it can choose to succeed instead."}, {"name": "Truespeak", "desc": "The dragon can communicate with any living creature as if they shared a language."}, {"name": "Innate Spellcasting", "desc": "The imperial dragon’s innate spellcasting ability is Charisma (spell save DC 18). It can innately cast the following spells, requiring no material components.\nAt will: fog cloud\n3/day each: control water, gust of wind, stinking cloud\n1/day each: cloudkill, control weather"}], "spell_list": [], "page_no": 117, "environments": [], "img_main": null, "document__slug": "tob2", "document__title": "Tome of Beasts 2", "document__license_url": "http://open5e.com/legal", "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-2-for-5th-edition/"}, {"slug": "adult-light-dragon", "desc": "", "name": "Adult Light Dragon", "size": "Huge", "type": "Dragon", "subtype": "", "group": null, "alignment": "neutral good", "armor_class": 17, "armor_desc": "natural armor", "hit_points": 212, "hit_dice": "17d12+102", "speed": {"fly": 80, "walk": 40}, "strength": 22, "dexterity": 10, "constitution": 23, "intelligence": 16, "wisdom": 18, "charisma": 17, "strength_save": null, "dexterity_save": 5, "constitution_save": 11, "intelligence_save": null, "wisdom_save": 9, "charisma_save": 8, "perception": 9, "skills": {"arcana": 8, "nature": 8, "perception": 9, "persuasion": 8, "religion": 8}, "damage_vulnerabilities": "", "damage_resistances": "fire; bludgeoning, piercing, and slashing from nonmagical attacks", "damage_immunities": "radiant", "condition_immunities": "blinded", "senses": "blindsight 60 ft., darkvision 120 ft., passive Perception 19", "languages": "Celestial, Draconic", "challenge_rating": "16", "cr": 16.0, "actions": [{"desc": "The dragon can use its Frightful Presence. It then makes three attacks: one with its bite and two with its claws.", "name": "Multiattack"}, {"attack_bonus": 11, "damage_dice": "2d10+6", "desc": "Melee Weapon Attack: +11 to hit, reach 10 ft., one target. Hit: 17 (2d10 + 6) piercing damage.", "name": "Bite"}, {"attack_bonus": 11, "damage_dice": "2d6+6", "desc": "Melee Weapon Attack: +11 to hit, reach 5 ft., one target. Hit: 13 (2d6 + 6) slashing damage.", "name": "Claw"}, {"attack_bonus": 11, "damage_dice": "2d8+6", "desc": "Melee Weapon Attack: +11 to hit, reach 15 ft., one target. Hit: 15 (2d8 + 6) bludgeoning damage.", "name": "Tail"}, {"desc": "Each creature of the dragon's choice that is within 120 feet of the dragon and aware of it must succeed on a DC 19 Wisdom saving throw or become frightened for 1 minute. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. If a creature's saving throw is successful or the effect ends for it, the creature is immune to the dragon's Frightful Presence for the next 24 hours.", "name": "Frightful Presence"}, {"desc": "The dragon uses one of the following breath weapons:\nRadiant Breath. The dragon exhales radiant energy in a 60-foot cone. Each creature in that area must make a DC 19 Dexterity saving throw, taking 55 (10d10) radiant damage on a failed save, or half as much damage on a successful one.\nFlaring Breath. The dragon emits a flash of dazzling light from its maw in a 60-foot cone. Each creature in that area must make a DC 19 Constitution saving throw or be blinded. Undead within the area of effect must also make a DC 19 Wisdom saving throw or be turned for 1 minute. Undead of CR 2 or lower who fail the saving throw are instantly destroyed.", "name": "Breath Weapon (Recharge 5-6)"}], "bonus_actions": null, "reactions": null, "legendary_desc": "The dragon can take 3 legendary actions, choosing from the options below. Only one legendary action option can be used at a time and only at the end of another creature's turn. The dragon regains spent legendary actions at the start of its turn.", "legendary_actions": [{"desc": "The dragon makes a Wisdom (Perception) check.", "name": "Detect"}, {"desc": "The dragon makes a tail attack.", "name": "Tail Attack"}, {"desc": "The dragon beats its wings. Each creature within 10 feet of the dragon must succeed on a DC 19 Dexterity saving throw or take 13 (2d6 + 6) bludgeoning damage and be knocked prone. The dragon can then fly up to half its flying speed.", "name": "Wing Attack (Costs 2 Actions)"}], "special_abilities": [{"desc": "The dragon can see 60 feet into the Ethereal Plane when it is on the Material Plane, and vice versa.", "name": "Ethereal Sight"}, {"desc": "The dragon sheds bright light in a 20-foot radius and dim light for an additional 20 feet.", "name": "Illumination"}, {"desc": "The dragon can move through other creatures and objects as if they were difficult terrain. It takes 5 (1d10) force damage if it ends its turn inside an object.", "name": "Incorporeal Movement"}, {"desc": "If the dragon fails a saving throw, it can choose to succeed instead.", "name": "Legendary Resistance (3/ Day)"}, {"desc": "The light dragon travels from star to star and does not require air, food, drink, or sleep. When flying between stars, the light dragon magically glides on solar winds, making the immense journey through the void in an impossibly short time.", "name": "Void Traveler"}], "spell_list": [], "page_no": 170, "environments": [], "img_main": null, "document__slug": "cc", "document__title": "Creature Codex", "document__license_url": "http://open5e.com/legal", "document__url": "https://koboldpress.com/kpstore/product/creature-codex-for-5th-edition-dnd/"}, {"slug": "adult-mithral-dragon", "desc": "_Mithral dragons are wise and learned, and are legendary peacemakers and spellcasters. They pursue their own interests when not called to settle disputes._  \n_**Glimmering Champions.**_ Light glints off a mithral dragon’s glossy scales, shining silver-white, and its tiny wings fold flush against its body—but open like a fan to expose shimmering, diaphanous membranes. Its narrow head, with bare slits for its eyes and nostrils, ends in a slender neck. The dragon’s sleek look continues into its body and a mithral dragon’s impossibly thin frame makes it look extremely fragile.  \n_**Rage in Youth.**_ Younger mithral dragons raid and pillage as heavily as any chromatic dragon, driven largely by greed to acquire a worthy hoard—though they are less likely to kill for sport or out of cruelty. In adulthood and old age, however, they are less concerned with material wealth and more inclined to value friendship, knowledge, and a peaceful life spent in pursuit of interesting goals.  \n_**Peacemakers.**_ Adult and older mithral dragons are diplomats and arbitrators by temperament (some dragons cynically call them referees), enjoying bringing some peace to warring factions. Among all dragons, their strict neutrality and ability to ignore many attacks make them particularly well suited to these vital roles.", "name": "Adult Mithral Dragon", "size": "Huge", "type": "Dragon", "subtype": "", "group": null, "alignment": "neutral", "armor_class": 18, "armor_desc": "natural armor", "hit_points": 184, "hit_dice": "16d12+80", "speed": {"walk": 40, "fly": 80}, "strength": 27, "dexterity": 18, "constitution": 21, "intelligence": 20, "wisdom": 21, "charisma": 20, "strength_save": null, "dexterity_save": 9, "constitution_save": 10, "intelligence_save": 10, "wisdom_save": 10, "charisma_save": 10, "perception": 10, "skills": {"athletics": 13, "history": 10, "insight": 10, "perception": 10, "persuasion": 10}, "damage_vulnerabilities": "", "damage_resistances": "bludgeoning, piercing, and slashing from nonmagical attacks", "damage_immunities": "acid, thunder", "condition_immunities": "charmed", "senses": "blindsight 60 ft., darkvision 120 ft., passive Perception 20", "languages": "Celestial, Common, Draconic, Primordial", "challenge_rating": "14", "cr": 14.0, "actions": [{"name": "Multiattack", "desc": "The dragon can use its Frightful Presence. It then makes three attacks: one with its bite and two with its claws."}, {"name": "Bite", "desc": "Melee Weapon Attack: +13 to hit, reach 10 ft., one target. Hit: 19 (2d10 + 8) piercing damage.", "attack_bonus": 13, "damage_dice": "2d10"}, {"name": "Claw", "desc": "Melee Weapon Attack: +13 to hit, reach 5 ft., one target. Hit: 15 (2d6 + 8) slashing damage, and the target loses 4 hit points from bleeding at the start of each of its turns for six rounds unless it receives magical healing. Bleeding damage is cumulative; the target loses 4 hp per round for each bleeding wound it's taken from a mithral dragon's claws.", "attack_bonus": 13, "damage_dice": "2d6"}, {"name": "Tail", "desc": "Melee Weapon Attack: +13 to hit, reach 15 ft., one target. Hit: 17 (2d8 + 8) bludgeoning damage.", "attack_bonus": 13, "damage_dice": "2d8"}, {"name": "Frightful Presence", "desc": "Each creature of the dragon's choice that is within 120 feet of the dragon and aware of it must succeed on a DC 18 Wisdom saving throw or become frightened for 1 minute. A creature can repeat the saving throw at the end of its turn, ending the effect on itself on a success. If a creature's saving throw is successful or the effect ends for it, the creature is immune to the dragon's Frightful Presence for the next 24 hours."}, {"name": "Breath Weapon (Recharge 5-6)", "desc": "A mithral dragon can spit a 60-foot-long, 5-foot-wide line of metallic shards. Targets in its path take 42 (12d6) magical slashing damage and lose another 8 hit points from bleeding at the start of their turns for 6 rounds; slashing and bleed damage are halved by a successful DC 18 Dexterity saving throw. Only magical healing stops the bleeding before 6 rounds. The shards dissolve into wisps of smoke 1 round after the breath weapon's use."}], "bonus_actions": null, "reactions": null, "legendary_desc": "The dragon can take 3 legendary actions, choosing from the options below. Only one legendary action option can be used at a time and only at the end of another creature's turn. The dragon regains spent legendary actions at the start of its turn.", "legendary_actions": [{"name": "Detect", "desc": "The dragon makes a Wisdom (Perception) check."}, {"name": "Tail Attack", "desc": "The dragon makes a tail attack."}, {"name": "Wing Attack (Costs 2 Actions)", "desc": "The dragon beats its wings. Each creature within 10 feet of the dragon must succeed on a DC 21 Dexterity saving throw or take 15 (2d6 + 8) bludgeoning damage and be knocked prone. The dragon can then fly up to half its flying speed."}], "special_abilities": [{"name": "Legendary Resistance (3/Day)", "desc": "If the dragon fails a saving throw, it can choose to succeed instead."}, {"name": "Innate Spellcasting", "desc": "the dragon's innate spellcasting ability is Intelligence (spell save DC 18, +10 to hit with spell attacks). It can innately cast the following spells, requiring no material components:\n\nat will: tongues\n\n5/day each: dispel magic, enhance ability"}, {"name": "Spellcasting", "desc": "the dragon is a 6th-level spellcaster. Its spellcasting ability is Intelligence (spell save DC 18, +10 to hit with spell attacks). It requires no material components to cast its spells. The dragon has the following wizard spells prepared:\n\ncantrips (at will): acid splash, light, mage hand, prestidigitation\n\n1st level (4 slots): charm person, expeditious retreat, magic missile, unseen servant\n\n2nd level (3 slots): blur, hold person, see invisibility\n\n3rd level (3 slots): haste, lightning bolt, protection from energy"}], "spell_list": [], "page_no": 133, "environments": [], "img_main": null, "document__slug": "tob", "document__title": "Tome of Beasts", "document__license_url": "http://open5e.com/legal", "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-for-5th-edition-print/"}, {"slug": "adult-red-dragon", "desc": "", "name": "Adult Red Dragon", "size": "Huge", "type": "Dragon", "subtype": "", "group": "Red Dragon", "alignment": "chaotic evil", "armor_class": 19, "armor_desc": "natural armor", "hit_points": 256, "hit_dice": "19d12+133", "speed": {"walk": 40, "climb": 40, "fly": 80}, "strength": 27, "dexterity": 10, "constitution": 25, "intelligence": 16, "wisdom": 13, "charisma": 21, "strength_save": null, "dexterity_save": 6, "constitution_save": 13, "intelligence_save": null, "wisdom_save": 7, "charisma_save": 11, "perception": 13, "skills": {"perception": 13, "stealth": 6}, "damage_vulnerabilities": "", "damage_resistances": "", "damage_immunities": "fire", "condition_immunities": "", "senses": "blindsight 60 ft., darkvision 120 ft., passive Perception 23", "languages": "Common, Draconic", "challenge_rating": "17", "cr": 17.0, "actions": [{"name": "Multiattack", "desc": "The dragon can use its Frightful Presence. It then makes three attacks: one with its bite and two with its claws."}, {"name": "Bite", "desc": "Melee Weapon Attack: +14 to hit, reach 10 ft., one target. Hit: 19 (2d10 + 8) piercing damage plus 7 (2d6) fire damage.", "attack_bonus": 14, "damage_dice": "2d10+2d6", "damage_bonus": 8}, {"name": "Claw", "desc": "Melee Weapon Attack: +14 to hit, reach 5 ft., one target. Hit: 15 (2d6 + 8) slashing damage.", "attack_bonus": 14, "damage_dice": "2d6", "damage_bonus": 8}, {"name": "Tail", "desc": "Melee Weapon Attack: +14 to hit, reach 15 ft., one target. Hit: 17 (2d8 + 8) bludgeoning damage.", "attack_bonus": 14, "damage_dice": "2d8", "damage_bonus": 8}, {"name": "Frightful Presence", "desc": "Each creature of the dragon's choice that is within 120 ft. of the dragon and aware of it must succeed on a DC 19 Wisdom saving throw or become frightened for 1 minute. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. If a creature's saving throw is successful or the effect ends for it, the creature is immune to the dragon's Frightful Presence for the next 24 hours."}, {"name": "Fire Breath (Recharge 5-6)", "desc": "The dragon exhales fire in a 60-foot cone. Each creature in that area must make a DC 21 Dexterity saving throw, taking 63 (18d6) fire damage on a failed save, or half as much damage on a successful one.", "attack_bonus": 0, "damage_dice": "18d6"}], "bonus_actions": null, "reactions": null, "legendary_desc": "The dragon can take 3 legendary actions, choosing from the options below. Only one legendary action option can be used at a time and only at the end of another creature's turn. The dragon regains spent legendary actions at the start of its turn.", "legendary_actions": [{"name": "Detect", "desc": "The dragon makes a Wisdom (Perception) check."}, {"name": "Tail Attack", "desc": "The dragon makes a tail attack."}, {"name": "Wing Attack (Costs 2 Actions)", "desc": "The dragon beats its wings. Each creature within 10 ft. of the dragon must succeed on a DC 22 Dexterity saving throw or take 15 (2d6 + 8) bludgeoning damage and be knocked prone. The dragon can then fly up to half its flying speed."}], "special_abilities": [{"name": "Legendary Resistance (3/Day)", "desc": "If the dragon fails a saving throw, it can choose to succeed instead."}], "spell_list": [], "page_no": 287, "environments": ["Hill", "Mountains", "Mountain"], "img_main": null, "document__slug": "wotc-srd", "document__title": "5e Core Rules", "document__license_url": "http://open5e.com/legal", "document__url": "http://dnd.wizards.com/articles/features/systems-reference-document-srd"}, {"slug": "adult-red-dragon-a5e", "desc": "", "name": "Adult Red Dragon", "size": "Huge", "type": "Dragon", "subtype": "", "group": null, "alignment": "", "armor_class": 19, "armor_desc": "", "hit_points": 310, "hit_dice": "23d12+161", "speed": {"walk": 40, "climb": 40, "fly": 80}, "strength": 26, "dexterity": 10, "constitution": 24, "intelligence": 16, "wisdom": 14, "charisma": 20, "strength_save": null, "dexterity_save": 6, "constitution_save": 13, "intelligence_save": null, "wisdom_save": 8, "charisma_save": 11, "perception": null, "skills": {"intimidation": 11, "perception": 9, "stealth": 6}, "damage_vulnerabilities": "", "damage_resistances": "", "damage_immunities": "fire", "condition_immunities": "", "senses": "blindsight 60 ft., darkvision 120 ft., passive Perception 22", "languages": "Common, Draconic, one more", "challenge_rating": "20", "cr": 20.0, "actions": [{"name": "Multiattack", "desc": "The dragon attacks once with its bite and twice with its claws. In place of its bite attack  it can Spit Fire."}, {"name": "Bite", "desc": "Melee Weapon Attack: +14 to hit, reach 10 ft., one target. Hit: 24 (3d10 + 8) piercing damage plus 4 (1d8) fire damage."}, {"name": "Claw", "desc": "Melee Weapon Attack: +14 to hit, reach 5 ft., one target. Hit: 21 (3d8 + 8) slashing damage."}, {"name": "Tail", "desc": "Melee Weapon Attack: +14 to hit, reach 15 ft., one target. Hit: 17 (2d8 + 8) bludgeoning damage  and the dragon pushes the target 10 feet away."}, {"name": "Cruel Tyranny", "desc": "The dragon snarls and threatens its minions  driving them to immediate action. The dragon chooses one creature it can see and that can hear the dragon. The creature uses its reaction to make one weapon attack with advantage."}, {"name": "Spit Fire", "desc": "The dragon targets a creature within 60 feet  forcing it to make a DC 21 Dexterity saving throw. The creature takes 22 (4d10) fire damage on a failure or half damage on a success. A creature that fails the save also takes 5 (1d10) ongoing fire damage. A creature can use an action to end the ongoing damage."}, {"name": "Fire Breath (Recharge 5-6)", "desc": "The dragon exhales a blast of fire in a 60-foot cone. Each creature in that area makes a DC 21 Dexterity saving throw  taking 73 (21d6) fire damage on a failed save or half damage on a success. A creature that fails the saving throw also takes 5 (1d10) ongoing fire damage. While affected by this ongoing damage  it is frightened of the dragon. A creature can use an action to end the ongoing damage."}], "bonus_actions": null, "reactions": [{"name": "Tail Attack", "desc": "When a creature the dragon can see within 10 feet hits the dragon with a melee attack, the dragon makes a tail attack against it."}], "legendary_desc": "", "legendary_actions": [{"name": "The dragon can take 3 legendary actions", "desc": "Only one legendary action can be used at a time and only at the end of another creatures turn. It regains spent legendary actions at the start of its turn."}, {"name": "Cruel Tyranny", "desc": "The dragon uses its Cruel Tyranny action."}, {"name": "Roar", "desc": "Each creature of the dragons choice within 120 feet that can hear it makes a DC 19 Charisma saving throw. On a failure, it is frightened for 1 minute. A creature repeats the saving throw at the end of its turns, ending the effect on itself on a success. When it succeeds on a saving throw or the effect ends for it, it is immune to Roar for 24 hours."}, {"name": "Wing Attack", "desc": "The dragon beats its wings. Each creature within 15 feet makes a DC 21 Dexterity saving throw. On a failure, it is pushed 10 feet away and knocked prone. The dragon can then fly up to half its fly speed."}], "special_abilities": [{"name": "Legendary Resistance (3/Day)", "desc": "When the dragon fails a saving throw, it can choose to succeed instead. When it does, it sheds some of its scales, which turn to sand. If it has no more uses of this ability, its Armor Class is reduced to 17 until it finishes a long rest."}, {"name": "Searing Heat", "desc": "A creature that touches the dragon or hits it with a melee attack for the first time on a turn takes 7 (2d6) fire damage."}, {"name": "Volcanic Tyrant", "desc": "The dragon is immune to the effects of poisonous gases caused by volcanic environments. It also ignores difficult terrain caused by lava."}, {"name": "Innate Spellcasting", "desc": "The dragons spellcasting ability is Charisma (save DC 19). It can innately cast the following spells, requiring no material components. 3/day each:command, hold person, glyph of warding, wall of fire"}], "spell_list": [], "page_no": 118, "environments": [], "img_main": null, "document__slug": "menagerie", "document__title": "Level Up Advanced 5e Monstrous Menagerie", "document__license_url": "http://open5e.com/legal", "document__url": "https://www.levelup5e.com"}, {"slug": "adult-river-dragon-a5e", "desc": "", "name": "Adult River Dragon", "size": "Huge", "type": "Dragon", "subtype": "", "group": null, "alignment": "", "armor_class": 18, "armor_desc": "", "hit_points": 252, "hit_dice": "24d12+96", "speed": {"walk": 60, "fly": 80, "swim": 90}, "strength": 18, "dexterity": 20, "constitution": 18, "intelligence": 14, "wisdom": 20, "charisma": 16, "strength_save": null, "dexterity_save": 9, "constitution_save": 8, "intelligence_save": 6, "wisdom_save": 9, "charisma_save": 7, "perception": null, "skills": {"acrobatics": 8, "deception": 7, "insight": 9, "nature": 6, "perception": 9, "stealth": 9}, "damage_vulnerabilities": "", "damage_resistances": "damage from nonmagical weapons", "damage_immunities": "", "condition_immunities": "fatigue", "senses": "darkvision 120 ft., tremorsense 200 ft. (only detects vibrations in water), passive Perception 19", "languages": "Aquan, Common, Draconic", "challenge_rating": "17", "cr": 17.0, "actions": [{"name": "Multiattack", "desc": "The dragon attacks once with its bite and twice with its claws."}, {"name": "Bite", "desc": "Melee Weapon Attack: +11 to hit, reach 10 ft., one target. Hit: 21 (3d10 + 5) piercing damage."}, {"name": "Claws", "desc": "Melee Weapon Attack: +11 to hit, reach 5 ft., one target. Hit: 18 (3d8 + 5) slashing damage."}, {"name": "Torrential Breath (Recharge 5-6)", "desc": "The dragon exhales water in a 60-foot-long  5-foot-wide line. Each creature in the area makes a DC 18 Dexterity saving throw  taking 56 (16d6) bludgeoning damage on a failed save or half damage on a success. A creature that fails the save is also knocked prone and is pushed up to 30 feet away. A creature that impacts a solid object takes an extra 10 (3d6) bludgeoning damage."}], "bonus_actions": [{"name": "Whirlpool", "desc": "A cylindrical, 15-foot-tall, 10-foot-radius whirlpool or waterspout magically appears in the water or air, centered on a point within 60 feet. Creatures in the area make a DC 18 Strength saving throw. On a failure, a creature takes 17 (5d6) bludgeoning damage and is knocked prone and pushed up to 15 feet. On a failure, a creature takes half damage."}], "reactions": [{"name": "Snap Back (While Bloodied)", "desc": "When a creature the dragon can see hits it with a melee weapon attack, the dragon makes a bite attack against the attacker."}], "legendary_desc": "", "legendary_actions": [{"name": "The dragon can take 3 legendary actions", "desc": "Only one legendary action can be used at a time and only at the end of another creatures turn. It regains spent legendary actions at the start of its turn."}, {"name": "Dart Away", "desc": "The dragon swims up to half its speed."}, {"name": "Lurk", "desc": "The dragon takes the Hide action."}, {"name": "River Surge (Costs 2 Actions)", "desc": "The dragon generates a 20-foot-tall, 100-foot-wide wave on the surface of water within 90 feet. The wave travels up to 45 feet in any direction the dragon chooses and crashes down, carrying Huge or smaller creatures and vehicles with it. Vehicles moved in this way have a 25 percent chance of capsizing and creatures that impact a solid object take 21 (6d6) bludgeoning damage."}, {"name": "Sudden Maelstrom (While Bloodied", "desc": "The dragon magically surrounds itself with a 60-foot-radius maelstrom of surging wind and rain for 1 minute. A creature other than the dragon that starts its turn in the maelstrom or enters it for the first time on a turn makes a DC 18 Strength saving throw. On a failed save, the creature is knocked prone and pushed 15 feet away from the dragon."}], "special_abilities": [{"name": "Amphibious", "desc": "The dragon can breathe air and water."}, {"name": "Flowing Grace", "desc": "The dragon doesnt provoke opportunity attacks when it flies or swims out of an enemys reach."}, {"name": "Legendary Resistance (3/Day)", "desc": "When the dragon fails a saving throw, it can choose to succeed instead. When it does, it loses coordination as white-crested waves run up and down its body. It loses its Flowing Grace and Shimmering Scales traits until the beginning of its next turn."}, {"name": "Shimmering Scales", "desc": "While in water, the dragon gains three-quarters cover from attacks made by creatures more than 30 feet away."}, {"name": "Essence Link", "desc": "The essence dragon is spiritually linked to a specific area or landmark. The dragon gains no benefit from a long rest when more than 1 mile away from its linked area. If the dragon dies, the area it is linked to loses its vital essence until it forms a new essence dragon, which can take centuries. When a creature first enters an area that has lost its vital essence in this way, they gain a level of fatigue and a level of strife. This fatigue and strife can be removed only by completing a long rest outside the area."}, {"name": "Innate Spellcasting", "desc": "The dragons spellcasting ability is Charisma (save DC 15). It can innately cast the following spells, requiring no material components. 3/day each:create or destroy water, fog cloud, control water, freedom of movement"}], "spell_list": [], "page_no": 132, "environments": [], "img_main": null, "document__slug": "menagerie", "document__title": "Level Up Advanced 5e Monstrous Menagerie", "document__license_url": "http://open5e.com/legal", "document__url": "https://www.levelup5e.com"}, {"slug": "adult-sapphire-dragon-a5e", "desc": "", "name": "Adult Sapphire Dragon", "size": "Huge", "type": "Dragon", "subtype": "", "group": null, "alignment": "", "armor_class": 19, "armor_desc": "", "hit_points": 304, "hit_dice": "29d12+116", "speed": {"walk": 40, "burrow": 30, "fly": 80}, "strength": 22, "dexterity": 22, "constitution": 18, "intelligence": 22, "wisdom": 20, "charisma": 16, "strength_save": null, "dexterity_save": null, "constitution_save": 10, "intelligence_save": 12, "wisdom_save": 11, "charisma_save": 10, "perception": null, "skills": {"arcana": 12, "deception": 10, "history": 12, "insight": 11, "perception": 11, "persuasion": 10}, "damage_vulnerabilities": "", "damage_resistances": "", "damage_immunities": "psychic", "condition_immunities": "fatigue", "senses": "darkvision 120 ft., passive Perception 24", "languages": "Common, Deep Speech, Draconic, Undercommon, telepathy 120 ft.", "challenge_rating": "19", "cr": 19.0, "actions": [{"name": "Multiattack", "desc": "The dragon attacks once with its bite and twice with its claws. In place of its bite  it can use Psionic Wave."}, {"name": "Bite", "desc": "Melee Weapon Attack: +12 to hit, reach 10 ft., one target. Hit: 22 (3d10 + 6) piercing damage plus 4 (1d8) psychic damage."}, {"name": "Claws", "desc": "Melee Weapon Attack: +12 to hit, reach 5 ft., one target. Hit: 19 (3d8 + 6) slashing damage."}, {"name": "Psionic Wave", "desc": "The dragon psionically emits a wave of crushing mental pressure. Each creature within 20 feet makes a DC 18 Wisdom saving throw  taking 16 (3d10) psychic damage on a failed save or half damage on a success. Creatures suffering ongoing psychic damage make this saving throw with disadvantage."}, {"name": "Discognitive Breath (Recharge 5-6)", "desc": "The dragon unleashes psychic energy in a 60-foot cone. Each creature in that area makes a DC 18 Intelligence saving throw  taking 60 (11d10) psychic damage and 11 (2d10) ongoing psychic damage on a failed save or half as much psychic damage and no ongoing psychic damage on a success. The ongoing damage ends if a creature falls unconscious. A creature can also use an action to ground itself in reality  ending the ongoing damage."}, {"name": "Prognosticate (3/Day)", "desc": "The dragon psionically makes a prediction of an event up to 100 years in the future. This prediction has a 67 percent chance of being perfectly accurate and a 33 percent chance of being partially or wholly wrong. Alternatively  the dragon can choose to gain truesight to a range of 90 feet for 1 minute."}], "bonus_actions": null, "reactions": null, "legendary_desc": "", "legendary_actions": [{"name": "The dragon can take 3 legendary actions", "desc": "Only one legendary action can be used at a time and only at the end of another creatures turn. It regains spent legendary actions at the start of its turn."}, {"name": "Foretell", "desc": "The dragon psionically catches a glimpse of a fast-approaching moment and plans accordingly. The dragon rolls a d20 and records the number rolled. Until the end of the dragons next turn, the dragon can replace the result of any d20 rolled by it or a creature within 120 feet with the foretold number. Each foretold roll can be used only once."}, {"name": "Psionic Wave (Costs 2 Actions)", "desc": "The dragon uses Psionic Wave."}, {"name": "Shatter Mind (Costs 2 Actions)", "desc": "The dragon targets a creature within 60 feet, forcing it to make a DC 23 Intelligence saving throw. On a failure, the creature takes 22 (4d10) ongoing psychic damage. An affected creature repeats the saving throw at the end of each of its turns, ending the ongoing psychic damage on a success. A creature can also use an action to ground itself in reality, ending the ongoing damage."}], "special_abilities": [{"name": "Legendary Resistance (3/Day)", "desc": "When the dragon fails a saving throw, it can choose to succeed instead. When it does, its eyes dull as it briefly loses its connection to the future. Until the end of its next turn, it can't use Foretell, Prognosticate, or Prophesy Doom, and it loses its Predictive Harmonics trait."}, {"name": "Predictive Harmonics", "desc": "The dragon is psionically aware of its own immediate future. The dragon cannot be surprised, and any time the dragon would make a roll with disadvantage, it makes that roll normally instead."}, {"name": "Psionic Powers", "desc": "The dragons psionic abilities are considered both magical and psionic."}, {"name": "Far Thoughts", "desc": "The dragon is aware of any creature that uses a psionic ability or communicates telepathically within 100 miles of it. As an action, the dragon can psionically observe a creature, object, or location it is familiar with within 100 miles. While observing a subject in this way, the dragon can see, hear, and communicate telepathically, but it is blind and deaf in regard to its physical senses and does not require food or water. The dragon can psionically observe a subject indefinitely and can end this effect and return to its own senses as an action."}, {"name": "Innate Spellcasting", "desc": "The dragons spellcasting ability is Charisma (save DC 18). It can innately cast the following spells, requiring no material components. 3/day each:comprehend languages, detect thoughts, telekinesis, wall of force"}], "spell_list": [], "page_no": 150, "environments": [], "img_main": null, "document__slug": "menagerie", "document__title": "Level Up Advanced 5e Monstrous Menagerie", "document__license_url": "http://open5e.com/legal", "document__url": "https://www.levelup5e.com"}, {"slug": "adult-sea-dragon", "desc": "_This aquamarine dragon has a shark’s head that tapers off into a sleek eel-like body. Its large fins double as wings._  \n**Divine Dragons.** Sea dragons are the children of the ocean, and believe they are semi-divine beings, worthy of worship. Given their size and power, they may be right; certainly, they are often companions or steeds to gods of the sea.  \nDespite the solemn duties the sea dragons invoke thanks to their lineage, they are extremely whimsical. While these immense creatures are playful, their games can shatter hulls and drown sailors. The sea dragons course through the waves with tangible joy as they hunt whales and entire schools of tuna.  \n**Shipwreck Art.** Sea dragons love collecting treasure, especially prize the sunken treasure-filled hulls of ships lost to storm, battle, or their own handiwork. While they appreciate all wealth, they prefer hardy items that can stand up to long exposure to sea water. Precious metals and gemstones add a dramatic luster to the dragon’s lair when they catch stray beams of light. Sea dragons take any more perishable treasures and place them on a reef-altar, to dissolve in the sea as a tithe to the sea gods.  \n**Sunken Memorials.** A sea dragon’s lair is littered with meticulously arranged ships consigned to the deeps. These wrecks are often artfully smashed to allow the treasures in the hold to spill out onto the sea floor. It may seem haphazard, but it displays a complex aesthetic that only other sea dragons can truly appreciate. Because they arrange these wrecks so carefully, a dragon notices immediately if its hoard is disturbed.  \n\n## Sea Dragon’s Lair\n\n  \nSea dragons dwell in lairs dwell in lairs beneath the waves: ocean fissures and caves, lightless trenches full of strange rock formations, and sheltered reefs of cultivated coral.  \nWhatever the place, it’s dedicated to the worship of sea gods. Despite the draconic instinct for seclusion and protection when choosing a lair, sea dragons always choose lairs relatively close to humanoid trade routes and abundant supplies of fish.  \nThe sky surrounding a sea dragon’s lair is perpetually stormy, and the seas run high. If a captain is courageous, these high winds and swift-running currents can cut significant time off a voyage.  \n\n### Lair Actions\n\n  \nOn initiative count 20 (losing initiative ties), the dragon takes a lair action and generates one of the following effects. The dragon can’t use the same effect two rounds in a row:\n* Four vortexes, each 5 feet in diameter and up to 30 feet tall, appear within the lair where the dragon wishes. Creatures occupying the space where a vortex appears or who enter the vortex for the first time on a turn must make a DC 15 Dexterity save or be restrained. As an action, a creature can free itself or another creature from a vortex by succeeding on a DC 15 Strength check. The vortexes last until the dragon uses this lair action again or until the dragon dies.\n* The dragon creates a wall of living coral on a solid surface it can see within 120 feet of it. The wall can be up to 30 feet long, 30 feet high, and 1 foot thick. When the wall appears, each creature within its area takes damage as if touching the wall and is pushed 5 feet out of the wall’s space, on whichever side of the wall it wants. Touching the wall releases painful stings that deal 18 (4d8) poison damage, or half that with a successful DC 15 Constitution saving throw. Each 10-foot section of the wall has AC 5, 30 hit points, resistance to fire damage, and immunity to psychic damage. The wall lasts until the dragon uses this lair action again or until the dragon dies.\n* The dragon bends time around its enemies. Four creatures the dragon can see within 120 feet of it must succeed on a DC 15 Wisdom save or be affected by a slow spell. This effect last until initiative count 20 on the following round.\n  \n### Regional Effects\n\n  \nThe region containing a legendary sea dragon’s lair is warped by the dragon’s magic, which creates one or more of the following effects:\n* Sea life becomes richer within 6 miles of the lair. Schools of fish move into new waters, sharks become common, and whale migration paths shift to pass near the area.\n* Water temperatures drop sharply within 6 miles of the lair. Creatures not accustomed to cold suffer exposure to extreme cold while swimming in this water.\n* Storms and rough water are more common within 6 miles of the lair.\n  \nIf the dragon dies, conditions of the sea surrounding the lair return to normal over the course of 1d10 days.", "name": "Adult Sea Dragon", "size": "Huge", "type": "Dragon", "subtype": "", "group": null, "alignment": "neutral evil", "armor_class": 19, "armor_desc": "natural armor", "hit_points": 225, "hit_dice": "18d12+108", "speed": {"walk": 40, "fly": 80, "swim": 60}, "strength": 25, "dexterity": 10, "constitution": 23, "intelligence": 17, "wisdom": 15, "charisma": 19, "strength_save": null, "dexterity_save": 5, "constitution_save": 11, "intelligence_save": null, "wisdom_save": 7, "charisma_save": 9, "perception": 12, "skills": {"perception": 12, "stealth": 5}, "damage_vulnerabilities": "", "damage_resistances": "", "damage_immunities": "cold", "condition_immunities": "", "senses": "blindsight 60ft, darkvision 120ft, passive Perception 22", "languages": "Common, Draconic", "challenge_rating": "16", "cr": 16.0, "actions": [{"name": "Multiattack", "desc": "The dragon can use its Frightful Presence. It then makes three attacks: one with its bite and two with its claws."}, {"name": "Bite", "desc": "Melee Weapon Attack: +12 to hit, reach 10 ft., one target. Hit: 18 (2d10 + 7) piercing damage plus 5 (1d10) cold damage.", "attack_bonus": 12, "damage_dice": "2d10"}, {"name": "Claw", "desc": "Melee Weapon Attack: +12 to hit, reach 5 ft., one target. Hit: 14 (2d6 + 7) slashing damage.", "attack_bonus": 12, "damage_dice": "2d6"}, {"name": "Tail", "desc": "Melee Weapon Attack: +12 to hit, reach 15 ft., one target. Hit: 16 (2d8 + 7) bludgeoning damage.", "attack_bonus": 12, "damage_dice": "2d8"}, {"name": "Frightful Presence", "desc": "Each creature of the dragon's choice that is within 120 feet of the dragon and aware of it must succeed on a DC 17 Wisdom saving throw or become frightened for 1 minute. A creature repeats the saving throw at the end of each of its turns, ending the effect on itself on a success. If a creature's saving throw is successful or the effect ends for it, the creature is immune to the dragon's Frightful Presence for the next 24 hours."}, {"name": "Tidal Breath (Recharge 5-6)", "desc": "The dragon exhales a crushing wave of frigid seawater in a 60-foot cone. Each creature in that area must make a DC 19 Dexterity saving throw. On a failure, the target takes 33 (6d10) bludgeoning damage and 33 (6d10) cold damage, and is pushed 30 feet away from the dragon and knocked prone. On a successful save the creature takes half as much damage and isn't pushed or knocked prone."}], "bonus_actions": null, "reactions": null, "legendary_desc": "The dragon can take 3 legendary actions, choosing from the options below. Only one legendary action option can be used at a time and only at the end of another creature's turn. The dragon regains spent legendary actions at the start of its turn.", "legendary_actions": [{"name": "Detect", "desc": "The dragon makes a Wisdom (Perception) check."}, {"name": "Tail Attack", "desc": "The dragon makes a tail attack."}, {"name": "Wing Attack (Costs 2 Actions)", "desc": "The dragon beats its wings. Each creature within 15 feet of the dragon must succeed on a DC 20 Dexterity saving throw or take 14 (2d6 + 7) bludgeoning damage and be knocked prone. The dragon can then move up to half its flying speed, or half its swim speed if in the water."}], "special_abilities": [{"name": "Amphibious", "desc": "The dragon can breathe air and water."}, {"name": "Legendary Resistance (3/Day)", "desc": "If the dragon fails a saving throw, it can choose to succeed instead."}, {"name": "Siege Monster", "desc": "The dragon deals double damage to objects and structures."}], "spell_list": [], "page_no": 135, "environments": [], "img_main": null, "document__slug": "tob", "document__title": "Tome of Beasts", "document__license_url": "http://open5e.com/legal", "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-for-5th-edition-print/"}, {"slug": "adult-shadow-dragon-a5e", "desc": "", "name": "Adult Shadow Dragon", "size": "Huge", "type": "Dragon", "subtype": "", "group": null, "alignment": "", "armor_class": 18, "armor_desc": "", "hit_points": 212, "hit_dice": "17d12+102", "speed": {"walk": 40, "climb": 40, "fly": 80, "swim": 40}, "strength": 22, "dexterity": 14, "constitution": 22, "intelligence": 14, "wisdom": 14, "charisma": 23, "strength_save": null, "dexterity_save": 8, "constitution_save": 12, "intelligence_save": 8, "wisdom_save": 8, "charisma_save": null, "perception": null, "skills": {"deception": 12, "insight": 8, "nature": 8, "perception": 8, "stealth": 8}, "damage_vulnerabilities": "", "damage_resistances": "acid, cold, fire, lightning, thunder; damage from nonmagical weapons", "damage_immunities": "necrotic, poison", "condition_immunities": "fatigue, frightened, grappled, paralyzed, poisoned, prone, restrained", "senses": "darkvision 240 ft., passive Perception 18", "languages": "Common, Draconic", "challenge_rating": "19", "cr": 19.0, "actions": [{"name": "Multiattack", "desc": "The dragon uses Grasp of Shadows  then attacks once with its bite and twice with its claws."}, {"name": "Bite", "desc": "Melee Weapon Attack: +12 to hit, reach 10 ft., one target. Hit: 22 (3d10 + 6) piercing damage plus 4 (1d8) necrotic damage."}, {"name": "Claws", "desc": "Melee Weapon Attack: +12 to hit, reach 5 ft., one target. Hit: 19 (3d8 + 6) slashing damage plus 4 (1d8) necrotic damage."}, {"name": "Grasp of Shadows", "desc": "The dragon targets a creature within 60 feet  forcing it to make a DC 16 Dexterity saving throw. On a failure  it is grappled by tendrils of shadow (escape DC 20) and restrained while grappled this way. The effect ends if the dragon is incapacitated or uses this ability again."}, {"name": "Anguished Breath (Recharge 5-6)", "desc": "The dragon exhales a shadowy maelstrom of anguish in a 60-foot cone. Each creature in that area makes a DC 20 Wisdom saving throw  taking 67 (15d8) necrotic damage and gaining a level of strife on a failed save or half damage on a success."}], "bonus_actions": null, "reactions": null, "legendary_desc": "", "legendary_actions": [{"name": "The dragon can take 3 legendary actions", "desc": "Only one legendary action can be used at a time and only at the end of another creatures turn. It regains spent legendary actions at the start of its turn."}, {"name": "Corrupting Presence", "desc": "Each creature of the dragons choice within 120 feet and aware of it must succeed on a DC 16 Wisdom saving throw or gain a level of strife. Once a creature has passed or failed this saving throw, it is immune to the dragons Corrupting Presence for the next 24 hours."}, {"name": "Lurk", "desc": "If the dragon is in dim light or darkness, it magically becomes invisible until it attacks, causes a creature to make a saving throw, or enters an area of bright light. It can't use this ability if it has taken radiant damage since the end of its last turn."}, {"name": "Slip Through Shadows", "desc": "If the dragon is in dim light or darkness, it magically teleports up to 45 feet to an unoccupied space that is also in dim light or darkness. The dragon can't use this ability if it has taken radiant damage since the end of its last turn."}, {"name": "Horrid Whispers (Costs 2 Actions)", "desc": "A creature that can hear the dragon makes a DC 21 Wisdom saving throw. On a failure, the creature takes 13 (3d8) psychic damage, and the dragon regains the same number of hit points."}], "special_abilities": [{"name": "Evil", "desc": "The dragon radiates an Evil aura."}, {"name": "Incorporeal Movement", "desc": "The dragon can move through other creatures and objects. It takes 11 (2d10) force damage if it ends its turn inside an object."}, {"name": "Legendary Resistance (3/Day)", "desc": "When the dragon fails a saving throw, it can choose to succeed instead. When it does, it becomes more solid, losing its Incorporeal trait and its damage resistances, until the end of its next turn."}, {"name": "Essence Link", "desc": "The essence dragon is spiritually linked to a specific area or landmark. The dragon gains no benefit from a long rest when more than 1 mile away from its linked area. If the dragon dies, the area it is linked to loses its vital essence until it forms a new essence dragon, which can take centuries. When a creature first enters an area that has lost its vital essence in this way, they gain a level of fatigue and a level of strife. This fatigue and strife can be removed only by completing a long rest outside the area."}, {"name": "Innate Spellcasting", "desc": "The dragons spellcasting ability is Charisma (save DC 20). It can innately cast the following spells, requiring no material components. 3/day each:darkness, detect evil and good, bane, create undead"}], "spell_list": [], "page_no": 136, "environments": [], "img_main": null, "document__slug": "menagerie", "document__title": "Level Up Advanced 5e Monstrous Menagerie", "document__license_url": "http://open5e.com/legal", "document__url": "https://www.levelup5e.com"}, {"slug": "adult-silver-dragon", "desc": "", "name": "Adult Silver Dragon", "size": "Huge", "type": "Dragon", "subtype": "", "group": "Silver Dragon", "alignment": "lawful good", "armor_class": 19, "armor_desc": "natural armor", "hit_points": 243, "hit_dice": "18d12+126", "speed": {"walk": 40, "fly": 80}, "strength": 27, "dexterity": 10, "constitution": 25, "intelligence": 16, "wisdom": 13, "charisma": 21, "strength_save": null, "dexterity_save": 5, "constitution_save": 12, "intelligence_save": null, "wisdom_save": 6, "charisma_save": 10, "perception": 11, "skills": {"arcana": 8, "history": 8, "perception": 11, "stealth": 5}, "damage_vulnerabilities": "", "damage_resistances": "", "damage_immunities": "cold", "condition_immunities": "", "senses": "blindsight 60 ft., darkvision 120 ft., passive Perception 21", "languages": "Common, Draconic", "challenge_rating": "16", "cr": 16.0, "actions": [{"name": "Multiattack", "desc": "The dragon can use its Frightful Presence. It then makes three attacks: one with its bite and two with its claws."}, {"name": "Bite", "desc": "Melee Weapon Attack: +13 to hit, reach 10 ft., one target. Hit: 19 (2d10 + 8) piercing damage.", "attack_bonus": 13, "damage_dice": "2d10", "damage_bonus": 8}, {"name": "Claw", "desc": "Melee Weapon Attack: +13 to hit, reach 5 ft., one target. Hit: 15 (2d6 + 8) slashing damage.", "attack_bonus": 13, "damage_dice": "2d6", "damage_bonus": 8}, {"name": "Tail", "desc": "Melee Weapon Attack: +13 to hit, reach 15 ft., one target. Hit: 17 (2d8 + 8) bludgeoning damage.", "attack_bonus": 13, "damage_dice": "2d8", "damage_bonus": 8}, {"name": "Frightful Presence", "desc": "Each creature of the dragon's choice that is within 120 feet of the dragon and aware of it must succeed on a DC 18 Wisdom saving throw or become frightened for 1 minute. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. If a creature's saving throw is successful or the effect ends for it, the creature is immune to the dragon's Frightful Presence for the next 24 hours."}, {"name": "Breath Weapons (Recharge 5-6)", "desc": "The dragon uses one of the following breath weapons.\n**Cold Breath.** The dragon exhales an icy blast in a 60-foot cone. Each creature in that area must make a DC 20 Constitution saving throw, taking 58 (13d8) cold damage on a failed save, or half as much damage on a successful one.\n**Paralyzing Breath.** The dragon exhales paralyzing gas in a 60-foot cone. Each creature in that area must succeed on a DC 20 Constitution saving throw or be paralyzed for 1 minute. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success.", "attack_bonus": 0, "damage_dice": "13d8"}, {"name": "Change Shape", "desc": "The dragon magically polymorphs into a humanoid or beast that has a challenge rating no higher than its own, or back into its true form. It reverts to its true form if it dies. Any equipment it is wearing or carrying is absorbed or borne by the new form (the dragon's choice).\nIn a new form, the dragon retains its alignment, hit points, Hit Dice, ability to speak, proficiencies, Legendary Resistance, lair actions, and Intelligence, Wisdom, and Charisma scores, as well as this action. Its statistics and capabilities are otherwise replaced by those of the new form, except any class features or legendary actions of that form."}], "bonus_actions": null, "reactions": null, "legendary_desc": "The dragon can take 3 legendary actions, choosing from the options below. Only one legendary action option can be used at a time and only at the end of another creature's turn. The dragon regains spent legendary actions at the start of its turn.", "legendary_actions": [{"name": "Detect", "desc": "The dragon makes a Wisdom (Perception) check."}, {"name": "Tail Attack", "desc": "The dragon makes a tail attack."}, {"name": "Wing Attack (Costs 2 Actions)", "desc": "The dragon beats its wings. Each creature within 10 ft. of the dragon must succeed on a DC 22 Dexterity saving throw or take 15 (2d6 + 8) bludgeoning damage and be knocked prone. The dragon can then fly up to half its flying speed."}], "special_abilities": [{"name": "Legendary Resistance (3/Day)", "desc": "If the dragon fails a saving throw, it can choose to succeed instead."}], "spell_list": [], "page_no": 302, "environments": ["Urban", "Feywild", "Mountains", "Mountain"], "img_main": null, "document__slug": "wotc-srd", "document__title": "5e Core Rules", "document__license_url": "http://open5e.com/legal", "document__url": "http://dnd.wizards.com/articles/features/systems-reference-document-srd"}, {"slug": "adult-silver-dragon-a5e", "desc": "", "name": "Adult Silver Dragon", "size": "Huge", "type": "Dragon", "subtype": "", "group": null, "alignment": "", "armor_class": 19, "armor_desc": "", "hit_points": 283, "hit_dice": "21d12+147", "speed": {"walk": 40, "fly": 80}, "strength": 24, "dexterity": 14, "constitution": 24, "intelligence": 16, "wisdom": 12, "charisma": 20, "strength_save": null, "dexterity_save": 8, "constitution_save": 13, "intelligence_save": null, "wisdom_save": 7, "charisma_save": 11, "perception": null, "skills": {"arcana": 9, "history": 9, "perception": 7, "stealth": 8}, "damage_vulnerabilities": "", "damage_resistances": "", "damage_immunities": "cold", "condition_immunities": "", "senses": "blindsight 60 ft., darkvision 120 ft., passive Perception 20", "languages": "Common, Draconic, one more", "challenge_rating": "19", "cr": 19.0, "actions": [{"name": "Multiattack", "desc": "The dragon attacks with its bite and twice with its claws. In place of its bite  it can use Spit Frost."}, {"name": "Bite", "desc": "Melee Weapon Attack: +13 to hit, reach 10 ft., one target. Hit: 23 (3d10 + 7) piercing damage plus 4 (1d8) cold damage."}, {"name": "Claws", "desc": "Melee Weapon Attack: +13 to hit, reach 5 ft., one target. Hit: 20 (3d8 + 7) slashing damage."}, {"name": "Tail", "desc": "Melee Weapon Attack: +13 to hit, reach 15 ft., one target. Hit: 16 (2d8 + 7) bludgeoning damage  and the dragon pushes the target 10 feet away."}, {"name": "Rapier (Humanoid Form Only)", "desc": "Melee Weapon Attack: +13 to hit, reach 5 ft., one target. Hit: 11 (1d8 + 7) piercing damage."}, {"name": "Spit Frost", "desc": "The creature targets one creature within 60 feet  forcing it to make a DC 21 Constitution saving throw. The creature takes 16 (3d10) cold damage on a failure or half damage on a success. On a failure  the creatures Speed is also halved until the end of its next turn. Flying creatures immediately fall unless they are magically kept aloft."}, {"name": "Breath Weapons (Recharge 5-6)", "desc": "The dragon uses one of the following breath weapons:"}, {"name": "Frost Breath", "desc": "The dragon exhales freezing wind in a 60-foot cone. Each creature in the area makes a DC 21 Constitution saving throw  taking 72 (16d8) cold damage on a failed save or half damage on a success. On a failure  the creature is also slowed until the end of its next turn."}, {"name": "Paralyzing Breath", "desc": "The dragon exhales paralytic gas in a 60-foot cone. Each creature in the area must succeed on a DC 20 Constitution saving throw or be paralyzed until the end of its next turn."}, {"name": "Change Shape", "desc": "The dragon magically takes the shape of a humanoid or beast  or changes back into its true form. It reverts to its true form if it dies. Any equipment it is wearing or carrying is absorbed or borne by the new form (dragons choice). In the new form  the dragons stats are unchanged except for its size. It can't use Spit Frost  Breath Weapons  Tail Attack  or Wing Attack except in dragon form. In beast form  it can attack only with its bite and claws  if appropriate to its form. If the beast form is Large or smaller  the reach of these attacks is reduced to 5 feet. In humanoid form  it can attack only with its rapier."}], "bonus_actions": null, "reactions": [{"name": "Tail Attack", "desc": "When a creature the dragon can see within 10 feet hits the dragon with a melee attack, the dragon makes a tail attack against it."}], "legendary_desc": "", "legendary_actions": [{"name": "The dragon can take 3 legendary actions", "desc": "Only one legendary action can be used at a time and only at the end of another creatures turn. It regains spent legendary actions at the start of its turn."}, {"name": "Roar", "desc": "Each creature of the dragons choice within 120 feet that can hear it makes a DC 19 Charisma saving throw. On a failure, it is frightened for 1 minute. A creature repeats the saving throw at the end of its turns, ending the effect on itself on a success. When it succeeds on a saving throw or the effect ends for it, it is immune to Roar for 24 hours."}, {"name": "Wing Attack", "desc": "The dragon beats its wings. Each creature within 15 feet makes a DC 21 Dexterity saving throw. On a failure, it is pushed 10 feet away and knocked prone. The dragon can then fly up to half its fly speed."}, {"name": "Windstorm (Costs 2 Actions)", "desc": "Pounding winds surround the dragon in a 20-foot radius. A creature in this area attempting to move closer to the dragon must spend 2 feet of movement for every 1 foot closer it moves, and ranged attacks against the dragon are made with disadvantage. A creature that starts its turn in the windstorm makes a DC 20 Constitution saving throw, taking 5 (1d10) cold damage on a failure. The windstorm lasts until the start of the dragons next turn."}], "special_abilities": [{"name": "Cloud Strider", "desc": "The dragon suffers no harmful effects from high altitudes. When flying at high altitude, the dragon can, after 1 minute of concentration, discorporate into clouds. In this form, it has advantage on Stealth checks, its fly speed increases to 300 feet, it is immune to all nonmagical damage, it has resistance to magical damage, and it can't take any actions except Hide. If it takes damage or descends more than 500 feet from where it transformed, it immediately returns to its corporeal form. It can revert to its true form as an action."}, {"name": "Legendary Resistance (3/Day)", "desc": "When the dragon fails a saving throw, it can choose to succeed instead. When it does, some of its scales dissipate into clouds. If it has no more uses of this ability, its Armor Class is reduced to 17 until it finishes a long rest."}, {"name": "Innate Spellcasting", "desc": "The dragons spellcasting ability is Charisma (save DC 19). It can innately cast the following spells, requiring no material components. 3/day each:charm person, faerie fire,awaken, geas"}], "spell_list": [], "page_no": 178, "environments": [], "img_main": null, "document__slug": "menagerie", "document__title": "Level Up Advanced 5e Monstrous Menagerie", "document__license_url": "http://open5e.com/legal", "document__url": "https://www.levelup5e.com"}, {"slug": "adult-void-dragon", "desc": "_A dragon seemingly formed of the night sky has bright white stars for eyes. Lesser stars twinkle in the firmament of the dragon’s body._  \n**Children of the Stars.** Void dragons drift through the empty spaces beyond the boundaries of the mortal world, wanderers between the stars. They are aloof, mingling only with the otherworldly beings that live above and beyond the earth, including the incarnate forms of the stars themselves. When lesser creatures visit void dragons, the dragons themselves barely notice.  \n**Witnesses to the Void.** Void dragons are intensely knowledgeable creatures, but they have seen too much, lingering at the edge of the void itself. Gazing into the yawning nothing outside has taken a toll. The void dragons carry a piece of that nothing with them, and it slowly devours their being. They are all unhinged, and their madness is contagious. It flows out of them to break the minds of lesser beings when the dragons fly into a rage and lash out.  \n**Voracious Scholars.** Despite their removed existence and strange quirks, void dragons still hoard treasure. Gems that glitter like the stars of their home are particularly prized. Their crowning piece, however, is knowledge. Void dragons jealously hoard scraps of forbidden and forgotten lore of any kind and spend most of their time at home poring over these treasures. Woe to any who disturbs this collection, for nothing ignites their latent madness like a violation of their hoard.  \n\n## A Void Dragon’s Lair\n\n  \nThe true lair of a void dragon exists deep in the freezing, airless void between stars. Hidden away in caves on silently drifting asteroids or shimmering atop the ruins of a Star Citadel, the void dragon’s lair rests in the great void of space.  \nWhen a void dragon claims a home elsewhere, it forges a connection to its true lair. It prefers towering mountain peaks, valleys, or ruins at high elevation with a clear view of the sky. It can reach through space from this lair to reach its treasure hoard hidden in the void. That connection has repercussions, of course, and the most powerful void dragons leave their mark on the world around them when they roost. Intrusions from beyond and a thirst for proscribed knowledge are common near their lairs.  \nIf fought in its lair, its Challenge increases by 1, to 15 for an adult (13,000 XP) and 25 for an ancient void dragon (75,000 XP).  \n\n### Lair Actions\n\n  \nOn initiative count 20 (losing initiative ties), the dragon takes a lair action to generate one of the following effects; the dragon can’t use the same effect two rounds in a row:\n* The dragon negates natural gravity within its lair (an area affected by its gravitic breath is unaffected). Creatures drift 10 feet away from the ground over the course of a round and are restrained. Flying creatures can move at half speed, unless they have the (hover) tag or use magical flight, in which case they move normally. This effect persists until initiative count 20 on the following round.\n* The Void briefly overlaps the dragon’s lair in a 20-foot-radius sphere of blackness punctuated by deep blue streaks and pinpoints of light. The sphere is centered on a point the dragon can see within 120 feet of the dragon. The area spreads around corners, is heavily obscured, and contains no air (creatures must hold their breath). Each creature in the sphere when it appears must make a DC 15 Constitution saving throw, taking 10 (3d6) cold damage on a failed save or half as much on a successful one. Any creature that ends its turn in the sphere takes 10 (3d6) cold damage. The sphere lasts until the dragon uses this lair action again or until the dragon dies.\n* The dragon rips the fabric of space, forcing two creatures it can see within 120 feet of it to suddenly exist in the same place. Space itself repels the creatures to their original positions. Each creature takes 16 (3d10) force damage and is knocked prone, or takes half as much damage and is not knocked prone with a successful DC 15 Strength saving throw.\n  \n### Regional Effects\n\n  \nThe region containing a legendary void dragon’s lair is warped by the dragon’s magic, which creates one or more of the following effects:\n* Secrets have a way of coming to light within 6 miles of the lair. Clues are inadvertently discovered, slips of the tongue hint at a hidden truth, and creatures become morbidly curious for forbidden knowledge.\n* Light is muted within 6 miles of the lair. Nonmagical illumination, including sunlight, can’t create bright light in this area.\n* Visitations from otherworldly beings occur and disembodied voices whisper in the night within 6 miles of the dragon’s lair. Celestials, fey, and fiends of CR 2 or lower can slip into the world in this area.\n  \nIf the dragon dies, these effects fade over the course of 1d10 days.", "name": "Adult Void Dragon", "size": "Huge", "type": "Dragon", "subtype": "", "group": null, "alignment": "chaotic neutral", "armor_class": 19, "armor_desc": "natural armor", "hit_points": 229, "hit_dice": "17d12+119", "speed": {"hover": true, "walk": 40, "fly": 80}, "strength": 24, "dexterity": 10, "constitution": 25, "intelligence": 16, "wisdom": 13, "charisma": 21, "strength_save": null, "dexterity_save": 5, "constitution_save": 12, "intelligence_save": null, "wisdom_save": 6, "charisma_save": 10, "perception": 11, "skills": {"arcana": 13, "history": 13, "perception": 11, "persuasion": 10, "stealth": 5}, "damage_vulnerabilities": "", "damage_resistances": "", "damage_immunities": "cold", "condition_immunities": "charmed, frightened", "senses": "blindsight 60ft, darkvision 120ft, passive Perception 21", "languages": "Common, Draconic, Void Speech", "challenge_rating": "14", "cr": 14.0, "actions": [{"name": "Multiattack", "desc": "The dragon can use its Aura of Madness. It then makes three attacks: one with its bite and two with its claws."}, {"name": "Bite", "desc": "Melee Weapon Attack: +12 to hit, reach 10 ft., one target. Hit: 18 (2d10 + 7) piercing damage plus 7 (2d6) cold damage.", "attack_bonus": 12, "damage_dice": "2d10"}, {"name": "Claw", "desc": "Melee Weapon Attack: +12 to hit, reach 5 ft., one target. Hit: 14 (2d6 + 7) slashing damage plus 3 (1d6) cold damage.", "attack_bonus": 12, "damage_dice": "2d6"}, {"name": "Tail", "desc": "Melee Weapon Attack: +12 to hit, reach 15 ft., one target. Hit: 16 (2d8 + 7) bludgeoning damage.", "attack_bonus": 12, "damage_dice": "2d8"}, {"name": "Aura of Madness", "desc": "As ancient void dragon, with DC 18 Wisdom saving throw."}, {"name": "Breath Weapons (Recharge 5-6)", "desc": "The dragon uses one of the following breath weapons:"}, {"name": "Gravitic Breath", "desc": "The dragon exhales a 60-foot cube of powerful localized gravity, originating from the dragon. Falling damage in the area increases to 1d10 per 10 feet fallen. When a creature starts its turn within the area or enters it for the first time in a turn, including when the dragon creates the field, must make a DC 20 Dexterity saving throw. On a failure the creature is restrained. On a success the creature's speed is halved as long as it remains in the field. A restrained creature repeats the saving throw at the end of its turn. The field persists until the dragon's breath recharges, and it can't use gravitic breath twice consecutively."}, {"name": "Stellar Flare Breath", "desc": "The dragon exhales star fire in a 60- foot cone. Each creature in that area must make a DC 20 Dexterity saving throw, taking 31 (9d6) fire damage and 31 (9d6) radiant damage on a failed save, or half as much damage on a successful one."}, {"name": "Teleport", "desc": "The dragon magically teleports to any open space within 100 feet."}], "bonus_actions": null, "reactions": [{"name": "Void Twist", "desc": "When the dragon is hit by a ranged attack it can create a small rift in space to increase its AC by 5 against that attack. If the attack misses because of this increase the dragon can choose a creature within 30 feet to become the new target for that attack. Use the original attack roll to determine if the attack hits the new target."}], "legendary_desc": "The dragon can take 3 legendary actions, choosing from the options below. Only one legendary action option can be used at a time and only at the end of another creature's turn. The dragon regains spent legendary actions at the start of its turn.", "legendary_actions": [{"name": "Detect", "desc": "The dragon makes a Wisdom (Perception) check."}, {"name": "Tail Attack", "desc": "The dragon makes a tail attack."}, {"name": "Void Slip (Costs 2 Actions)", "desc": "The dragon twists the fabric of space. Each creature within 15 feet of the dragon must succeed on a DC 18 Dexterity saving throw or take 12 (2d6 + 5) bludgeoning damage and be knocked prone. The dragon can then teleport to an unoccupied space within 40 feet."}, {"name": "Void Cache (Costs 3 Actions)", "desc": "The dragon can magically reach into its treasure hoard and retrieve one item. If it is holding an item, it can use this ability to deposit the item into its hoard."}], "special_abilities": [{"name": "Chill of the Void", "desc": "Cold damage dealt by the void dragon ignores resistance to cold damage, but not cold immunity."}, {"name": "Legendary Resistance (3/Day)", "desc": "If the dragon fails a saving throw, it can choose to succeed instead."}, {"name": "Void Dweller", "desc": "As ancient void dragon."}], "spell_list": [], "page_no": 139, "environments": [], "img_main": null, "document__slug": "tob", "document__title": "Tome of Beasts", "document__license_url": "http://open5e.com/legal", "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-for-5th-edition-print/"}, {"slug": "adult-wasteland-dragon", "desc": "", "name": "Adult Wasteland Dragon", "size": "Huge", "type": "Dragon", "subtype": "", "group": null, "alignment": "chaotic evil", "armor_class": 18, "armor_desc": "natural armor", "hit_points": 225, "hit_dice": "18d12+108", "speed": {"burrow": 30, "climb": 40, "fly": 70, "walk": 40}, "strength": 26, "dexterity": 10, "constitution": 21, "intelligence": 14, "wisdom": 13, "charisma": 16, "strength_save": null, "dexterity_save": 6, "constitution_save": 11, "intelligence_save": null, "wisdom_save": null, "charisma_save": null, "perception": 6, "skills": {"perception": 6, "stealth": 5}, "damage_vulnerabilities": "", "damage_resistances": "", "damage_immunities": "force", "condition_immunities": "", "senses": "blindsight 60 ft., darkvision 120 ft., passive Perception 16", "languages": "Common, Draconic", "challenge_rating": "17", "cr": 17.0, "actions": [{"desc": "The dragon can use its Frightful Presence. It then makes three attacks: one with its bite and two with its claws.", "name": "Multiattack"}, {"attack_bonus": 12, "damage_dice": "2d10+8", "desc": "Melee Weapon Attack: +12 to hit, reach 10 ft., one target. Hit: 19 (2d10 + 8) piercing damage.", "name": "Bite"}, {"attack_bonus": 12, "damage_dice": "2d6+8", "desc": "Melee Weapon Attack: +12 to hit, reach 5 ft., one target. Hit: 15 (2d6 + 8) slashing damage.", "name": "Claw"}, {"attack_bonus": 12, "damage_dice": "2d8+8", "desc": "Melee Weapon Attack: +12 to hit, reach 15 ft., one target. Hit: 17 (2d8 + 8) bludgeoning damage.", "name": "Tail"}, {"desc": "Each creature of the dragon's choice that is within 120 feet of the dragon and aware of it must succeed on a DC 18 Wisdom saving throw or become frightened for 1 minute. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. If a creature's saving throw is successful or the effect ends for it, the creature is immune to the dragon's Frightful Presence for the next 24 hours.", "name": "Frightful Presence"}, {"desc": "The dragon blasts warped arcane energy in a 60-foot line that is 5 feet wide. Each creature in that line must make a DC 18 Dexterity saving throw, taking 49 (11d8) force damage on a failed save, or half as much damage on a successful one.", "name": "Warped Energy Breath (Recharge 5-6)"}], "bonus_actions": null, "reactions": null, "legendary_desc": "The dragon can take 3 legendary actions, choosing from the options below. Only one legendary action option can be used at a time and only at the end of another creature's turn. The dragon regains spent legendary actions at the start of its turn.", "legendary_actions": [{"desc": "The dragon makes a Wisdom (Perception) check.", "name": "Detect"}, {"desc": "The dragon makes a tail attack.", "name": "Tail Attack"}, {"desc": "The dragon beats its wings. Each creature within 10 feet of the dragon must succeed on a DC 18 Dexterity saving throw or take 15 (2d6 + 8) bludgeoning damage and be knocked prone. The dragon can then fly up to half its flying speed.", "name": "Wing Attack (Costs 2 Actions)"}], "special_abilities": [{"desc": "If the dragon fails a saving throw, it can choose to succeed instead.", "name": "Legendary Resistance (3/Day)"}], "spell_list": [], "page_no": 118, "environments": [], "img_main": null, "document__slug": "cc", "document__title": "Creature Codex", "document__license_url": "http://open5e.com/legal", "document__url": "https://koboldpress.com/kpstore/product/creature-codex-for-5th-edition-dnd/"}, {"slug": "adult-white-dragon", "desc": "", "name": "Adult White Dragon", "size": "Huge", "type": "Dragon", "subtype": "", "group": "White Dragon", "alignment": "chaotic evil", "armor_class": 18, "armor_desc": "natural armor", "hit_points": 200, "hit_dice": "16d12+96", "speed": {"walk": 40, "burrow": 30, "fly": 80, "swim": 40}, "strength": 22, "dexterity": 10, "constitution": 22, "intelligence": 8, "wisdom": 12, "charisma": 12, "strength_save": null, "dexterity_save": 5, "constitution_save": 11, "intelligence_save": null, "wisdom_save": 6, "charisma_save": 6, "perception": 11, "skills": {"perception": 11, "stealth": 5}, "damage_vulnerabilities": "", "damage_resistances": "", "damage_immunities": "cold", "condition_immunities": "", "senses": "blindsight 60 ft., darkvision 120 ft., passive Perception 21", "languages": "Common, Draconic", "challenge_rating": "13", "cr": 13.0, "actions": [{"name": "Multiattack", "desc": "The dragon can use its Frightful Presence. It then makes three attacks: one with its bite and two with its claws."}, {"name": "Bite", "desc": "Melee Weapon Attack: +11 to hit, reach 10 ft., one target. Hit: 17 (2d10 + 6) piercing damage plus 4 (1d8) cold damage.", "attack_bonus": 11, "damage_dice": "2d10+1d8", "damage_bonus": 6}, {"name": "Claw", "desc": "Melee Weapon Attack: +11 to hit, reach 5 ft., one target. Hit: 13 (2d6 + 6) slashing damage.", "attack_bonus": 11, "damage_dice": "2d6", "damage_bonus": 6}, {"name": "Tail", "desc": "Melee Weapon Attack: +11 to hit, reach 15 ft., one target. Hit: 15 (2d8 + 6) bludgeoning damage.", "attack_bonus": 11, "damage_dice": "2d8", "damage_bonus": 6}, {"name": "Frightful Presence", "desc": "Each creature of the dragon's choice that is within 120 ft. of the dragon and aware of it must succeed on a DC 14 Wisdom saving throw or become frightened for 1 minute. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. If a creature's saving throw is successful or the effect ends for it, the creature is immune to the dragon's Frightful Presence for the next 24 hours."}, {"name": "Cold Breath (Recharge 5-6)", "desc": "The dragon exhales an icy blast in a 60-foot cone. Each creature in that area must make a DC 19 Constitution saving throw, taking 54 (12d8) cold damage on a failed save, or half as much damage on a successful one.", "attack_bonus": 0, "damage_dice": "12d8"}], "bonus_actions": null, "reactions": null, "legendary_desc": "The dragon can take 3 legendary actions, choosing from the options below. Only one legendary action option can be used at a time and only at the end of another creature's turn. The dragon regains spent legendary actions at the start of its turn.", "legendary_actions": [{"name": "Detect", "desc": "The dragon makes a Wisdom (Perception) check."}, {"name": "Tail Attack", "desc": "The dragon makes a tail attack."}, {"name": "Wing Attack (Costs 2 Actions)", "desc": "The dragon beats its wings. Each creature within 10 ft. of the dragon must succeed on a DC 19 Dexterity saving throw or take 13 (2d6 + 6) bludgeoning damage and be knocked prone. The dragon can then fly up to half its flying speed."}], "special_abilities": [{"name": "Ice Walk", "desc": "The dragon can move across and climb icy surfaces without needing to make an ability check. Additionally, difficult terrain composed of ice or snow doesn't cost it extra movement."}, {"name": "Legendary Resistance (3/Day)", "desc": "If the dragon fails a saving throw, it can choose to succeed instead."}], "spell_list": [], "page_no": 289, "environments": ["Tundra", "Arctic"], "img_main": null, "document__slug": "wotc-srd", "document__title": "5e Core Rules", "document__license_url": "http://open5e.com/legal", "document__url": "http://dnd.wizards.com/articles/features/systems-reference-document-srd"}, {"slug": "adult-white-dragon-a5e", "desc": "", "name": "Adult White Dragon", "size": "Huge", "type": "Dragon", "subtype": "", "group": null, "alignment": "", "armor_class": 18, "armor_desc": "", "hit_points": 250, "hit_dice": "20d12+120", "speed": {"walk": 40, "burrow": 30, "fly": 80, "swim": 40}, "strength": 22, "dexterity": 12, "constitution": 22, "intelligence": 8, "wisdom": 14, "charisma": 14, "strength_save": null, "dexterity_save": 6, "constitution_save": 11, "intelligence_save": null, "wisdom_save": 7, "charisma_save": 7, "perception": null, "skills": {"intimidation": 7, "perception": 7, "stealth": 6}, "damage_vulnerabilities": "", "damage_resistances": "", "damage_immunities": "cold", "condition_immunities": "", "senses": "blindsight 60 ft., darkvision 120 ft., passive Perception 20", "languages": "Common, Draconic", "challenge_rating": "16", "cr": 16.0, "actions": [{"name": "Multiattack", "desc": "The dragon attacks once with its bite and twice with its claws. In place of its bite attack  it can spit ice."}, {"name": "Bite", "desc": "Melee Weapon Attack: +11 to hit, reach 10 ft., one target. Hit: 22 (3d10 + 6) piercing damage plus 4 (1d8) cold damage."}, {"name": "Claw", "desc": "Melee Weapon Attack: +11 to hit, reach 5 ft., one target. Hit: 19 (3d8 + 6) slashing damage."}, {"name": "Tail", "desc": "Melee Weapon Attack: +14 to hit, reach 15 ft., one target. Hit: 15 (2d8 + 6) bludgeoning damage  and the dragon pushes the target 10 feet away."}, {"name": "Spit Ice", "desc": "The dragon targets a creature within 60 feet  forcing it to make a DC 19 Dexterity saving throw. On a failure  the target takes 16 (3d10) cold damage  and its speed is reduced to 0 until the end of its next turn. On a success  it takes half damage."}, {"name": "Cold Breath (Recharge 5-6)", "desc": "The dragon exhales a 60-foot cone of frost. Each creature in the area makes a DC 19 Constitution saving throw. On a failure  it takes 52 (15d6) cold damage  and its speed is reduced to 0 until the end of its next turn. On a success  it takes half damage."}], "bonus_actions": null, "reactions": [{"name": "Tail Attack", "desc": "When a creature the dragon can see within 10 feet hits the dragon with a melee attack, the dragon makes a tail attack against it."}], "legendary_desc": "", "legendary_actions": [{"name": "The dragon can take 3 legendary actions", "desc": "Only one legendary action can be used at a time and only at the end of another creatures turn. It regains spent legendary actions at the start of its turn."}, {"name": "Roar", "desc": "Each creature of the dragons choice within 120 feet that can hear it makes a DC 15 Charisma saving throw. On a failure, it is frightened for 1 minute. A creature repeats the saving throw at the end of its turn, ending the effect on itself on a success. When it succeeds on a saving throw or the effect ends for it, it is immune to Roar for 24 hours."}, {"name": "Wing Attack", "desc": "The dragon beats its wings. Each creature within 15 feet makes a DC 19 Dexterity saving throw. On a failure, it is pushed 10 feet away and knocked prone. The dragon can then fly up to half its fly speed."}, {"name": "Raging Storm (1/Day", "desc": "For 1 minute, gusts of sleet emanate from the dragon in a 40-foot-radius sphere, spreading around corners. The area is lightly obscured and the ground is difficult terrain The first time a creature moves on its turn while in the area, it must succeed on a DC 15 Dexterity saving throw or fall prone (or fall if it is flying)."}], "special_abilities": [{"name": "Cold Mastery", "desc": "The dragons movement and vision is not hindered by cold, icy surfaces, snow, wind, or storms. Additionally, the dragon can choose to burrow through snow and ice without leaving a trace."}, {"name": "Legendary Resistance (3/Day)", "desc": "When the dragon fails a saving throw, it can choose to succeed instead. When it does, it sheds some of its scales, which turn to ice. If it has no more uses of this ability, its Armor Class is reduced to 16 until it finishes a long rest."}, {"name": "Innate Spellcasting", "desc": "The dragons spellcasting ability is Charisma (save DC 15). It can innately cast the following spells, requiring no material components. 3/day each:dominate beast, fire shield, animal friendship, sleet storm"}], "spell_list": [], "page_no": 122, "environments": [], "img_main": null, "document__slug": "menagerie", "document__title": "Level Up Advanced 5e Monstrous Menagerie", "document__license_url": "http://open5e.com/legal", "document__url": "https://www.levelup5e.com"}, {"slug": "adult-wind-dragon", "desc": "_Howling wind encircles the white- and gray-scaled dragon, filling and pushing its wings without the need for them to beat._  \nWind dragons view anywhere touched by air as their property, and mortals point to them as the epitome of arrogance. Their narcissism is not without reason, for awe-inspiring power supports their claims of rightful control. To the dragons of the shifting gales, strength is the ultimate arbiter. Although wind dragon wyrmlings are the weakest of the newborn dragons, they grow in power rapidly, and few fully-grown dragons are seen as stronger.  \n_**Braggarts and Bullies.**_ Wind dragons number among the greatest bullies and worst tyrants among mortal creatures. The sometimes foolhardy creatures take personal offense at any perceived challenge and great pleasure in humiliating rivals. They claim great swathes of territory but care little for its governance, and they perceive the mortals in that territory as possessions. Vassals receive only dubious protection in exchange for unflinching loyalty. A wind dragon might seek bloody vengeance for the murder of a follower, but it’s unlikely to go to any length to prevent the loss of life in the first place.  \n_**Lords of the Far Horizons.**_ Some believe that the dragons of the winds claim much more than they are capable of controlling or patrolling. Because they so love altitude, they prefer to rule and meet with earth-bound supplicants at the highest point available: the summit of a great mountain or atop a towering monument erected by fearful slaves. But these dragons are also driven by wanderlust, and often travel far from their thrones. They always return eventually, ready to subjugate new generations and to press a tyrannical claw on the neck of anyone who questions their right to rule.  \n_**Perpetual Infighting.**_ These wandering tyrants are even more territorial among their own kind than they are among groundlings. Simple trespass by one wind dragon into the territory of another can lead to a battle to the death. Thus their numbers never grow large, and the weakest among them are frequently culled.  \nWind dragons’ hoards typically consist of only a few truly valuable relics. Other dragons might sleep on a bed of coins, but common things bore wind dragons quickly. While all true dragons desire and display great wealth, wind dragons concentrate their riches in a smaller number of notable trophies or unique historic items—often quite portable.  \n\n## Wind Dragon’s Lair\n\n  \nWind dragons make their lairs in locations where they can overlook and dominate the land they claim as theirs, but remote enough so the inhabitants can’t pester them with requests for protection or justice. They have little to fear from the elements, so a shallow cave high up on an exposed mountain face is ideal. Wind dragons enjoy heights dotted with rock spires and tall, sheer cliffs where the dragon can perch in the howling wind and catch staggering updrafts and downdrafts sweeping through the canyons and tearing across the crags. Non-flying creatures find these locations much less hospitable.  \n\n### Lair Actions\n\n  \nOn initiative count 20 (losing initiative ties), the dragon takes a lair action to generate one of the following effects; the dragon can’t use the same effect two rounds in a row.\n* Sand and dust swirls up from the floor in a 20-foot radius sphere within 120 feet of the dragon at a point the dragon can see. The sphere spreads around corners. The area inside the sphere is lightly obscured, and each creature in the sphere at the start of its turn must make a successful DC 15 Constitution saving throw or be blinded for 1 minute. A blinded creature repeats the saving throw at the start of each of its turns, ending the effect on itself with a success.\n* Fragments of ice and stone are torn from the lair’s wall by a blast of wind and flung along a 15-foot cone. Creatures in the cone take 18 (4d8) bludgeoning damage, or half damage with a successful DC 15 Dexterity saving throw.\n* A torrent of wind blasts outward from the dragon in a 60-foot radius, either racing just above the floor or near the ceiling. If near the floor, it affects all creatures standing in the radius; if near the ceiling, it affects all creatures flying in the radius. Affected creatures must make a successful DC 15 Strength saving throw or be knocked prone and stunned until the end of their next turn.", "name": "Adult Wind Dragon", "size": "Huge", "type": "Dragon", "subtype": "", "group": null, "alignment": "chaotic neutral", "armor_class": 19, "armor_desc": "natural armor", "hit_points": 237, "hit_dice": "19d12+114", "speed": {"walk": 40, "fly": 90}, "strength": 24, "dexterity": 19, "constitution": 22, "intelligence": 16, "wisdom": 15, "charisma": 18, "strength_save": null, "dexterity_save": 10, "constitution_save": 12, "intelligence_save": null, "wisdom_save": 8, "charisma_save": 10, "perception": 14, "skills": {"acrobatics": 10, "intimidation": 10, "perception": 14, "stealth": 10}, "damage_vulnerabilities": "", "damage_resistances": "", "damage_immunities": "lightning", "condition_immunities": "charmed, exhausted, paralyzed, restrained", "senses": "blindsight 10 ft., darkvision 60 ft., passive Perception 24", "languages": "Common, Draconic, Primordial", "challenge_rating": "17", "cr": 17.0, "actions": [{"name": "Multiattack", "desc": "The wind dragon can use its Frightful Presence and then makes three attacks: one with its bite, and two with its claws."}, {"name": "Bite", "desc": "Melee Weapon Attack: +13 to hit, reach 10 ft., one target. Hit: 18 (2d10 + 7) piercing damage.", "attack_bonus": 13, "damage_dice": "2d10"}, {"name": "Claw", "desc": "Melee Weapon Attack: +13 to hit, reach 5 ft., one target. Hit: 14 (2d6 + 7) slashing damage.", "attack_bonus": 13, "damage_dice": "2d6"}, {"name": "Tail", "desc": "Melee Weapon Attack: +13 to hit, reach 15 ft., one target. Hit: 16 (2d8 + 7) bludgeoning damage.", "attack_bonus": 13, "damage_dice": "2d8"}, {"name": "Breath of Gales (Recharge 5-6)", "desc": "The dragon exhales a blast of wind in a 60-foot cone. Each creature in that cone takes 27 (5d10) bludgeoning damage and is pushed 25 feet away from the dragon and knocked prone; a successful DC 20 Strength saving throw halves the damage and prevents being pushed (but not being knocked prone). All flames in the cone are extinguished."}, {"name": "Frightful Presence", "desc": "Each creature of the dragon's choice that is within 120 feet of the dragon and aware of it must succeed on a DC 18 Wisdom saving throw or become frightened for 1 minute. A creature repeats the saving throw at the end of its turn, ending the effect on itself on a success. If a creature's saving throw is successful or the effect ends for it, the creature is immune to the dragon's Frightful Presence for the next 24 hours."}], "bonus_actions": null, "reactions": null, "legendary_desc": "The dragon can take 3 legendary actions, choosing from the options below. Only one legendary action option can be used at a time and only at the end of another creature's turn. The dragon regains spent legendary actions at the start of its turn.", "legendary_actions": [{"name": "Detect", "desc": "The dragon makes a Wisdom (Perception) check."}, {"name": "Tail Attack", "desc": "The dragon makes a tail attack."}, {"name": "Wing Attack (Costs 2 Actions)", "desc": "The dragon beats its wings. Each creature within 10 feet of the dragon must succeed on a DC 21 Dexterity saving throw or take 14 (2d6 + 7) bludgeoning damage and be knocked prone. The dragon can then fly up to half its flying speed."}], "special_abilities": [{"name": "Innate Spellcasting", "desc": "the dragon's innate spellcasting ability is Charisma (spell save DC 18). It can innately cast the following spells, requiring no material components:\n\nat will: feather fall\n\n3/day: lightning bolt"}, {"name": "Fog Vision", "desc": "The dragon sees normally through light or heavy obscurement caused by fog, mist, clouds, or high wind."}, {"name": "Legendary Resistance (3/Day)", "desc": "If the dragon fails a saving throw, it can choose to succeed instead."}, {"name": "Magic Resistance", "desc": "The dragon has advantage on saving throws against spells and other magical effects."}, {"name": "Uncontrollable", "desc": "The dragon's movement is never impeded by difficult terrain, and its speed can't be reduced by spells or magical effects. It can't be restrained (per the condition), and it escapes automatically from any nonmagical restraints (such as chains, entanglement, or grappling) by spending 5 feet of movement. Being underwater imposes no penalty on its movement or attacks."}, {"name": "Whirling Winds", "desc": "Gale-force winds rage around the dragon. Ranged weapon attacks against it are made with disadvantage."}], "spell_list": [], "page_no": 143, "environments": [], "img_main": null, "document__slug": "tob", "document__title": "Tome of Beasts", "document__license_url": "http://open5e.com/legal", "document__url": "https://koboldpress.com/kpstore/product/tome-of-beasts-for-5th-edition-print/"}, {"slug": "adult_black_dragon_bf", "desc": "", "name": "Adult Black Dragon", "size": "huge", "type": "Dragon", "subtype": "", "group": "Dragons", "alignment": "", "armor_class": 19, "armor_desc": "natural armor", "hit_points": 238, "hit_dice": "", "speed": {"walk": 40, "fly": 80, "swim": 40}, "strength": 24, "dexterity": 24, "constitution": 30, "intelligence": 14, "wisdom": 24, "charisma": 26, "strength_save": 7, "dexterity_save": 7, "constitution_save": 10, "intelligence_save": 2, "wisdom_save": 7, "charisma_save": 8, "perception": 22, "skills": {}, "damage_vulnerabilities": "", "damage_resistances": "", "damage_immunities": "acid,poisoned", "condition_immunities": "", "senses": "darkvision 120 ft., keensense 60 ft.", "languages": "Common,Draconic", "challenge_rating": "14", "cr": 14.0, "actions": [{"name": "Multiattack", "desc": "The dragon uses its Frightful Presence. It then makes one Bite attack and two Claw attacks."}, {"name": "Bite", "desc": "_Melee Weapon Attack:_ +12 to hit, reach 10 ft., one target. _Hit:_ 18 (2d10+7) piercing damage plus 4 (1d8) acid damage."}, {"name": "Claw", "desc": "_Melee Weapon Attack:_ +12 to hit, reach 5 ft., one target. _Hit:_ 14 (2d6+7) slashing damage."}, {"name": "Tail", "desc": "_Melee Weapon Attack:_ +12 to hit, reach 15 ft., one target. _Hit:_ 16 (2d8+7) bludgeoning damage."}, {"name": "Frightful Presence", "desc": "Each creature of the dragon's choice that is within 120 feet of the dragon and aware of it must succeed on a DC 16 WIS save or be frightened for 1 minute. A creature can repeat the save at the end of each of its turns, ending the effect on itself on a success. If a creature's save is successful or the effect ends for it, the creature is immune to the dragon's Frightful Presence for the next 24 hours."}, {"name": "Acid Breath (Recharge 5-6)", "desc": "The dragon exhales acid in a 60-foot line that is 5 feet wide. Each creature in that line must make a DC 18 DEX save, taking 49 (11d8) acid damage on a failed save, or half as much damage on a successful one."}], "bonus_actions": [], "reactions": [], "legendary_desc": "The dragon can take 3 legendary actions, choosing from the options below. Only one legendary action can be used at a time and only at the end of another creature's turn. The dragon regains spent legendary actions at the start of its turn.", "legendary_actions": [{"name": "Detect", "desc": "The dragon automatically detects every creature and trap within 30 feet of it, pinpointing the current location of each."}, {"name": "Tail Attack", "desc": "The dragon makes a Tail attack."}, {"name": "Elemental Roar (Costs 2 Actions)", "desc": "The dragon roars at up to two creatures of its choice within 120 feet of it. Each target must succeed on a DC 16 CHA save or be vulnerable to acid damage until the end of its next turn. A target resistant to acid damage isn't resistant to it for the duration. A target immune to acid damage is still immune to it, even if the target fails the save."}, {"name": "Wing Attack (Costs 2 Actions)", "desc": "The dragon beats its wings. Each creature within 10 feet of the dragon must succeed on a DC 20 DEX save or take 14 (2d6+7) bludgeoning damage and be knocked prone. The dragon can then fly up to half its flying speed without provoking opportunity attacks."}], "special_abilities": [{"name": "Acidic Vapors", "desc": "After the black dragon uses its Acid Breath, acid clings to its mouth, throat, and nostrils for a time, evaporating as the dragon breathes. While the dragon's Acid Breath is unavailable, acidic vapors surround it, and each creature that starts its turn within 20 feet of the dragon must succeed on a DC 18 CON save or be poisoned until the start of its next turn."}, {"name": "Amphibious", "desc": "The dragon can breathe air and water."}, {"name": "Legendary Resistance (3/Day)", "desc": "If the dragon fails a save, it can choose to succeed instead."}], "spell_list": [], "page_no": null, "environments": [], "img_main": null, "document__slug": "blackflag", "document__title": "Black Flag SRD", "document__license_url": "https://paizo.com/orclicense", "document__url": "https://koboldpress.com/black-flag-reference-document/"}, {"slug": "adult_blue_dragon_bf", "desc": "", "name": "Adult Blue Dragon", "size": "huge", "type": "Dragon", "subtype": "", "group": "Dragons", "alignment": "", "armor_class": 19, "armor_desc": "natural armor", "hit_points": 267, "hit_dice": "", "speed": {"walk": 40, "burrow": 30, "fly": 80}, "strength": 24, "dexterity": 20, "constitution": 32, "intelligence": 16, "wisdom": 24, "charisma": 28, "strength_save": 7, "dexterity_save": 5, "constitution_save": 11, "intelligence_save": 3, "wisdom_save": 7, "charisma_save": 9, "perception": 22, "skills": {}, "damage_vulnerabilities": "", "damage_resistances": "", "damage_immunities": "lightning", "condition_immunities": "", "senses": "darkvision 120 ft., keensense 60 ft.", "languages": "Common,Draconic", "challenge_rating": "16", "cr": 16.0, "actions": [{"name": "Multiattack", "desc": "The dragon uses its Frightful Presence. It then makes one Bite attack and two Claw attacks."}, {"name": "Bite", "desc": "_Melee Weapon Attack:_ +12 to hit, reach 10 ft., one target. _Hit:_ 18 (2d10+7) piercing damage plus 5 (1d10) lightning damage."}, {"name": "Claw", "desc": "_Melee Weapon Attack:_ +12 to hit, reach 5 ft., one target. _Hit:_ 14 (2d6+7) slashing damage."}, {"name": "Tail", "desc": "_Melee Weapon Attack:_ +12 to hit, reach 15 ft., one target. _Hit:_ 16 (2d8+7) bludgeoning damage."}, {"name": "Frightful Presence", "desc": "Each creature of the dragon's choice that is within 120 feet of the dragon and aware of it must succeed on a DC 17 WIS save or be frightened for 1 minute. A creature can repeat the save at the end of each of its turns, ending the effect on itself on a success. If a creature's save is successful or the effect ends for it, the creature is immune to the dragon's Frightful Presence for the next 24 hours."}, {"name": "Lightning Breath (Recharge 5-6)", "desc": "The dragon exhales lightning in a 90-foot line that is 5 feet wide. Each creature in that line must make a DC 19 DEX save, taking 66 (12d10) lightning damage on a failed save, or half as much damage on a successful one."}], "bonus_actions": [], "reactions": [], "legendary_desc": "The dragon can take 3 legendary actions, choosing from the options below. Only one legendary action can be used at a time and only at the end of another creature's turn. The dragon regains spent legendary actions at the start of its turn.", "legendary_actions": [{"name": "Detect", "desc": "The dragon automatically detects every creature and trap within 30 feet of it, pinpointing the current location of each."}, {"name": "Tail Attack", "desc": "The dragon makes a Tail attack."}, {"name": "Elemental Roar (Costs 2 Actions)", "desc": "The dragon roars at up to two creatures of its choice within 120 feet of it. Each target must succeed on a DC 17 CHA save or be vulnerable to lightning damage until the end of its next turn. A target resistant to lightning damage isn't resistant to it for the duration. A target immune to lightning damage is still immune to it, even if the target fails the save."}, {"name": "Wing Attack (Costs 2 Actions)", "desc": "The dragon beats its wings. Each creature within 10 feet of the dragon must succeed on a DC 20 DEX save or take 14 (2d6+7) bludgeoning damage and be knocked prone. The dragon can then fly up to half its flying speed without provoking opportunity attacks."}], "special_abilities": [{"name": "Charged Hide", "desc": "When the blue dragon hasn't exhaled its Lightning Breath, the electric charge builds up across its body. While the dragon's Lightning Breath is available, it emits wild sparks of electricity, and each creature that starts its turn within 20 feet of the dragon must succeed on a DC 19 CON save or be incapacitated until the start of its next turn."}, {"name": "Legendary Resistance (3/Day)", "desc": "If the dragon fails a save, it can choose to succeed instead."}], "spell_list": [], "page_no": null, "environments": [], "img_main": null, "document__slug": "blackflag", "document__title": "Black Flag SRD", "document__license_url": "https://paizo.com/orclicense", "document__url": "https://koboldpress.com/black-flag-reference-document/"}, {"slug": "adult_brass_dragon_bf", "desc": "", "name": "Adult Brass Dragon", "size": "huge", "type": "Dragon", "subtype": "", "group": "Dragons", "alignment": "", "armor_class": 18, "armor_desc": "natural armor", "hit_points": 225, "hit_dice": "", "speed": {"walk": 40, "burrow": 30, "fly": 80}, "strength": 22, "dexterity": 20, "constitution": 30, "intelligence": 14, "wisdom": 22, "charisma": 26, "strength_save": 6, "dexterity_save": 5, "constitution_save": 10, "intelligence_save": 2, "wisdom_save": 6, "charisma_save": 8, "perception": 21, "skills": {}, "damage_vulnerabilities": "", "damage_resistances": "", "damage_immunities": "fire", "condition_immunities": "", "senses": "darkvision 120 ft., keensense 60 ft.", "languages": "Common,Draconic", "challenge_rating": "13", "cr": 13.0, "actions": [{"name": "Multiattack", "desc": "The dragon uses its Frightful Presence. It then makes one Bite attack and two Claw attacks. It can replace its Bite attack with a use of Sleep Breath, if available."}, {"name": "Bite", "desc": "_Melee Weapon Attack:_ +11 to hit, reach 10 ft., one target. _Hit:_ 17 (2d10+6) piercing damage."}, {"name": "Claw", "desc": "_Melee Weapon Attack:_ +11 to hit, reach 5 ft., one target. _Hit:_ 13 (2d6+6) slashing damage."}, {"name": "Tail", "desc": "_Melee Weapon Attack:_ +11 to hit, reach 15 ft., one target. _Hit:_ 15 (2d8+6) bludgeoning damage."}, {"name": "Frightful Presence", "desc": "Each creature of the dragon's choice that is within 120 feet of the dragon and aware of it must succeed on a DC 16 WIS save or be frightened for 1 minute. A creature can repeat the save at the end of each of its turns, ending the effect on itself on a success. If a creature's save is successful or the effect ends for it, the creature is immune to the dragon's Frightful Presence for the next 24 hours."}, {"name": "Fire Breath (Recharge 5-6)", "desc": "The dragon exhales fire in a 90-foot line that is 5 feet wide. Each creature in that line must make a DC 18 DEX save, taking 45 (13d6) fire damage on a failed save, or half as much damage on a successful one."}, {"name": "Sleep Breath (Recharge 6)", "desc": "The dragon exhales sleep gas in a 60-foot cone. Each creature in that area must succeed on a DC 18 CON save or fall unconscious for 5 minutes. This effect ends for a creature if the creature takes damage or another creature uses an action to wake it."}], "bonus_actions": [{"name": "Change Shape", "desc": "The dragon magically transforms into a Beast or Humanoid that has a challenge rating no higher than its own, or back into its true form, which is Dragon. Any equipment it is wearing or carrying transforms with it or is borne by the new form (the dragon's choice). It reverts to its true form if it dies. In a new form, the dragon retains its Legendary Resistance trait and its HP, ability to speak, proficiencies, and INT, WIS, and CHA scores, as well as this bonus action. Its statistics and capabilities are otherwise replaced by those of the new form, except any class features or legendary actions of that form."}], "reactions": [], "legendary_desc": "The dragon can take 3 legendary actions, choosing from the options below. Only one legendary action can be used at a time and only at the end of another creature's turn. The dragon regains spent legendary actions at the start of its turn.", "legendary_actions": [{"name": "Detect", "desc": "The dragon automatically detects every creature and trap within 30 feet of it, pinpointing the current location of each."}, {"name": "Tail Attack", "desc": "The dragon makes a Tail attack."}, {"name": "Elemental Roar (Costs 2 Actions)", "desc": "The dragon roars at up to two creatures of its choice within 120 feet of it. Each target must succeed on a DC 16 CHA save or be vulnerable to fire damage until the end of its next turn. A target resistant to fire damage isn't resistant to it for the duration. A target immune to fire damage is still immune to it, even if the target fails the save."}, {"name": "Wing Attack (Costs 2 Actions)", "desc": "The dragon beats its wings. Each creature within 10 feet of the dragon must succeed on a DC 19 DEX save or take 13 (2d6+6) bludgeoning damage and be knocked prone. The dragon can then fly up to half its flying speed without provoking opportunity attacks."}], "special_abilities": [{"name": "Legendary Resistance (3/Day)", "desc": "If the dragon fails a save, it can choose to succeed instead."}, {"name": "Suffocating Heat", "desc": "As the **young brass dragon**, except it affects creatures within 20 feet of the dragon, and the save DC is 18."}], "spell_list": [], "page_no": null, "environments": [], "img_main": null, "document__slug": "blackflag", "document__title": "Black Flag SRD", "document__license_url": "https://paizo.com/orclicense", "document__url": "https://koboldpress.com/black-flag-reference-document/"}, {"slug": "adult_bronze_dragon_bf", "desc": "", "name": "Adult Bronze Dragon", "size": "huge", "type": "Dragon", "subtype": "", "group": "Dragons", "alignment": "", "armor_class": 19, "armor_desc": "natural armor", "hit_points": 255, "hit_dice": "", "speed": {"walk": 40, "fly": 80, "swim": 40}, "strength": 24, "dexterity": 20, "constitution": 32, "intelligence": 16, "wisdom": 24, "charisma": 28, "strength_save": 7, "dexterity_save": 5, "constitution_save": 11, "intelligence_save": 3, "wisdom_save": 7, "charisma_save": 9, "perception": 22, "skills": {}, "damage_vulnerabilities": "", "damage_resistances": "", "damage_immunities": "lightning", "condition_immunities": "", "senses": "darkvision 120 ft., keensense 60 ft.", "languages": "Common,Draconic", "challenge_rating": "15", "cr": 15.0, "actions": [{"name": "Multiattack", "desc": "The dragon uses its Frightful Presence. It then makes one Bite attack and two Claw attacks. It can replace its Bite attack with a use of Repulsion Breath, if available."}, {"name": "Bite", "desc": "_Melee Weapon Attack:_ +12 to hit, reach 10 ft., one target. _Hit:_ 18 (2d10+7) piercing damage."}, {"name": "Claw", "desc": "_Melee Weapon Attack:_ +12 to hit, reach 5 ft., one target. _Hit:_ 14 (2d6+7) slashing damage."}, {"name": "Tail", "desc": "_Melee Weapon Attack:_ +12 to hit, reach 15 ft., one target. _Hit:_ 16 (2d8+7) bludgeoning damage."}, {"name": "Frightful Presence", "desc": "Each creature of the dragon's choice that is within 120 feet of the dragon and aware of it must succeed on a DC 17 WIS save or be frightened for 1 minute. A creature can repeat the save at the end of each of its turns, ending the effect on itself on a success. If a creature's save is successful or the effect ends for it, the creature is immune to the dragon's Frightful Presence for the next 24 hours."}, {"name": "Lightning Breath (Recharge 5-6)", "desc": "The dragon exhales lightning in a 90-foot line that is 5 feet wide. Each creature in that line must make a DC 19 DEX save, taking 60 (11d10) lightning damage on a failed save, or half as much damage on a successful one."}, {"name": "Repulsion Breath (Recharge 6)", "desc": "The dragon exhales repulsion energy in a 60-foot cone. Each creature in that area must succeed on a DC 19 STR save or be pushed up to 30 feet away from the dragon."}], "bonus_actions": [{"name": "Change Shape", "desc": "The dragon magically transforms into a Beast or Humanoid that has a challenge rating no higher than its own, or back into its true form, which is Dragon. Any equipment it is wearing or carrying transforms with it or is borne by the new form (the dragon's choice). It reverts to its true form if it dies. In a new form, the dragon retains its Legendary Resistance trait and its HP, ability to speak, proficiencies, and INT, WIS, and CHA scores, as well as this bonus action. Its statistics and capabilities are otherwise replaced by those of the new form, except any class features or legendary actions of that form."}], "reactions": [], "legendary_desc": "The dragon can take 3 legendary actions, choosing from the options below. Only one legendary action can be used at a time and only at the end of another creature's turn. The dragon regains spent legendary actions at the start of its turn.", "legendary_actions": [{"name": "Detect", "desc": "The dragon automatically detects every creature and trap within 30 feet of it, pinpointing the current location of each."}, {"name": "Tail Attack", "desc": "The dragon makes a Tail attack."}, {"name": "Elemental Roar (Costs 2 Actions)", "desc": "The dragon roars at up to two creatures of its choice within 120 feet of it. Each target must succeed on a DC 17 CHA save or be vulnerable to lightning damage until the end of its next turn. A target resistant to lightning damage isn't resistant to it for the duration. A target immune to lightning damage is still immune to it, even if the target fails the save."}, {"name": "Wing Attack (Costs 2 Actions)", "desc": "The dragon beats its wings. Each creature within 10 feet of the dragon must succeed on a DC 20 DEX save or take 14 (2d6+7) bludgeoning damage and be knocked prone. The dragon can then fly up to half its flying speed without provoking opportunity attacks."}], "special_abilities": [{"name": "Amphibious", "desc": "The dragon can breathe air and water."}, {"name": "Legendary Resistance (3/Day)", "desc": "If the dragon fails a save, it can choose to succeed instead."}, {"name": "Lightning Extraction", "desc": "As the **young bronze dragon**, except it affects creatures within 20 feet of the dragon, and the save DC is 19."}], "spell_list": [], "page_no": null, "environments": [], "img_main": null, "document__slug": "blackflag", "document__title": "Black Flag SRD", "document__license_url": "https://paizo.com/orclicense", "document__url": "https://koboldpress.com/black-flag-reference-document/"}, {"slug": "adult_copper_dragon_bf", "desc": "", "name": "Adult Copper Dragon", "size": "huge", "type": "Dragon", "subtype": "", "group": "Dragons", "alignment": "", "armor_class": 18, "armor_desc": "natural armor", "hit_points": 252, "hit_dice": "", "speed": {"walk": 40, "climb": 40, "fly": 80}, "strength": 22, "dexterity": 22, "constitution": 30, "intelligence": 18, "wisdom": 24, "charisma": 26, "strength_save": 6, "dexterity_save": 6, "constitution_save": 10, "intelligence_save": 4, "wisdom_save": 7, "charisma_save": 8, "perception": 22, "skills": {}, "damage_vulnerabilities": "", "damage_resistances": "", "damage_immunities": "acid", "condition_immunities": "", "senses": "darkvision 120 ft., keensense 60 ft.", "languages": "Common,Draconic", "challenge_rating": "14", "cr": 14.0, "actions": [{"name": "Multiattack", "desc": "The dragon uses its Frightful Presence. It then makes one Bite attack and two Claw attacks. It can replace its Bite attack with a use of Slowing Breath, if available."}, {"name": "Bite", "desc": "_Melee Weapon Attack:_ +11 to hit, reach 10 ft., one target. _Hit:_ 17 (2d10+6) piercing damage."}, {"name": "Claw", "desc": "_Melee Weapon Attack:_ +11 to hit, reach 5 ft., one target. _Hit:_ 13 (2d6+6) slashing damage."}, {"name": "Tail", "desc": "_Melee Weapon Attack:_ +11 to hit, reach 15 ft., one target. _Hit:_ 15 (2d8+6) bludgeoning damage."}, {"name": "Frightful Presence", "desc": "Each creature of the dragon's choice that is within 120 feet of the dragon and aware of it must succeed on a DC 16 WIS save or be frightened for 1 minute. A creature can repeat the save at the end of each of its turns, ending the effect on itself on a success. If a creature's save is successful or the effect ends for it, the creature is immune to the dragon's Frightful Presence for the next 24 hours."}, {"name": "Acid Breath (Recharge 5-6)", "desc": "The dragon exhales acid in a 90-foot line that is 5 feet wide. Each creature in that line must make a DC 18 DEX save, taking 54 (12d8) acid damage on a failed save, or half as much damage on a successful one."}, {"name": "Slowing Breath (Recharge 6)", "desc": "As the **copper dragon wyrmling**, except it is a 60-foot cone, and the save DC is 18."}], "bonus_actions": [{"name": "Change Shape", "desc": "The dragon magically transforms into a Beast or Humanoid that has a challenge rating no higher than its own, or back into its true form, which is Dragon. Any equipment it is wearing or carrying transforms with it or is borne by the new form (the dragon's choice). It reverts to its true form if it dies. In a new form, the dragon retains its Legendary Resistance trait and its HP, ability to speak, proficiencies, and INT, WIS, and CHA scores, as well as this bonus action. Its statistics and capabilities are otherwise replaced by those of the new form, except any class features or legendary actions of that form."}], "reactions": [], "legendary_desc": "The dragon can take 3 legendary actions, choosing from the options below. Only one legendary action can be used at a time and only at the end of another creature's turn. The dragon regains spent legendary actions at the start of its turn.", "legendary_actions": [{"name": "Detect", "desc": "The dragon automatically detects every creature and trap within 30 feet of it, pinpointing the current location of each."}, {"name": "Tail Attack", "desc": "The dragon makes a Tail attack."}, {"name": "Elemental Roar (Costs 2 Actions)", "desc": "The dragon roars at up to two creatures of its choice within 120 feet of it. Each target must succeed on a DC 16 CHA save or be vulnerable to acid damage until the end of its next turn. A target resistant to acid damage isn't resistant to it for the duration. A target immune to acid damage is still immune to it, even if the target fails the save."}, {"name": "Wing Attack (Costs 2 Actions)", "desc": "The dragon beats its wings. Each creature within 10 feet of the dragon must succeed on a DC 19 DEX save or take 13 (2d6+6) bludgeoning damage and be knocked prone. The dragon can then fly up to half its flying speed without provoking opportunity attacks."}], "special_abilities": [{"name": "Corrosive Scales", "desc": "As the **young copper dragon**."}, {"name": "Legendary Resistance (3/Day)", "desc": "If the dragon fails a save, it can choose to succeed instead."}], "spell_list": [], "page_no": null, "environments": [], "img_main": null, "document__slug": "blackflag", "document__title": "Black Flag SRD", "document__license_url": "https://paizo.com/orclicense", "document__url": "https://koboldpress.com/black-flag-reference-document/"}, {"slug": "adult_gold_dragon_bf", "desc": "", "name": "Adult Gold Dragon", "size": "huge", "type": "Dragon", "subtype": "", "group": "Dragons", "alignment": "", "armor_class": 19, "armor_desc": "natural armor", "hit_points": 284, "hit_dice": "", "speed": {"walk": 40, "fly": 80, "swim": 40}, "strength": 26, "dexterity": 26, "constitution": 36, "intelligence": 18, "wisdom": 32, "charisma": 30, "strength_save": 8, "dexterity_save": 8, "constitution_save": 13, "intelligence_save": 4, "wisdom_save": 11, "charisma_save": 10, "perception": 27, "skills": {}, "damage_vulnerabilities": "", "damage_resistances": "", "damage_immunities": "fire", "condition_immunities": "", "senses": "darkvision 120 ft., keensense 60 ft.", "languages": "Common,Draconic", "challenge_rating": "17", "cr": 17.0, "actions": [{"name": "Multiattack", "desc": "The dragon uses its Frightful Presence. It then makes one Bite attack and two Claw attacks. It can replace its Bite attack with a use of Weakening Breath, if available."}, {"name": "Bite", "desc": "_Melee Weapon Attack:_ +14 to hit, reach 10 ft., one target. _Hit:_ 19 (2d10+8) piercing damage."}, {"name": "Claw", "desc": "_Melee Weapon Attack:_ +14 to hit, reach 5 ft., one target. _Hit:_ 15 (2d6+8) slashing damage."}, {"name": "Tail", "desc": "_Melee Weapon Attack:_ +14 to hit, reach 15 ft., one target. _Hit:_ 17 (2d8+8) bludgeoning damage."}, {"name": "Frightful Presence", "desc": "Each creature of the dragon's choice that is within 120 feet of the dragon and aware of it must succeed on a DC 18 WIS save or be frightened for 1 minute. A creature can repeat the save at the end of each of its turns, ending the effect on itself on a success. If a creature's save is successful or the effect ends for it, the creature is immune to the dragon's Frightful Presence for the next 24 hours."}, {"name": "Fire Breath (Recharge 5-6)", "desc": "The dragon exhales fire in a 60-foot cone. Each creature in that area must make a DC 21 DEX save, taking 71 (13d10) fire damage on a failed save, or half as much damage on a successful one."}, {"name": "Weakening Breath (Recharge 6)", "desc": "As the **gold dragon wyrmling**, except it is a 60-foot cone, and the save DC is 21."}], "bonus_actions": [{"name": "Change Shape", "desc": "The dragon magically transforms into a Beast or Humanoid that has a challenge rating no higher than its own, or back into its true form, which is Dragon. Any equipment it is wearing or carrying transforms with it or is borne by the new form (the dragon's choice). It reverts to its true form if it dies. In a new form, the dragon retains its Legendary Resistance trait and its HP, ability to speak, proficiencies, and INT, WIS, and CHA scores, as well as this bonus action. Its statistics and capabilities are otherwise replaced by those of the new form, except any class features or legendary actions of that form."}], "reactions": [], "legendary_desc": "The dragon can take 3 legendary actions, choosing from the options below. Only one legendary action can be used at a time and only at the end of another creature's turn. The dragon regains spent legendary actions at the start of its turn.", "legendary_actions": [{"name": "Detect", "desc": "The dragon automatically detects every creature and trap within 30 feet of it, pinpointing the current location of each."}, {"name": "Tail Attack", "desc": "The dragon makes a Tail attack."}, {"name": "Elemental Roar (Costs 2 Actions)", "desc": "The dragon roars at up to two creatures of its choice within 120 feet of it. Each target must succeed on a DC 18 CHA save or be vulnerable to fire damage until the end of its next turn. A target resistant to fire damage isn't resistant to it for the duration. A target immune to fire damage is still immune to it, even if the target fails the save."}, {"name": "Wing Attack (Costs 2 Actions)", "desc": "The dragon beats its wings. Each creature within 10 feet of the dragon must succeed on a DC 22 DEX save or take 15 (2d6+8) bludgeoning damage and be knocked prone. The dragon can then fly up to half its flying speed without provoking opportunity attacks."}], "special_abilities": [{"name": "Amphibious", "desc": "The dragon can breathe air and water."}, {"name": "Golden Splendor", "desc": "As the **young gold dragon**, except it affects creatures within 20 feet of the dragon, and the save DC is 21."}, {"name": "Legendary Resistance (3/Day)", "desc": "If the dragon fails a save, it can choose to succeed instead."}], "spell_list": [], "page_no": null, "environments": [], "img_main": null, "document__slug": "blackflag", "document__title": "Black Flag SRD", "document__license_url": "https://paizo.com/orclicense", "document__url": "https://koboldpress.com/black-flag-reference-document/"}, {"slug": "adult_green_dragon_bf", "desc": "", "name": "Adult Green Dragon", "size": "huge", "type": "Dragon", "subtype": "", "group": "Dragons", "alignment": "", "armor_class": 19, "armor_desc": "natural armor", "hit_points": 255, "hit_dice": "", "speed": {"walk": 40, "fly": 80, "swim": 40}, "strength": 22, "dexterity": 22, "constitution": 30, "intelligence": 22, "wisdom": 24, "charisma": 26, "strength_save": 6, "dexterity_save": 6, "constitution_save": 10, "intelligence_save": 6, "wisdom_save": 7, "charisma_save": 8, "perception": 22, "skills": {}, "damage_vulnerabilities": "", "damage_resistances": "", "damage_immunities": "poison,poisoned", "condition_immunities": "", "senses": "darkvision 120 ft., keensense 60 ft.", "languages": "Common,Draconic", "challenge_rating": "15", "cr": 15.0, "actions": [{"name": "Multiattack", "desc": "The dragon uses its Frightful Presence. It then makes one Bite attack and two Claw attacks."}, {"name": "Bite", "desc": "_Melee Weapon Attack:_ +11 to hit, reach 10 ft., one target. _Hit:_ 17 (2d10+6) piercing damage plus 7 (2d6) poison damage."}, {"name": "Claw", "desc": "_Melee Weapon Attack:_ +11 to hit, reach 5 ft., one target. _Hit:_ 13 (2d6+6) slashing damage."}, {"name": "Tail", "desc": "_Melee Weapon Attack:_ +11 to hit, reach 15 ft., one target. _Hit:_ 15 (2d8+6) bludgeoning damage."}, {"name": "Frightful Presence", "desc": "Each creature of the dragon's choice that is within 120 feet of the dragon and aware of it must succeed on a DC 16 WIS save or be frightened for 1 minute. A creature can repeat the save at the end of each of its turns, ending the effect on itself on a success. If a creature's save is successful or the effect ends for it, the creature is immune to the dragon's Frightful Presence for the next 24 hours."}, {"name": "Poison Breath (Recharge 5-6)", "desc": "The dragon exhales poisonous gas in a 60-foot cone. Each creature in that area must make a DC 18 CON save, taking 56 (16d6) poison damage on a failed save, or half as much damage on a successful one."}], "bonus_actions": [], "reactions": [], "legendary_desc": "The dragon can take 3 legendary actions, choosing from the options below. Only one legendary action can be used at a time and only at the end of another creature's turn. The dragon regains spent legendary actions at the start of its turn.", "legendary_actions": [{"name": "Detect", "desc": "The dragon automatically detects every creature and trap within 30 feet of it, pinpointing the current location of each."}, {"name": "Tail Attack", "desc": "The dragon makes a Tail attack."}, {"name": "Elemental Roar (Costs 2 Actions)", "desc": "The dragon roars at up to two creatures of its choice within 120 feet of it. Each target must succeed on a DC 16 CHA save or be vulnerable to poison damage until the end of its next turn. A target resistant to poison damage isn't resistant to it for the duration. A target immune to poison damage is still immune to it, even if the target fails the save."}, {"name": "Wing Attack (Costs 2 Actions)", "desc": "The dragon beats its wings. Each creature within 10 feet of the dragon must succeed on a DC 19 DEX save or take 13 (2d6+6) bludgeoning damage and be knocked prone. The dragon can then fly up to half its flying speed without provoking opportunity attacks."}], "special_abilities": [{"name": "Amphibious", "desc": "The dragon can breathe air and water."}, {"name": "Hallucinogenic Gas", "desc": "After the green dragon exhales its Poison Breath, wisps of poisonous gas laced with the alchemical taint that permeates the dragon's body linger around it. While the dragon's Poison Breath is unavailable, each creature that starts its turn within 20 feet of the dragon must succeed on a DC 18 WIS save or be terrified, as the gas causes the creature to experience frightful hallucinations. A terrified creature is frightened, and its speed is reduced to 0."}, {"name": "Legendary Resistance (3/Day)", "desc": "If the dragon fails a save, it can choose to succeed instead."}], "spell_list": [], "page_no": null, "environments": [], "img_main": null, "document__slug": "blackflag", "document__title": "Black Flag SRD", "document__license_url": "https://paizo.com/orclicense", "document__url": "https://koboldpress.com/black-flag-reference-document/"}, {"slug": "adult_red_dragon_bf", "desc": "", "name": "Adult Red Dragon", "size": "huge", "type": "Dragon", "subtype": "", "group": "Dragons", "alignment": "", "armor_class": 19, "armor_desc": "natural armor", "hit_points": 301, "hit_dice": "", "speed": {"walk": 40, "climb": 40, "fly": 80}, "strength": 26, "dexterity": 22, "constitution": 36, "intelligence": 16, "wisdom": 24, "charisma": 32, "strength_save": 8, "dexterity_save": 6, "constitution_save": 13, "intelligence_save": 3, "wisdom_save": 7, "charisma_save": 11, "perception": 23, "skills": {}, "damage_vulnerabilities": "", "damage_resistances": "", "damage_immunities": "fire", "condition_immunities": "", "senses": "darkvision 120 ft., keensense 60 ft.", "languages": "Common,Draconic", "challenge_rating": "17", "cr": 17.0, "actions": [{"name": "Multiattack", "desc": "The dragon uses its Frightful Presence. It then makes one Bite attack and two Claw attacks."}, {"name": "Bite", "desc": "_Melee Weapon Attack:_ +14 to hit, reach 10 ft., one target. _Hit:_ 19 (2d10+8) piercing damage plus 7 (2d6) fire damage."}, {"name": "Claw", "desc": "_Melee Weapon Attack:_ +14 to hit, reach 5 ft., one target. _Hit:_ 15 (2d6+8) slashing damage."}, {"name": "Tail", "desc": "_Melee Weapon Attack:_ +14 to hit, reach 15 ft., one target. _Hit:_ 17 (2d8+8) bludgeoning damage."}, {"name": "Frightful Presence", "desc": "Each creature of the dragon's choice that is within 120 feet of the dragon and aware of it must succeed on a DC 19 WIS save or be frightened for 1 minute. A creature can repeat the save at the end of each of its turns, ending the effect on itself on a success. If a creature's save is successful or the effect ends for it, the creature is immune to the dragon's Frightful Presence for the next 24 hours."}, {"name": "Fire Breath (Recharge 5-6)", "desc": "The dragon exhales fire in a 60-foot cone. Each creature in that area must make a DC 21 DEX save, taking 63 (18d6) fire damage on a failed save, or half as much damage on a successful one."}], "bonus_actions": [], "reactions": [], "legendary_desc": "The dragon can take 3 legendary actions, choosing from the options below. Only one legendary action can be used at a time and only at the end of another creature's turn. The dragon regains spent legendary actions at the start of its turn.", "legendary_actions": [{"name": "Detect", "desc": "The dragon automatically detects every creature and trap within 30 feet of it, pinpointing the current location of each."}, {"name": "Tail Attack", "desc": "The dragon makes a Tail attack."}, {"name": "Elemental Roar (Costs 2 Actions)", "desc": "The dragon roars at up to two creatures of its choice within 120 feet of it. Each target must succeed on a DC 19 CHA save or be vulnerable to fire damage until the end of its next turn. A target resistant to fire damage isn't resistant to it for the duration. A target immune to fire damage is still immune to it, even if the target fails the save."}, {"name": "Wing Attack (Costs 2 Actions)", "desc": "The dragon beats its wings. Each creature within 10 feet of the dragon must succeed on a DC 22 DEX save or take 15 (2d6+8) bludgeoning damage and be knocked prone. The dragon can then fly up to half its flying speed without provoking opportunity attacks."}], "special_abilities": [{"name": "Boil Over", "desc": "When the red dragon hasn't unleashed its Fire Breath, the heat builds and rolls outward from it. While the dragon's Fire Breath is available, it emits immense heat, and each creature that starts its turn within 20 feet of the dragon must succeed on a DC 21 CON save or take 7 (2d6) fire damage. A creature that fails this save by 5 or more also suffers one level of exhaustion."}, {"name": "Legendary Resistance (3/Day)", "desc": "If the dragon fails a save, it can choose to succeed instead."}], "spell_list": [], "page_no": null, "environments": [], "img_main": null, "document__slug": "blackflag", "document__title": "Black Flag SRD", "document__license_url": "https://paizo.com/orclicense", "document__url": "https://koboldpress.com/black-flag-reference-document/"}]}